[
  {
    "id": "tt0111161",
    "reviews": [
      {
        "author": { "name": "schnad", "id": "/user/ur0174908/" },
        "interestingVotes": { "down": 136, "up": 590 },
        "text": "Whenever I talk about this movie with my friends, I do not even refer to it by title, but rather as \"The Movie\".  When I say \"The Movie\", my friends know exactly what I'm talking about.  In fact the main reason that me and my friends don't refer to it by title is because this movie is so great, that we do not feel worthy enough to say it's name in vain! I still remember the first time I saw The Shawshank Redemption.  Some friends of mine and I went to see it at one of those \"Budget Theaters\" over the summer of 1995.  None of us really knew anything about the movie, but we had heard that it was pretty good.  So, not having any real expectations, we saw it.  When the final credits rolled and the lights came on in the theater, all of us just sat there with our jaws hanging down on the floor. I turned my head towards my friend Bob and said \"That was the greatest movie I have ever seen in my entire life!\" There's really no other way I can put it in words.  Every moment of this movie captivated me and inspired me to believe in the one true thing in life...... \"HOPE\".  This movie is sad, uplifting, inspiring, harsh, cold, funny (at the right times), jaw-dropping, and heart-warming all at the same time.  I get chills every time I watch this film and this film contains the greatest ending (which takes place over the last 30 minutes or so)in movie history!  How it all just \"comes together\" is so incredible and uplifting. I should also mention the music in this movie is nearly flawless as well, and the soundtrack is a \"must buy\" for any music fan. The only bad thing about this movie is the fact that I know I will never see a better movie, no matter how many I may see.  I've seen many movies over the past few years, many excellent films.  However, every time I walk out of the theater, I turn to my friend or family member that I saw it with and I say, \"That was a great movie, but it wasn't nearly as good as 'you know what'!\"  There have been many movies over the past few years that thought would really move me or that I might one day call my \"favorite of all time\", but they've all fallen far short of \"The Shawshank Redemption\". So, if you have yet to see this movie, please run to the video store immediately.  You're guaranteed to find it in the \"employee picks\" section. And if it isn't in that section, then you should tell the employees there that there is something seriously wrong with them.  If you have seen this movie, go see it again.  If you haven't bought your own copy yet, buy one. In fact buy two, and put one in a fire-proof safe, just in case of an emergency. :o) So, you want a 1-10 rating???  I give it a 13!!!!!!",
        "title": "Simply known as \"The Movie\"",
        "date": "1999-02-06"
      },
      {
        "author": { "name": "cinephile-789", "id": "/user/ur789456123/" },
        "interestingVotes": { "down": 0, "up": 13 },
        "text": "The acting was superb and the cinematography was stunning. A must-watch for any film buff.",
        "title": "Masterpiece",
        "date": "2021-02-07"
      },
      {
        "author": { "name": "filmfanatic-456", "id": "/user/ur456123789/" },
        "interestingVotes": { "down": 2, "up": 14 },
        "text": "An emotional rollercoaster that will leave you in tears. Best movie I've seen in years.",
        "title": "Heart-wrenching",
        "date": "2019-11-12"
      }
    ]
  },
  {
    "id": "tt0068646",
    "reviews": [
      {
        "author": { "name": "The-Other-Monkey", "id": "/user/ur7154267/" },
        "interestingVotes": { "down": 133, "up": 329 },
        "text": "This must rank as the best film (along with part 2)of all time.An ensemble performance that has no weak spot.\n\nParticularly, John Cazale ( Fredo) and Richard Castellano ( Clemenza) give wonderfully understated performances. You just have to believe that Castellano WAS Clemenza, he brings a real touch to his role.\n\nJohn Cazale brings the troubled Fredo to life, and you can see the weak Fredo desperately trying to live up to the family reputation but knowing that he can never be what his father wants. \n\nThe story of one man's reluctance to be drawn into the murky family business,and his gradual change through circumstance, paints a vivid picture of this violent period of US history.\n\nDo not miss this film!",
        "title": "A Masterpiece",
        "date": "2006-08-06"
      },
      {
        "author": { "name": "movie_junkie_123", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 0, "up": 7 },
        "text": "This movie was a tour de force for the lead actress. She gave an incredible performance.",
        "title": "Incredible lead performance",
        "date": "2023-02-19"
      },
      {
        "author": { "name": "cinema_critic_890", "id": "/user/ur901234567/" },
        "interestingVotes": { "down": 2, "up": 6 },
        "text": "I found this movie to be very derivative. It didn't bring anything new to the genre.",
        "title": "Derivative",
        "date": "2023-01-17"
      }
    ]
  },
  {
    "id": "tt0468569",
    "reviews": [
      {
        "author": { "name": "iamanoob0", "id": "/user/ur125367887/" },
        "interestingVotes": { "down": 2, "up": 15 },
        "text": "What can I say, it was made by Christopher Nolan so it has to be good. Amazing action. Amazing characters. Amazing director. The Dark Knight has everything. I have no problems with this movie. But the thing keeping me back from giving this movie a 10 is that something about it just didn't fully connect with me.\n\nOverall rating: 9.4.",
        "title": "Christopher Nolan back at it again.",
        "date": "2020-12-09"
      },
      {
        "author": { "name": "film_enthusiast_567", "id": "/user/ur789012345/" },
        "interestingVotes": { "down": 1, "up": 8 },
        "text": "The pacing of this movie was perfect. It kept me engaged from beginning to end.",
        "title": "Perfect pacing",
        "date": "2022-12-10"
      },
      {
        "author": { "name": "movie_buff_234", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 0, "up": 9 },
        "text": "The cinematography in this movie was breathtaking. Every shot was like a work of art.",
        "title": "A work of art",
        "date": "2022-11-25"
      }
    ]
  },
  {
    "id": "tt0071562",
    "reviews": [
      {
        "author": { "name": "galileo3", "id": "/user/ur8564485/" },
        "interestingVotes": { "down": 68, "up": 198 },
        "text": "The Godfather Part II (1974)\n\nNumber 1 - 1974\n\nTop 3 - 1970s\n\n\"My father taught me many things. Keep your friends close but keep your enemies closer\"\n\n\"The Godfather Part II is truly a masterpiece. Timeless, Classic, Beautiful and endlessly watchable\"\n\nThe second part of Francis Ford Coppola's Epic and violent Gangster Trilogy, follows the reign of Don Michael Corleone as the head of the Corleone family. As well the film shows us the early years of Vito Corleone (Marlon Brando) played flawlessly by Academy Award Winner Robert De Niro, and how he created his empire of money, gambling and respect. Beautifully directed by Francis Ford Coppola, Godfather Part II exceeds every expectation with outstanding performances from Academy Award winners Al Pacino,Diane Keaton, Robert Duvall and Robert De Niro. The second part of this unforgettable trilogy is one of the finest films ever made. \n\nThis is cinematic art. A treasure of film history. The finest sequel ever made. A faultless, flawless gripping drama; Coppola's second part of his crime saga is in my opinion one of the top 5 films of all time and perhaps towering over the first part. \n\n\"As close to perfection as movies get\"\n\n\"Pacino at his best\"\n\n-10/10-",
        "title": "\"The Godfather Part II is the greatest sequel ever made, one of the greatest films of all time and possibly finer than its superb predecessor *****\"",
        "date": "2005-12-31"
      },
      {
        "author": { "name": "cinema_enthusiast_901", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 3, "up": 10 },
        "text": "I found this movie to be very slow-paced. It could have used some tighter editing.",
        "title": "Too slow",
        "date": "2022-10-18"
      },
      {
        "author": { "name": "movie_fanatic_678", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 14 },
        "text": "This movie was an emotional rollercoaster. I was on the edge of my seat the entire time.",
        "title": "An emotional rollercoaster",
        "date": "2022-09-28"
      }
    ]
  },
  {
    "id": "tt0050083",
    "reviews": [
      {
        "author": { "name": "uds3", "id": "/user/ur1318549/" },
        "interestingVotes": { "down": 37, "up": 321 },
        "text": "This once-in-a-generation masterpiece simply has no equal. The late 90's TV remake was quite adequate though totally unnecessary and in the upshot proved simply that updating a film for updating's sake is really an exercise in futility. Even had it BEEN as good - so what?\n\nThere could be few, if ANY film-goers reading this who are unaware of the plotline and in any event many others have re-hashed this for you. The brilliance of the film is evident in so many aspects. To begin with, the ability to not only sustain interest but to command the viewer's attention for basically its entire running time within a setting of principally just one room, borders on the inspired. Whether or not that would actually work with TODAY'S audiences is another discussion! What we have here are twelve everyday Mr Joe Blows, summoned together on a jury panel to decide a defendant's guilt or innocence with regards to a murder charge. If you were to gather unto yourselves ANY twelve jurors at random, you would most likely be able to pinpoint the Henry Fonda, Lee Cobb, E. G. Marshall, Jack Warden etc etc amongst them! Their very \"ordinariness\" is where the film succeeded. Everyone can identify with at least ONE of those characters. Whether or not he may WANT to is a different matter. The thinker, the sensitive man, the arrogant bully, the opportunist, the mentally challenged loudmouth, the slimeball, the emotionally withdrawn, the sheep etc - they're all here! Welcome to society folks! I dislike society in the main - doubtless a reason I found this film to be such a revelation..even when I was barely into my teens!\n\n12 ANGRY MEN also pinpoints the shortcomings of the law, how \"truth\" can be so intrinsically left-field and unintentionally flawed. Lumet, working within a minimal budget here, delivers unstinting brilliance in both direction, character portrayal and script interpretation. He had of course superb acting talent at his disposal although some of the most memorable performances are from the lesser players. Some have denounced Fonda's role as being acceptable rather than awesome. I think however he was to a great degree playing himself here, not to an audience. His, is a study in deliberation and logic not show-pony stuff, but hell that never WAS Fonda was it?\n\nThis is a great great movie, as is evidenced by the extremely high user-vote worldwide. IF you haven't seen it - you really should do something about that!",
        "title": "The over-used term \"classic movie\" really comes into its own here!",
        "date": "2002-08-12"
      },
      {
        "author": { "name": "film_junkie_345", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "I was disappointed by the plot twists in this movie. They were predictable and cliché.",
        "title": "Predictable plot twists",
        "date": "2022-08-18"
      },
      {
        "author": { "name": "cinema_buff_789", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 1, "up": 6 },
        "text": "The score for this movie was forgettable. I can't remember any of the music.",
        "title": "Forgettable score",
        "date": "2022-07-14"
      }
    ]
  },
  {
    "id": "tt0108052",
    "reviews": [
      {
        "author": { "name": "tornikesvanidze", "id": "/user/ur53331193/" },
        "interestingVotes": { "down": 13, "up": 56 },
        "text": "Fantastic screening of the bloody history. Watching Schindler's List gives rise to know what means the 'TOP CLASS FILM', it's impossible to make better film in this subject matter. Steven Spielberg is a genius. Liam Neelson and Ralph Fiennes are showing us how talented and great actors are they. Well done to the cast and crew of this film.",
        "title": "The masterpiece",
        "date": "2017-08-17"
      },
      {
        "author": { "name": "movie_lover_456", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 0, "up": 8 },
        "text": "I loved the use of color in this movie. It really enhanced the visual storytelling.",
        "title": "A colorful film",
        "date": "2022-06-22"
      },
      {
        "author": { "name": "cinema_junkie_123", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 2, "up": 11 },
        "text": "The supporting cast in this movie was incredible. Every actor delivered a standout performance.",
        "title": "A standout supporting cast",
        "date": "2022-05-19"
      }
    ]
  },
  {
    "id": "tt0167260",
    "reviews": [
      {
        "author": { "name": "venividiamavi-v", "id": "/user/ur91236462/" },
        "interestingVotes": { "down": 6, "up": 192 },
        "text": "This movie, and trilogy in general, is a cinematic (and literary) masterpiece, and simply refuses to get old. I love this movie so much it's become a tradition to watch the Lord of the Rings series at least once a year! It's just as good as Christmas",
        "title": "A Timeless Classic",
        "date": "2019-08-07"
      },
      {
        "author": { "name": "film_enthusiast_890", "id": "/user/ur901234567/" },
        "interestingVotes": { "down": 1, "up": 7 },
        "text": "I found the use of flashbacks in this movie to be confusing. It was hard to keep track of the timeline.",
        "title": "Confusing flashbacks",
        "date": "2022-04-12"
      },
      {
        "author": { "name": "movie_fan_567", "id": "/user/ur789012345/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a rollercoaster of emotions. I laughed, I cried, I felt every emotion the characters did.",
        "title": "Emotionally resonant",
        "date": "2022-03-24"
      }
    ]
  },
  {
    "id": "tt0110912",
    "reviews": [
      {
        "author": { "name": "hockeydog-75085", "id": "/user/ur126223463/" },
        "interestingVotes": { "down": 25, "up": 111 },
        "text": "Before I saw this I assumed it was probably overrated. I was wrong. It lives up to and surpasses its reputation in pretty much every way. I would definitely recommend.",
        "title": "Not overrated at all",
        "date": "2021-01-13"
      },
      {
        "author": { "name": "cinema_critic_234", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 3, "up": 6 },
        "text": "The dialogue in this movie was stilted and unnatural. I couldn't get invested in the characters' conversations.",
        "title": "Unnatural dialogue",
        "date": "2022-02-19"
      },
      {
        "author": { "name": "movie_enthusiast_901", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "I didn't care for the lead actress's performance in this movie. She seemed wooden and unemotional.",
        "title": "Poor lead performance",
        "date": "2022-01-13"
      }
    ]
  },
  {
    "id": "tt0120737",
    "reviews": [
      {
        "author": { "name": "ccthemovieman-1", "id": "/user/ur4445210/" },
        "interestingVotes": { "down": 24, "up": 204 },
        "text": "Here is one film that lived up to its hype, and by the time I saw it after it had arrived at the video stores, I had heard and read a ton of things about it, and seen all the awards it had received, and expected a lot. To my surprise, it did not disappoint.\n\nNow, several years later after having watched all three of these \"Rings\" films twice each, I still think this first movie of the trilogy is the best. It is a truly spectacular adventure story all the way through, probably the best ever put to film...and the first three hours of it is extra special. The following two films were very good, to be sure, but this first had a better mixture of the story. The second and third movies were almost entirely Frodo and his allies' long journey, but the first half of this movie also gives a good bit of interesting introductory material including a number of scenes at the Shire, before the long adventure starts. If you watch all three of these films consecutively the action wears you down by midway through the final episode and it almost becomes just too much That never gets a chance to happen with the \"Fellowship\" film.\n\nAnyway, \"Fellowship,\" stunned me for the visuals alone. I can't recall any film that has so many jaw-dropping scenes, one after the other, for three straight hours. Some are beyond description, and I don't care if they are computer- generated. So what? The fact is they are awesome to view, both in beauty and in staggering action scenes that feature incredible-looking monsters and other mythical characters.\n\nThe story covers all kinds of terrain, too, from the lush Shire of the Hobbits, to the harsh neighboring landscapes. Each couple of minutes, as in the two movies that followed, scenes radically change from calmness to action, adventure to romance, sweet lovable characters to hideous monsters, on and on and on. It's an incredible movie experience.",
        "title": "First, And Still The Best Of LOTR",
        "date": "2006-03-07"
      },
      {
        "author": { "name": "film_junkie_678", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 1, "up": 13 },
        "text": "The direction in this movie was top-notch. The filmmaker really knew how to build tension and create a sense of unease.",
        "title": "Expert direction",
        "date": "2021-12-08"
      },
      {
        "author": { "name": "cinema_buff_345", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 1, "up": 5 },
        "text": "I found this movie to be very slow-paced. It could have been condensed into a shorter running time.",
        "title": "Too long",
        "date": "2021-11-19"
      }
    ]
  },
  {
    "id": "tt0060196",
    "reviews": [
      {
        "author": { "name": "murtaza_mma", "id": "/user/ur19117722/" },
        "interestingVotes": { "down": 22, "up": 194 },
        "text": "The Good, the Bad and the Ugly or the Good, the Better and the Best, as I prefer calling it, is a bizarrely sublime and a uniquely aesthetic masterpiece. The actors in title roles have given such extraordinarily superb performances, that it would be impertinent and disparaging to merely regard their swell work as acting. In fact their brilliant portrayals have immortalized Blondie, Sentenza/ Angel Eyes and the enigmatic Tuco. Lee Van Cleef is fiendishly unforgiving as the merciless Angel Eyes. Clint Eastwood is rugged yet suave, cocky yet adorable as laconic cigar-smoker Blondie, a role that laid the foundations of his illustrious career. But it is Eli Wallach, who steals the show with his captivating portrayal of Tuco, a portrayal that is as entrancing as it is enlightening. Wallach is amusing, capricious, nonchalant, uncanny and yet tenacious as Tuco, perturbed by his insecurities and dampened by his solitude. It is the tacit amicability between Blondie and Tuco and their mutual hostility towards the evil Angel Eyes owing to the vestiges of virtue present in them, redolent of their moribund morality, which gives the story, the impetus and the characters, a screen presence that is not only awe inspiring but also unparalleled.\n\nSergio Leone's magnificent and ingenious direction in synergy with Ennio Morricone's surreal music, Tonino Delli Colli's breathtaking cinematography and Joe D'Augustine's punctilious editing makes the movie, a treat to watch and ineffably unforgettable. Initially aimed to be a tongue-in-cheek satire on run-of-the-mill westerns, The Good, the Bad and the Ugly, continues to stand the test of time in its endeavor to attain apotheosis (if it hasn't attained it yet). It will always be remembered as European cinema's greatest lagniappe, not only to the Western genre, but to the world of cinema.\n\nIt's a must watch for any movie lover. 10/10",
        "title": "The Good, the Better,  the Best",
        "date": "2009-02-19"
      },
      {
        "author": { "name": "movie_fanatic_789", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie was a true tearjerker. I cried my eyes out at the end.",
        "title": "A real tearjerker",
        "date": "2021-10-12"
      },
      {
        "author": { "name": "cinema_critic_456", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "The pacing of this movie was all over the place. It was hard to get invested in the story when the momentum kept shifting.",
        "title": "Inconsistent pacing",
        "date": "2021-09-22"
      }
    ]
  },
  {
    "id": "tt0109830",
    "reviews": [
      {
        "author": { "name": "Zonieboy", "id": "/user/ur0989940/" },
        "interestingVotes": { "down": 121, "up": 752 },
        "text": "I believe everyone has a right to their opinion about films or other topics. However from a lot of the comments I have read about this film, I do not think many got the gist of the message from the author and the film maker. This film is a great modern fable, a fable in the dictionary is defined as a brief fictitious story that teaches a moral. There are many morals defined in this film but foremost is integrity and a simple goodness.\n\nI have a half brother who grew up in the Southern U.S. and on one occasion we were discussing this film and he said he felt it portrayed Southerners as dimwitted. I disagreed with him and informed him that the author himself was a native Southerner. The setting is central to this story in that it lets the tale unfold tying in factual events with the fable before us.\n\nThe film is wonderfully directed by Robert Zemeckis, the film is his opus and is acted by a great cast on all levels. From the children who were Forrest Gump and Gump Jr. by Haley Joel Osment. Say what you want but I feel Tom Hanks deserved the Oscar award. Gary Sinise is synonymous with Lt.Dan whenever you hear those words. Sally Fields is the loving dutiful mother in her challenging situation. Mykelti Williamson as Bubba gives you a real sense in the story that Gump had a genuine friend, he moves you with his character. Words don't grasp the full performance of Robin Wright Penn as Jenny. Jennys' tenderness and pain are palpable as exhibited by Wright.\n\nI feel that much of Gumps' appeal is his downright sense of doing the right thing regardless of the people and situations around him and we see that in this film. That being the case maybe we all wish we could be just a little more like that, trying to maintain innate goodness and not the trade-offs we often make as we go down lifes highways.\n\nThe movie has it all too,drama,comedy and it challenges societal norms as well. Then there are the almost endless quotes from the movie that have slipped into everyday speech. They are too numerous to say at this point.One of the toppers for me in the movie is when Forrest is in a quandary about life and wondering as Lt.Dan said we all have a destiny and his Mom says it is where we are all just floating around like a feather in the wind. Forrest's character terms it very well with this quote,\"I think it is a little bit of both.\" From my experiences in life it does appear to be that way. So if you have not seen the movie,see it soon you are in for a real treat. If you did not like it, give it a try again and hopefully you will see it for the great story it is!",
        "title": "A beautiful fable for now and the future",
        "date": "2002-04-08"
      },
      {
        "author": { "name": "film_enthusiast_123", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 0, "up": 9 },
        "text": "The chemistry between the two leads in this movie was electrifying. It was a joy to watch them interact.",
        "title": "Sizzling chemistry",
        "date": "2021-08-14"
      },
      {
        "author": { "name": "movie_lover_890", "id": "/user/ur901234567/" },
        "interestingVotes": { "down": 1, "up": 6 },
        "text": "I was disappointed by the climax of this movie. It was underwhelming compared to the build-up.",
        "title": "Underwhelming climax",
        "date": "2021-07-03"
      }
    ]
  },
  {
    "id": "tt0137523",
    "reviews": [
      {
        "author": { "name": "TheLittleSongbird", "id": "/user/ur20552756/" },
        "interestingVotes": { "down": 29, "up": 93 },
        "text": "Perhaps a little too long, but Fight Club is just a very well-made, brilliantly written and superlatively performed film. Essentially a satirical fable, it tells of an insomniac loser teaming up with a seditious soap salesman to form a no-holds-barred-fight club as an outlet for their direction-less aggression. This concept is an intriguing and original one, and works really well. Then there is the script, it is absolutely superb, with dialogue that will make you both laugh and think. Fight Club is very well made, with elaborate production design, great editing and startling images. David Fincher's direction is brilliantly handled and the performances of Edward Norton and Brad Pitt are superb. Overall, just a great film, a mesmerising ride through the 1990s male psyche. 9/10 Bethany Cox",
        "title": "You love it or  you hate it, personally I loved it",
        "date": "2010-05-18"
      },
      {
        "author": { "name": "cinema_aficionado_567", "id": "/user/ur789012345/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "The production design for this movie was stunning. Every detail was meticulously crafted.",
        "title": "A visual feast",
        "date": "2021-06-15"
      },
      {
        "author": { "name": "film_critic_234", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 3, "up": 8 },
        "text": "I was bored throughout this entire movie. It dragged on and on and I didn't care about any of the characters.",
        "title": "A snoozefest",
        "date": "2021-05-21"
      }
    ]
  },
  {
    "id": "tt1375666",
    "reviews": [
      {
        "author": { "name": "mollyshelhamer", "id": "/user/ur143920401/" },
        "interestingVotes": { "down": 2, "up": 12 },
        "text": "Christopher Nolan's \"Inception\" (2010) is a complex science fiction thriller about a group of people with varying specific skills that create a perfect team of dream-sharers. Dom Cobb, the main protagonist, is an extractor who is able to find out people's secrets by intruding into their dreams. His right-hand is Arthur, who researches and plans what they are trying to accomplish in a dream. Bright graduate student Ariadne is the architect for the dreams, meaning she literally constructs the physical aspects of a dreamscape. Eames is a professional at turning into anyone else in a dream, almost like shapeshifting. Lastly, Yusuf is a chemist who creates perfect concoctions of sedatives to achieve ideal conditions for the dreams to take place. This elaborate combination of characters is asked by a rich businessman, Saito, to infiltrate his dying competitor's son, Robert Fischer's, dream and place an idea in his mind so that Saito's business can become more successful. Traveling through the layers of someone's mind and making them think of an idea on their own is what they call \"inception.\" Cobb is dedicated to making this happen so that Saito can arrange for Cobb's return to America to see his children. Without Saito, Cobb would not be able to return to America because of his alleged criminal background, but Saito has connections and power to clear his name. Some members of his team think achieving inception is impossible, but Cobb convinces them to be on board and they must come up with a mastermind plan with no room for error to achieve this extremely difficult yet imperative task. They begin a three-layer plan that involves elaborate depths of the dream dimension, taking advantage of Fischer's sensitive and dysfunctional relationship with his father, practiced methods of leaving a dream and entering the next, all while trying to avoid Cobb's wife Mal who lives in his subconscious and often sabotages his plans. The shocking ending leaves viewers at a cliffhanger and fans theorizing.\n\nNow that I've gone over the plot, let's talk about the other components of the film. The marketing strategies did an excellent job gathering hype for the film. The movie poster features the famous actors that everyone was excited to see, Leonardo DiCaprio, Tom Hardy, Elliot Page, and the rest of the dream crew. It also says \"Inception\" in a large red font and notes that is directed by the same director of \"Dark Knight,\" which was an insanely successful and highly rated movie that was premiered two years prior to Inception. Dark Knight scored a 94% on rotten tomatoes and is #112 on IMBD's most popular movie list. This likely drew in the audience from Christopher Nolan's movies and set a high expectation for the quality of Inception. Another great marketing move was the contents of the teaser trailer. The trailer features a brief voiceover of Leonardo DiCaprio and amazing scenes with impressive cinematography taken out of context that show the viewers the production value and exciting action contents of the film all while confusing them so that they go see the film when it is released. I think the shock factor and science fiction aspect of the trailer is owed to the scene where a city block starts to fold over top of itself.\n\nThe content of the film stayed true to the marketing because the cinematography, directing, and acting is quite well-done. Starting with the cinematography, the zero gravity scenes and cityscape building from the ground up were very realistic looking and intensified the movie watching experience. There was a lot of attention to detail. The directing of Inception is very montage based. It draws amounts and amounts of suspense. For example, the montage near the end of the film with the van, the fortress, and the hotel was painfully long but created such thick suspense. For the acting, I only have compliments and no complaints. Inception was casted beautifully and everyone fit their roles perfectly. Leonardo DiCaprio did an excellent job as Dom Cobb, especially in the emotional scene with his wife and two kids in one of the dreams. My personal favorite performance was Cillian Murphy's role as Robert Fischer. He played as his character really well and he captured his relatively constant sadness surrounding his father situation.\n\nInception is a staple film in the science fiction genre and is similar to a few other sci-fi movies as well. Inception is at #135 on IMBD's most popular movie list and has a rating of 87% on rotten tomatoes, so there is no doubt about its quality. In my opinion, Inception is pretty similar to the well-loved movie \"The Matrix\" (1999) starring Keanu Reeves. They are both iconic science fiction and action films with themes of alternate realities. The second film I think is very similar is a more recent film, Tenet (2020) with Robert Pattinson. Tenet is also about bending the rules of science and is also directed by Christopher Nolan. If you enjoyed either of these movies, I recommend Inception. I also recommend it to general fans of Christopher Nolan's directing, so if you have watched and enjoyed any of his films, you would probably like Inception too.\n\nOn my rating scale of one to five, with one being the worst possible score and five being perfect, I give Inception a five. It has no weaknesses in my opinion. Every aspect of this movie combines into perfection. The acting and cinematography is what takes it over the top, and I am a fan of Leonardo DiCaprio and Cillian Murphy in all of the roles they play. This is a movie I have voluntarily watched multiple times and it only gets better with each watch. It is very complex and a complete experience to view. My favorite aspect of the film is the ending. Many people say they hate cliffhangers, but I enjoy them because it leaves it up to the audience to imagine. Basically, you can choose your own ending based on what you think makes the most sense with the facts you are given in the film.",
        "title": "Perfect for Sci-Fi Fans",
        "date": "2021-11-18"
      },
      {
        "author": { "name": "movie_enthusiast_901", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 2, "up": 12 },
        "text": "This was a truly unique movie. I've never seen anything like it before.",
        "title": "A one-of-a-kind film",
        "date": "2021-04-02"
      },
      {
        "author": { "name": "cinema_junkie_678", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 1, "up": 5 },
        "text": "I found this movie to be very confusing. The plot was hard to follow and the characters were unrelatable.",
        "title": "Confusing",
        "date": "2021-03-18"
      }
    ]
  },
  {
    "id": "tt0167261",
    "reviews": [
      {
        "author": { "name": "MaxBorg89", "id": "/user/ur5156288/" },
        "interestingVotes": { "up": 9 },
        "text": "Peter Jackson himself has admitted The Two Towers was the hardest part of the trilogy to achieve, at least in terms of narrative structure since, unlike The Fellowship of the Ring, it has no proper beginning and no emotionally packed climax (Boromir's death in Fellowship was one of that film's most moving moments). It picks up exactly from where its predecessor ended: the Fellowship is split in three separate groups, all with their own problems to take care of:\n\nFrodo (Elijah Wood) and Sam (Sean Astin) continue their journey to Mordor in order to destroy the One Ring, and find an unexpected guide in that item's previous owner, vicious creature Gollum (Andy Serkis); Aragorn (Viggo Mortensen), Legolas (Orlando Bloom) and Gimli (John Rhys-Davies) reunite with the reborn Gandalf (Ian Mckellen) to save the dying kingdom of Rohan from Saruman's (Christopher Lee) evil clutch; Merry (Dominic Monaghan) and Pippin (Billy Boyd) have a close encounter with the Ents, ancient creatures which have unfinished business with a certain bad wizard...\n\nThis second opus is less talking and more fighting: key characters are reduced to cameos (most notably Galadriel) and new people are quickly introduced so that we can be dragged into some huge battles, culminating in the 40-minute long combat at Helm's Deep, quite simply the movie's highlight. If, however, you want more insight on the characters and their motivations, get the extended cut, whose additional sequences are essential to understand pivotal moments of the third film.\n\nHelm's Deep aside, the movie's most remarkable element is the mad, schizophrenic Gollum. He's got \"ambiguity\" and \"unreliability\" written all over him, as we see him struggle with his two personas, one the good fella he once was, the other a filthy, treacherous freak who wants nothing more than his \"preccciousssss\" back (the conversation between the two personalities is one of the most beautiful scenes ever made). He makes us suspicious about his most insignificant gesture, and has us thinking the worst may happen in The Return of the King.\n\nNot as good as the previous part (at least the theatrical version, which I rate 9/10), but still a really good fantasy movie, and one of the best pictures of 2002.",
        "title": "The battle for Middle Earth is about to begin...",
        "date": "2005-12-12"
      },
      {
        "author": { "name": "movie_buff_345", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 0, "up": 8 },
        "text": "This movie was hilarious. I laughed out loud several times.",
        "title": "A comedy gem",
        "date": "2021-02-07"
      },
      {
        "author": { "name": "cinema_enthusiast_789", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 4, "up": 11 },
        "text": "I was disappointed by this movie. The plot was convoluted and the characters were poorly developed.",
        "title": "Not worth the hype",
        "date": "2021-01-10"
      }
    ]
  },
  {
    "id": "tt0080684",
    "reviews": [
      {
        "author": { "name": "TxMike", "id": "/user/ur0438066/" },
        "interestingVotes": { "down": 40, "up": 149 },
        "text": "My five children were all pre-teens when 'The Empire Strikes Back' came to the theater. While there had been other Sci-Fi movies with a theme of conflict in outer space, the 'Star Wars' trilogy filled our imaginations like no other movies before them. The fantastic, strange worlds were presented almost like we were there too. Aliens sitting around a tavern, enjoying drinks and speaking in all sorts of languages. Nothing before had approached the sheer size of the space ships depicted here, huge cities traveling all over the galaxy. And how about the jump to hyper speed, then disappearing from the screen as the speed exceeds light speed! And the light sabres of the Jedi Knights. The Jedi Knights, a striking parallel to the Japanese Samurai.\n\nIt is fruitless trying to argue 'which is best' in a trilogy, because the first one, in this case 'Star Wars', starts it all and has to be the 'father'. However, an argument can be made that 'The Empire Strikes Back' (now on DVD called Episode V) is overall a better-made movie which has more excitement, and grabs your imagination,than the other two original installments (now called parts IV and VI). The DVDs finally came out last month, and they are near perfect, as we should expect from Lucas Films and THX. The bit rate is high, and the picture is nothing short of superb. As is the Dolby EX surround track. \n\nMy wife and I watched all three of the movies on DVD this week -- Star Wars, Empire Strikes Back, and Return of the Jedi -- compliments of our local public library. It was an appropriate reminder how good these movies are, and still ahead of their time. Nothing else has been made to compare to them.",
        "title": "A worthy second (or 5th??) Star Wars installment, might be the best of the bunch.",
        "date": "2004-10-07"
      },
      {
        "author": { "name": "film_fanatic_456", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "The soundtrack for this movie was amazing. It really added to the emotional impact of the story.",
        "title": "A fantastic soundtrack",
        "date": "2020-12-05"
      },
      {
        "author": { "name": "cinema_buff_123", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 0, "up": 6 },
        "text": "I didn't expect to enjoy this movie as much as I did. It was a pleasant surprise.",
        "title": "A pleasant surprise",
        "date": "2020-11-19"
      }
    ]
  },
  {
    "id": "tt0133093",
    "reviews": [
      {
        "author": { "name": "xNecRosex", "id": "/user/ur29021729/" },
        "interestingVotes": { "down": 10, "up": 107 },
        "text": "This film doesn't age, it will be contemporary even in 2030 or 2040. Wachowski's best one, by far.",
        "title": "The timeless classic.",
        "date": "2021-01-04"
      },
      {
        "author": { "name": "movie_aficionado_890", "id": "/user/ur901234567/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "The lead actor gave an amazing performance in this movie. He really brought the character to life.",
        "title": "An actor's tour de force",
        "date": "2020-10-20"
      },
      {
        "author": { "name": "cinema_lover_567", "id": "/user/ur890123456/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "I was completely hooked from the opening scene. The tension never let up and the ending was satisfying.",
        "title": "A tension-filled thriller",
        "date": "2020-09-28"
      }
    ]
  },
  {
    "id": "tt0099685",
    "reviews": [
      {
        "author": { "name": "gogoschka-1", "id": "/user/ur15794099/" },
        "interestingVotes": { "down": 49, "up": 400 },
        "text": "Needs to be seen to be believed; in one word: perfection. Every frame, every voice-over, every song - it all comes together at the exact right moment to create the perfect film experience. This film makes you really understand and feel what makes the American mafia so compelling; in the eyes of a kid, who was unfortunate enough to grow up in a tough neighborhood, those gangsters are rock stars. Live fast, die young - but when you die, it ain't gonna be of a glamorous suicide or drug overdose - the ending will be brutal, ugly and sad. And it may very well be one of your best friends that will blow your brains out.\n\nI'll never get tired of watching Goodfellas; the entertainment value of this film is just amazing. It doesn't happen very often that every person involved in the process of making a film is at the peak of his/her game. And rarely do art and entertainment come together the way they did here. Storytelling with impeccable pacing, this is what it's like when a master composer conducts his masterpiece. All hail the king; the most versatile and talented filmmaker of his generation: Martin Scorsese.\n\nMy vote: 10 out of 10\n\nFavorite films: IMDb.com/list/mkjOKvqlSBs/\n\nLesser-Known Masterpieces: imdb.com/list/ls070242495/\n\nFavorite Low-Budget and B-Movies: imdb.com/list/ls054808375/\n\nFavorite TV-Shows reviewed: imdb.com/list/ls075552387/",
        "title": "In one word: perfection",
        "date": "2013-12-17"
      },
      {
        "author": { "name": "film_enthusiast_234", "id": "/user/ur789012345/" },
        "interestingVotes": { "down": 1, "up": 7 },
        "text": "The special effects in this movie were incredible. It was a visual feast from start to finish.",
        "title": "Visually stunning",
        "date": "2020-08-09"
      },
      {
        "author": { "name": "movie_junkie_901", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "This is one of the best movies I've seen in years. The cinematography was breathtaking and the story was gripping.",
        "title": "A must-see film",
        "date": "2020-07-01"
      }
    ]
  },
  {
    "id": "tt0073486",
    "reviews": [
      {
        "author": { "name": "b1lskirnir", "id": "/user/ur4670510/" },
        "interestingVotes": { "down": 41, "up": 231 },
        "text": "Based on the amazing novel by Ken Kesey, Randall Patrick McMurphy is an antisocial and dangerous man no different than a petty criminal, placed in a mental ward to have his behavior studied. He makes friends with lunatics and starts his own circle of admiration within the hospital, much to the dismay of Nurse Ratched, the central authority figure in the story and one of the greatest movie villains ever.\n\nThe movie exists to show not only how corrupt and poorly-constructed society's approach to the \"mentally unstable\" is, but it creates characters that we have all met in life and shows how the McMurphy-like figure that we all wish we had fights for freedom of choice and basic human rights. In addition to the movie's great spirit, the acting is fantastic. Jack Nicholson is at his best and Danny DeVito can be seen in his very first acting role ( which he absolutely triumphs in ). And of course, there's the unforgettable Chief Bromden. The directing by Milos Forman is very well-done, as the camera-work is excellent and follows the pace of the movie perfectly in how it is used. What really impressed me was the editing, especially as far as the use of audio goes: some parts just made me go \"...wow.\"\n\nMy only complaint is that I believe the movie could've been slightly more effective if it were based more closely on the novel at certain points, but the modified point of view of the film does make a great point; anyone who has ever hated their job, been accused of something, had some person so self-righteous and convinced of their own authority and dependency on order get in your way, or attended the American public school system at any point in their life should be able to identify with this movie.",
        "title": "A great order vs. chaos tale that everyone can relate to",
        "date": "2005-06-18"
      },
      {
        "author": { "name": "cinema_enthusiast_678", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 3, "up": 5 },
        "text": "I was really looking forward to this movie, but it didn't live up to the hype. The acting was mediocre and the plot was thin.",
        "title": "Overrated",
        "date": "2020-06-11"
      },
      {
        "author": { "name": "film_lover_345", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 6 },
        "text": "I laughed, I cried, I loved every minute of this movie. It was heartwarming and funny at the same time.",
        "title": "A feel-good movie",
        "date": "2020-05-18"
      }
    ]
  },
  {
    "id": "tt0114369",
    "reviews": [
      {
        "author": { "name": "Insipid_Shell", "id": "/user/ur1669095/" },
        "interestingVotes": { "down": 97, "up": 742 },
        "text": "The movie, \"Se7en\", starring Brad Pitt, Morgan Freeman, and Gwyneth Paltrow, is by far one of the most inventive, well-written, and cerebral films in recent history. The film, blending a well put together combination of dark visual style, intense plot development, and polished acting, remains tight and focused throughout, from beginning to end, never straying outwards into unimportant issues, or resorting to typical Hollywood clichés. Se7en is uniquely on its own for suspense dramas as it both fuels the need of the audience to be drawn in and entertained by the events unfolding, and remain uncompromising and shocking, thus satisfying the initial vision of the director, David Fincher.\n\nThe story surrounds the hunt for a serial killer, who, inspired by Dante Alighieri's seven deadly sins from \"The Divine Comedy\", sets out to, \"preach\" about man's impurity, and does so by targeting victims, then torturing them by pitting their own underlining sins against them. Se7en seemingly starts out as a typical cat and mouse detective story, however, it quickly develops into of a sort of modern-myth, with good and evil taking centre stage. The story is original on all counts, and thrilling on all levels. The most important aspect of Se7en, however, is that it keeps the audience numerous steps behind its story, as oppose to other thrillers, which become predictable and bland by the end. By keeping the audience in the dark, the film remains fresh and original as it progresses. Se7en even dramatically turns the tide at one point, just as the audience is finally getting comfortable and asserted into the gloomy atmosphere, thus creating as much as fear and uncertainty in the audience as it is with the characters involved. By the film's conclusion, the audience is as much apart of the film as the characters themselves, and arrive at Se7en's surprise ending without a single clue of it, prior to it occurring. Se7en's poetic ending(which will not be given away) says a lot for the people behind the movie, showing they are not afraid of going against the grain. A rarity with films so nowadays.\n\nDirected brilliantly by David Fincher, and skillfully written by Andrew Kevin Walker, Se7en is well crafted and ingeniously clever, making it one of the greatest films of the 90's. While Se7en may not have garnered critical acclaim as such films as Silence of the Lambs, Se7en is, undoubtedly, as influential as any film to date.\n\nScore 10/10",
        "title": "\"Se7en is well crafted and ingeniously clever, making it one of the greatest films of the 90's\"",
        "date": "2002-03-25"
      },
      {
        "author": { "name": "cinema_critic_789", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 4, "up": 13 },
        "text": "I found this movie to be very boring. The pacing was slow and the characters were unlikable.",
        "title": "Disappointing",
        "date": "2020-04-02"
      },
      {
        "author": { "name": "movie_buff_456", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 1, "up": 8 },
        "text": "I wasn't sure what to expect from this movie, but it blew me away. The plot was unpredictable and the characters were well-developed.",
        "title": "Surprisingly great",
        "date": "2020-03-22"
      }
    ]
  },
  {
    "id": "tt0047478",
    "reviews": [
      {
        "author": { "name": "Platypuschow", "id": "/user/ur57590728/" },
        "interestingVotes": { "down": 11, "up": 37 },
        "text": "I've been on a Toho binge for a while now and for the most part the films have been enjoyable, especially those by Kurosawa. \n\nThe earlier films were dark, bleak and unsettling viewing and therefore going into Seven Samurai I was of two minds. First I expected more of the same, in both quality and tone but then on the flipside at time of writing this is ranked as the 19th highest rated movie on IMDB which is incredible.\n\nMy expectations were that it would be good, but that's about it. Seeing Takashi Shimura in the credits also confirmed my logic that this was going to at least be an entertaining three and a half hours.\n\nI was mistaken, Seven Samurai is not good............it's outstanding.\n\nWonderfully crafted, perfectly scored, incredibly choreographed, well acted and beautifully written this is well deserving of it's high place and I would consider it nothing short of a masterpiece.\n\nIf you check out my IMDB rating distribution it's very clear to see that getting anything higher than an eight is a rarity, this deserves it on so many levels.\n\nI didn't expect this level of quality further as generally I don't tend to agree with titles in the IMDB top 250, this however I do I thoroughly unconditionally agree.\n\nA masterpiece and essential viewing, I don't even need to give the premise of the movie in this review and must simply stress that this is film making mastery at its finest.\n\nThe Good:\n\nTakashi Shimura\n\nVery well shot for its time\n\nPerfectly crafted\n\nThe Bad:\n\nNothing springs to mind\n\nThings I Learnt From This Movie:\n\nAkira Kurosawas should be a household name, not Bruckheimer or Bay!\n\nI'll put money down now that none of the remakes or movies heavily influenced by Seven Samurai comes close in quality",
        "title": "Shichinin no samurai: Simply outstanding",
        "date": "2018-08-17"
      },
      {
        "author": { "name": "film_fan_123", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 2, "up": 9 },
        "text": "This movie was a masterpiece. The acting was superb and the story was captivating from beginning to end.",
        "title": "A cinematic masterpiece",
        "date": "2020-02-15"
      },
      {
        "author": { "name": "scifigeek123", "id": "/user/ur901234567890/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "A thrilling sci-fi film with an intriguing premise. The ending left me wanting more.",
        "title": "Edge of your seat",
        "date": "2020-03-12"
      }
    ]
  },
  {
    "id": "tt0038650",
    "reviews": [
      {
        "author": { "name": "dweck", "id": "/user/ur0174106/" },
        "interestingVotes": { "down": 34, "up": 430 },
        "text": "I am a film lover from 'way back, having even served a stint as a newspaper movie critic. Entries in my personal list of Greatest Films of All Time include \"Fantasia,\" \"To Kill A Mockingbird,\" \"Casablanca,\" \"Singin' in the Rain,\" \"North by Northwest,\" and \"The Sound of Music. But sitting atop all of them, as undisputed champ, is \"It's a Wonderful Life.\"\n\nI have seen it hundreds of times (dating back to, oh, when I was a teenager I suppose, and our local PBS station ran it as part of a pledge drive). I drive my wife and family to distraction when we watch it together because I quote all the dialogue along with the actors.\n\nI cry every time--and this is after viewing upon viewing--when Harry Bailey toasts his big brother George as \"...the richest man in town.\" The emotions in that scene are so true and pure that I can't help but be affected by them.\n\nThe performances are unparalleled. Stewart is brilliant as a small-town dreamer who loses and finds his way. His superlative acting abilities cause us to identify strongly with him (how many of us have lamented--even to ourselves--that no one seems to notice the sacrifices we've made?), which is, I think, why the movie bears up under so many repeat viewings. Reed is just lovely here, the epitome of sunny girlfriend, caring lover, devoted wife, dedicated mother.\n\nCapra's talent as a screenwriter are all over this script. He knows just how hard to tug the heartstrings without becoming overblown or phony. And his technical wizardry is evident too. I've never seen--before or since--more natural-looking onscreen snow.\n\nWatching IAWL has become a tonic, a pick-me-up when I really need one--whether it's the Christmas season or not. Its message--that each one of us is important and has *something* to contribute to the greater good--is one about which the world could use some reminding from time to time.",
        "title": "Atop my Top Ten",
        "date": "1998-12-09"
      },
      {
        "author": { "name": "romcomlover", "id": "/user/ur890123456789/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "A formulaic rom-com that fails to bring anything new to the table. The chemistry between the leads was lacking.",
        "title": "Predictable love story",
        "date": "2020-03-11"
      },
      {
        "author": { "name": "actionfan456", "id": "/user/ur789012345678/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "A mind-numbingly generic action flick. The plot was nonsensical and the characters were forgettable.",
        "title": "Action-palooza",
        "date": "2020-03-10"
      }
    ]
  },
  {
    "id": "tt0102926",
    "reviews": [
      {
        "author": { "name": "Scudder-3", "id": "/user/ur0251361/" },
        "interestingVotes": { "down": 100, "up": 481 },
        "text": "Sweeping all five major Academy Awards (\"Oscars\" for Best Movie, Director, Actor, Actress, Screenplay) is quite an accomplishment.  Doing it nearly a year after a film was released is a miracle considering the notoriously short attention span of Oscar voters.  It is a powerful example of how great a movie can be when superb writers, directors, actors, and others work at the top of their craft.\n\n`Silence of the Lambs' is  the story of a young FBI trainee Clarice Starling (Jodie Foster) who is summoned to help find one serial killer called `Buffalo Bill.' by interviewing another.  Foster's performance is absolutely brilliant.  While Anthony Hopkins receives most of the (well-deserved) praise for his chilling portrayal of incarcerated serial killer `Hannibal the Cannibal' Lector', it is Foster's performance that holds the movie together.  The fear she shows just behind her eyes makes Clarice's outward courage all the more interesting and vulnerable.  This is the perfect way to play the part because it explains Lector's interest in Clarice.  Her only bargaining chip in getting Lector's help is to let him `feed' on her innermost secrets and fears in exchange for his brilliant insights into the psychotic mind.  The title of the movie comes from these exchanges and is very poignant.\n\nDirector Jonathan Demme is masterful.  There is one scene late in the movie that I will not spoil.  It is one of the most simply brilliant scenes ever staged in a movie.  I don't know if all the credit goes to Demme or the writers, but there is a moment in the film where the suspense builds beautifully to a what seems to be a common movie scene.  However, through skillful timing of the direction, the audiences assumptions are used against them and when the truth is revealed (hint: it involves a doorbell) it is shocking and induced a collective gasp from the audience I saw it with at the theatre.  It set the stage for an edge-of-your seat climax.\n\nDo not miss this movie.\n\nThe movie is incredibly suspenseful and an absolute must see.",
        "title": "Absolutely Brilliant.",
        "date": "1999-02-19"
      },
      {
        "author": { "name": "truecrimejunkie", "id": "/user/ur678901234567/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "A gripping true crime story that will leave you on the edge of your seat. The interviews with the actual people involved added to the realism.",
        "title": "Cold-blooded killers",
        "date": "2020-03-09"
      },
      {
        "author": { "name": "dramafan1", "id": "/user/ur567890123456/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "A heartbreaking drama with powerful performances. Be prepared to shed a tear.",
        "title": "Emotionally devastating",
        "date": "2020-03-08"
      }
    ]
  },
  {
    "id": "tt0317248",
    "reviews": [
      {
        "author": { "name": "ccthemovieman-1", "id": "/user/ur4445210/" },
        "interestingVotes": { "down": 24, "up": 91 },
        "text": "Wow, this is one of those different movies - meaning not run-of-mill by any means - and one of those which isn't pleasant to watch but one you might find yourself mesmerized by it.\n\nThis also is one of those \"based on a true story\" films which makes it even more shocking, if its mostly true. The story is of the many young (pre and early-teen) criminals inhabiting an area just outside the big city of Rio de Janeiro in Brazil. It has the feel of a documentary with real-life street kids but is upgraded considerably by fantastic camera-work, some very innovative cinematography. In other words: stylish.\n\nMake no mistake: without that stylish look, the film might be too much of a downer. The street kids are interesting but really brutal, so be prepared. I mean, how often do you see 12-year-old killers portrayed on film? The violence, language and drug use are rough in here and what a sad comment on this social problem in Brazil, a country with a huge problem with these street gangs. Overall, a very tough but fascinating film.",
        "title": "Shocking, Stylish & Brutal Story",
        "date": "2006-03-06"
      },
      {
        "author": { "name": "classicslover", "id": "/user/ur456789012345/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "A classic film that still holds up today. The performances were excellent and the story was timeless.",
        "title": "Legendary cinema",
        "date": "2020-03-07"
      },
      {
        "author": { "name": "indiemoviebuff", "id": "/user/ur345678901234/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "A slow-moving indie flick that explores deep themes. The lead performance was strong but the pacing was a bit off.",
        "title": "Thought-provoking",
        "date": "2020-03-06"
      }
    ]
  },
  {
    "id": "tt0120815",
    "reviews": [
      {
        "author": { "name": "keving4241", "id": "/user/ur46204888/" },
        "interestingVotes": { "down": 25, "up": 1091 },
        "text": "My grandfather fought in WW2 somehow surviving D-Day. He was apart of Operation Neptune and stormed the beaches of Normandy. He told us a lot of war stories but rarely ever spoke about that day. Before he passed away he did an interview with a local newspaper and detailed what he saw despite it being very difficult for him to speak about. He loved watching war movies... not sure exactly why. Some about that soldier life never really leaves them I guess. He absolutely hated Pearl Harbor cause of the horrible way they portray the military to be a bunch of toothbrush wielding babies who don't know what to do in the event of being attacked. He had a friend stationed there who lost his life and thinks that movie is a disgusting display of ignorance. Soldiers don't take girlfriends on private plane rides. And they most definitely know how to swim. Maybe I'll give that movie a good ripping one day.\n\nBut Saving Private Ryan was a respectable \"I can't watch this\" reaction. He said no movie has come that close to capturing what that day was like. He said it was too realistic. Whether or not the story is based on real or fiction, that intro was 100% realistic. I'm not sure if he ever did finish watching it but he appreciated it for capturing that chaos like no other movie has before. I watched the movie a dozen times now and keep it in my collection as a reminder of my grandfather. A scene he was technically in. Which makes me appreciate how strong of a person he really is.\n\nWar is hell and this movie not only shows that while being an entertaining experience but also captured what soldiers are left behind with. My grandfather was not afraid of anything. I've seen this man walk into a cellar full of black widows to get firewood and not even shake them off. The only time he ever experienced fear was when he went to bed. His nightmares of his time during the war would haunt him in his sleep. This movie helped me understand why.",
        "title": "The only movie my grandfather couldn't finish",
        "date": "2018-10-11"
      },
      {
        "author": { "name": "comedylover333", "id": "/user/ur234567890123/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "A witty and charming comedy with a great cast. This one had me smiling from ear to ear.",
        "title": "Feel-good fun",
        "date": "2020-03-05"
      },
      {
        "author": { "name": "horrorlover666", "id": "/user/ur123456789012/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "A scary and suspenseful horror flick. The tension builds gradually until the terrifying climax.",
        "title": "Nightmare generator",
        "date": "2020-03-04"
      }
    ]
  },
  {
    "id": "tt0816692",
    "reviews": [
      {
        "author": { "name": "ravesch-83770", "id": "/user/ur75870169/" },
        "interestingVotes": { "down": 7, "up": 109 },
        "text": "Sometimes I just need to see the start. Or end. Or a trailer. Or the music and theme from Hans Zimmer. Or the whole movie. Just to feel that thing, I only get from this movie. That the earth, space and time are something special, mystical. I never forget the first time I saw this movie, in an IMAX theatre in 2014. I was struck by it. Totally got me. And it stil does, 7 years later. This is the best movie ever made for me. Because of the feeling it gives me, no other movie can. So hard to get all of this emotion in only one movie. Brilliant.",
        "title": "7 years later",
        "date": "2021-10-29"
      },
      {
        "author": { "name": "romanticatheart", "id": "/user/ur012345678901/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "A cliched romance with predictable plot twists. The performances were decent but the story was lacking.",
        "title": "Unoriginal love story",
        "date": "2020-03-03"
      },
      {
        "author": { "name": "cinemabuff1", "id": "/user/ur90123456789/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "An artfully crafted film with stunning visuals. The story was a bit slow but the filmmaking was impressive.",
        "title": "Beautifully shot",
        "date": "2020-03-02"
      }
    ]
  },
  {
    "id": "tt0120689",
    "reviews": [
      {
        "author": { "name": "deepaknarwal88", "id": "/user/ur21630717/" },
        "interestingVotes": { "down": 15, "up": 364 },
        "text": "i expected this movie to be a normal and i just want to see it for Tom Hanks but as movie goes through i cry,i laugh and there comes a feeling which can't be described in words. i rate this movie as the best i have ever seen. some moments in the movie makes me hold my bed pillow in the tightest ever grip. i can guarantee that this movie will leave an impression in your mind for a long time. i even say that this movie is better than shawshank redemption.fantastic story, brilliant acting,mind boggling feelings and overall an unforgettable drama. if you have watched 1000 movies and not this then your movie watching journey is incomplete.i will also make sure that even my next generation should watch this one.",
        "title": "this movie can tear emotions out of anyone.",
        "date": "2009-12-02"
      },
      {
        "author": { "name": "actionfan123", "id": "/user/ur89012345678/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "A fun action romp with plenty of one-liners. Don't think too hard about the plot and enjoy the ride.",
        "title": "Popcorn flick",
        "date": "2020-03-01"
      },
      {
        "author": { "name": "filmgeek123", "id": "/user/ur78901234567/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "An overrated mess. This film tried too hard to be deep and meaningful but ended up being confusing and pretentious.",
        "title": "Hype machine",
        "date": "2020-02-29"
      }
    ]
  },
  {
    "id": "tt0076759",
    "reviews": [
      {
        "author": { "name": "hmorales", "id": "/user/ur0173908/" },
        "interestingVotes": { "down": 68, "up": 220 },
        "text": "In respect to the many kids of the seventies. I rated this movie as one of the greatest movies ever made. I was thirteen and enjoyed this fantasy getaway more than I could count. Like many other kids of the seventies you left reality before walking into the theatre and escaped into the adventure once the reels begin rolling. It provided the special effects and excitement a kid was looking for. Even today when I watch this movie on VHS I recall those times. Whenever I get the chance to watch it I feel like that eager thirteen year old over and over again. I hope the new movies will meet the same expectations of kids of  this decade and the next.",
        "title": "A kid's fantasy. An Adult's memory",
        "date": "1998-12-03"
      },
      {
        "author": { "name": "historybuff1", "id": "/user/ur67890123456/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "An engaging historical drama that brings a little-known story to life. The attention to detail was impressive.",
        "title": "Hidden history",
        "date": "2020-02-28"
      },
      {
        "author": { "name": "comedyfan456", "id": "/user/ur56789012345/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "A hilarious comedy with witty writing and great performances. This one had me laughing from start to finish.",
        "title": "Laughs aplenty",
        "date": "2020-02-27"
      }
    ]
  },
  {
    "id": "tt0118799",
    "reviews": [
      {
        "author": { "name": "amira_berzi", "id": "/user/ur0843488/" },
        "interestingVotes": { "down": 98, "up": 468 },
        "text": "This is one of those movies that have a lasting effect on you.   After watching it, I found that it has less to do with the Holocaust and more to do with the human feelings and the beautiful relationship of a father and his son.  The holocaust provides the ultimate context, that brings and highlights the story and adds yet another deep dimension to the movie.  No such piece of art has ever before combined laughter and tears of sadness in me before and that is the miracle of the movie.  The realism of the movie is not its strong point, but then again it is  not supposed to be; this helps in bringing the audiences to a state of mind away from reality, focusing on the feelings generated by forgetting about all external events and developments of the war.  Despite that, the movie does not fail to point out an element of the nazi psychology demonstrated by the doctor who was obsessed with riddles.  This portrayed the nazi 'state of mind' (if ever such an expression existed) as a sick mentally disturbed state.  Life is really beautiful as you watch Guido's relentless efforts to make a lovely exciting experience of the concentration camp to his son.  You get exhausted just watching him going through his painful day and yet you smile as he speaks to his son and makes him laugh.  One can go on forever  describing the creativity of this movie, but one will not be able to capture all its beauty in writing.",
        "title": "One of the best movies ever.",
        "date": "2000-08-29"
      },
      {
        "author": { "name": "actionheroes", "id": "/user/ur45678901234/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "A mindless action flick with forgettable characters. The explosions got old quickly.",
        "title": "Generic blockbuster",
        "date": "2020-02-26"
      },
      {
        "author": { "name": "documentaryfan", "id": "/user/ur34567890123/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "An eye-opening documentary that sheds light on an important issue. The interviews were powerful.",
        "title": "Informative and enlightening",
        "date": "2020-02-25"
      }
    ]
  },
  {
    "id": "tt0103064",
    "reviews": [
      {
        "author": { "name": "ivo-cobra8", "id": "/user/ur15140057/" },
        "interestingVotes": { "down": 27, "up": 197 },
        "text": "Terminator 2: Judgment Day is (1991) is the best action sci-fi flick movie from the 90's ever made of all time. Terminator 2 is my personal favorite film I absolutely love this movie to death! Is my number 1 best movie ever till today the best of the best epic movie of all time. T2 was nominated for 4.Oscars the only movie of the franchise was nominated for an Oscar. If you watch T2 carefully and follow the story you never got bored and you are very entertained. This movie kicks ass! I love the hospital scenes mostly at night, the Cyberdyne building action sequences and of course steel mill action sequences are perfect for this film. This film deals with a lot of action, sci-fi and does involves a lot of paradox past travel. There is a lot of explosions and automatic weapons used in the movie and they are used well thousands of bullets are fired and explosive projectiles are fired at the police cars. \n\nArnold Schwarzenegger as the good terminator T-800 did an awesome Terrific real job, he acted believably as one of his best characters I ever saw on screen. Terminator walks to the front of the building and kicks a desk out a window. Than ignores the police's order to surrender and fires a M134 Minigun with Chainsaw grip at the police cars below, avoiding the humans. The helicopter pilot moves away. Terminator than uses a M79 grenade launcher to destroy two more vehicles. Its heads-up display indicates no human casualties. The film has a heart and is the best film in the world. \n\nRobert Patrick as T-1000 is \"a mimetic Polly-alloy\" or \"liquid metal.\" He can shape shift to match other people he touches, after first arriving in present time, he decides to have his base form be that of a nearby cop he killed and passes himself off as a cop in that form. The truck chase scene is awesome and the crash is also awesome. The truck that hit in to another column in the canal and explodes, T-1000 emerges as a shiny, featureless, liquid metal figure. Its features become more pronounced and its colors return to normal, returning to the form of the unharmed pseudo-cop is awesome. It shows what his character can do. \n\nLinda Hamilton is the only Sarah Connor she acted her character perfectly here she played her character genius and very convincing and real, tough beyond all belief and completely focused on preventing the nuclear war and ensuring John's safety. Sarah Connor is her best performance ever in the both Terminator films. Little out of her mind with paranoia and anger: amazingly, you see actual character development (specifically, when John and T101 arrive at Dyson's house to prevent her from doing what she wants to). \n\nEdward Furlong, is the only John Connor for me, is not bad himself as the extroverted kid who's confused by the fact that everyone except his mom told him his entire upbringing was based on a lie. The bit players all do their jobs well. Earl Boen plays the semi-sadistic mental hospital warden Dr. Silberman from the first film The Terminator (1984) that stands between Sarah Connor and her son (until the T1000 makes a chilling entrance).\n\nArnold Schwarzenegger, Linda Hamilton, Edward Furlong and Robert Patrick did there best acting performances, those actors who played there characters are beloved till this days and Terminator 2 has since been ranked as one of the greatest action, science fiction sequel films of all time. \n\nTwin sister of Linda Hamilton also appeared as Leslie Hamilton Gearren as Twin Sarah in dream she was for real there wasn't no CGI in here. Twin brothers Don Stanton and Dan Stanton both of actors appeared in here one as Lewis the Guard the other as Lewis as T-1000 who kills lewis they were for real no CGI, except special effects for T-1000 knife. Terminator special effects were designed by Stan Winston R.I.P. who has done incredible job making those effects. \n\nThe film is absolutely filled with great, classic moments. T2 is James Cameron masterpiece. This wouldn't be an action movie without some action. James Cameron writes, produces and directs brilliantly this film. Brad Fiedel does a perfect music score to the film. American rock band Guns N' Roses wrote a single for this movie \"You Could Be Mine\" and Schwarzenegger appeared in the music video as T-800 in the music video for this movie. \n\nThe chopper scene that crashed in to a SWAT van and explodes was awesome. The CGI and special effects are awesome. This movie is what it is, a perfect 10, because it takes the vision of one of the most imaginative directors on Earth, and realizes them almost perfectly with all the tools that fit the task actors, stunts, puppetry, models and special effects designed from Stan Winston. \n\nIt is Rated R for strong sci-fi action and violence, and for language, it is a perfect film from the 90's that I have grew up with it. 10/10 Score: Bad Ass Seal Of Approval",
        "title": "The best action sequel of all time and one of the best Schwarzenegger's movies my personal favorite",
        "date": "2018-01-06"
      },
      {
        "author": { "name": "dramaqueen", "id": "/user/ur23456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "A moving drama with fantastic performances. The story was emotional without being manipulative.",
        "title": "Tearjerker",
        "date": "2020-02-24"
      },
      {
        "author": { "name": "mysteryfanatic", "id": "/user/ur12345678901/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "A suspenseful mystery with plenty of twists and turns. The resolution was satisfying.",
        "title": "Who-done-it",
        "date": "2020-02-23"
      }
    ]
  },
  {
    "id": "tt0245429",
    "reviews": [
      {
        "author": { "name": "kraley", "id": "/user/ur1957479/" },
        "interestingVotes": { "down": 95, "up": 187 },
        "text": "Good morning. Last night I was able to catch the Disney US Release of Spirited Away ( originally The Spiriting Away of Sen and Chihiro). This is another  Disney purchase of a Japanese hit. For those that don't know, Disney has a nasty habit of importing titles from Japan and then changing the story when dubbing films or creatively editing the endings or plot to \"suit American audiences\". Personally I think that's a travesty. So  whenever you go see the Disney release of a foreign film, realize the film you are watching may not be the 'same film' the rest of the world sees.\n\nOK, that aside, was it a good film? I deliberately did no research before seeing this film as I prefer to go into films with little or no expectations. All I knew was that the film was directed and written by Hayao Miyazaki, the same man responsible for Princess Mononoke ( a film released a few years back that I also enjoyed). In the case of Spirited away, I'm glad I did not know what I was getting myself into, otherwise I might not have come (and surprisingly, not for the reasons you likely assume).\n\nThe film concerns a young girl and her parents who find an odd tunnel in the side of a hill while moving to their new home. Upon investigating the tunnel, they find a strange \"theme park\" on the other side devoid of inhabitants. Upon investigating the theme park, things are obviously very \"wrong\" (at least to the little girl- her parents seem woefully oblivious) and as it gets closer to sunset, things just get worse. Unfortunately, this is all the plot I am able to reveal without spoiling the uniqueness of this film.\n\nThis is an 'adult-oriented' movie. It has some rather disturbing images and ranks among the weirdest films I have seen in my life. It's a bizarre amalgam of Wizard of Oz,The Neverending Story, Alice in Wonderland, My Friend Totoro, Chitty Chitty Bang Bang and The City of Lost Children (just to name a few). This film is interesting from beginning to end even though the plot advances rather slowly. There is always some new thing to see or some truly bizarre thing to witness. The animation is above average but not as impressive as Mononoke (and even features several gratuitous CGI sequences).\n\nThere is a great story and some great humor. I laughed more in this film than I have at any Hollywood 'comedy' in the last 5 years (and Spirited Away is not a comedy, it just has several good comedic breaks). No nudity. No Profanity. No 'gratuitous' violence. Some rather disturbing scenes of characters getting eaten alive (and some threats thereof) but even the eaten characters return unharmed later in the film.\n\nThis is not really a 'family film' (and definitely NOT a \"kiddee film\") but it is something you can take the whole family to. Smaller children will not understand the story, but they'll like the visuals and enjoy the humor. Mid-teens might be a bit \"weirded out\" by the subject matter and the visuals and older teens and adults may be too jaded by American cinema to enjoy the film for what it is- a lavish fairytale from a foreign country. This film runs about 2 hours so leave the \"kidney-buster\" sodas at the snack bar. If you have to take a bathroom break, you WILL miss something and I assure you no friend nor helpful audience member will likely be able to adequately convey what it is you DID just miss.\n\nIf you enjoy Anime or the bizarre, make an effort to see this film. Even if you don't normally like \"cartoon movies\", you might give this one a chance. It is not a 'casual moviegoer' film by any means and does rely on some thought from the audience to enjoy it. It will also likely be the oddest film you'll see this decade and you'll be sure to remember this film long after all the other 'disposable movies' have faded from your recollection. This film is receiving almost no advertising. I didn't even know it existed until I saw the poster tucked away in a corner at the theatre earlier this week. I hope Disney puts a little more effort into advertising this film's release because it is truly an original film and worthy of a large audience. Hopefully positive word-of-mouth will get this film the attendance it deserves.",
        "title": "A Fantastic Film (most literally)",
        "date": "2002-10-04"
      },
      {
        "author": { "name": "romancefan1", "id": "/user/ur01234567890/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "A sappy romance that was hard to watch at times. The chemistry between the leads was lacking.",
        "title": "Cheesy love story",
        "date": "2020-02-22"
      },
      {
        "author": { "name": "indiefilmlover", "id": "/user/ur9012345678/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "A hidden gem. This indie film was a breath of fresh air with its unique story and characters.",
        "title": "Underrated masterpiece",
        "date": "2020-02-21"
      }
    ]
  },
  {
    "id": "tt0054215",
    "reviews": [
      {
        "author": { "name": "arichmondfwc", "id": "/user/ur4238363/" },
        "interestingVotes": { "down": 8, "up": 130 },
        "text": "Getting into Hitchcock's Psycho, 57 years after its original release is like assisting to a masterclass of sorts. We can now identify what made this little lurid tale into a classic. Hitchcock himself, naturally, but now we know the first director's cut was a major disappointment and that Alma Reville - Hitch's wife - took over, re edited and the results have been praised, applauded and studied ever since. Janet Leigh's Marion Crane created a movie landmark with her shower scene. Bernard Herrmann and his strings created an extra character that we recognize as soon as it reappears under any disguise but, what shook me the most now in 2017 is Anthony Perkins as Norman Bates. His performance has evolved with the passing of time and its effect has remain as chilling, as moving, as funny and as real as it was in 1960. It's interesting to watch Gus Van Sant's 1998 version with Vince Vaugh as Norman Bates. If you look at the film, shot by shot with Berrnard Herrmann's strings - it's pretty fantastic. - Play it in black and white if you can. The problem and it is a monumental problem, we wait for Janet Leigh and Anthony Perkins, if the casting of Anne Heche was really bad - not a hint of Janet Leigh's humanity, the casting of Vince Vaughn was incomprehensible. Not just not credible for a moment but annoying, very annoying. Anthony Perkins brought something profoundly personal to Norman Bates and as a consequence we connected with his sickness. We felt for him. Okay, sorry, I didn't mean to go there but I felt compelled to because I saw again Psycho (1960) ad Psycho (1998) at 24 hours from each other and realized that the main flaw of the 1998 versions is the absence of Anthony Perkins.",
        "title": "Anthony's Norman",
        "date": "2017-05-19"
      },
      {
        "author": { "name": "kiddiecritic", "id": "/user/ur8901234567/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "A fun family movie with colorful animation. The story was a bit simplistic but still enjoyable.",
        "title": "Kid-friendly fun",
        "date": "2020-02-20"
      },
      {
        "author": { "name": "shockjock", "id": "/user/ur7890123456/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "Offensive and unfunny. This comedy went for shock value instead of actual humor.",
        "title": "Disappointment",
        "date": "2020-02-19"
      }
    ]
  },
  {
    "id": "tt0110413",
    "reviews": [
      {
        "author": { "name": "Twinsen61", "id": "/user/ur2955960/" },
        "interestingVotes": { "down": 46, "up": 324 },
        "text": "Leon is one of the most emotionally intense movies ever made. French director Luc Besson uses everything: actors, music, camera angles, lighting to create an unique experience - \"It's not realism, it's not naturalism - it's heightened reality\" as Gary Oldman very well put it.\n\n In \"The making of The Professional\" Besson says \"If I imagine somebody in the street try to knock on my daughter, I kill the guy, in five seconds. I kill him, and I think \"It's in me, I'm a beast!\" On this part we can't forget that a part of us, the genetic things inside are much, much older than The Ten Commandments\". He certainly uses visceral scenes to create very strong emotion  in the movie - the blood running from Mathilda's nose or Stansfield's unforgettable \"EVERYONE!\" are just a couple of examples. The music and the sound are excellent and are used in a masterly fashion - you can hear Fatman's heart beating desperately or a low claustrophobic sound when Stansfield turns to look at Mathilda's father.\n\nHowever Leon does not work only on this primary level, it also has an intelligent story. It may seem to be almost a fairy-tale, but don't be fooled -  just like his character Besson is serious. This movie has a message: without love we are dead, even if we don't see it. Only true love give meaning to our lives: \"everything else reminds me a big yogurt: warm and rancid\" as Mathilda says in the original script, which is available on the net under the name Leon Version 1. Is this true in \"real life\"? I don't know but this movie can make you wonder.\n\nThen of course there's the sensuality. It's hypocritical to deny it, the camera interacts with Mathilda in a mesmerising fashion. It's not sick and it's not degrading: it's art, subtle and beautiful.\n\nLeon is not perfect but it has so many great moments that all its flaws can be forgiven. It's a movie that really should not be missed, unless you are concerned with its amorality. And don't be - Leon is less violent than many action movies and the unusual relationship between the main characters is handled mostly with genuine feeling and tact.",
        "title": "Visceral and intelligent - Besson's masterpiece",
        "date": "2004-01-19"
      },
      {
        "author": { "name": "critic321", "id": "/user/ur6789012345/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "A decent movie but nothing groundbreaking. The acting was solid but the plot was forgettable.",
        "title": "Average at best",
        "date": "2020-02-18"
      },
      {
        "author": { "name": "scifigeek1", "id": "/user/ur5678901234/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "Engaging sci-fi with great special effects. The story was a bit convoluted but still enjoyable.",
        "title": "Out of this world",
        "date": "2020-02-17"
      }
    ]
  },
  {
    "id": "tt6751668",
    "reviews": [
      {
        "author": { "name": "dougal79", "id": "/user/ur31521039/" },
        "interestingVotes": { "down": 176, "up": 237 },
        "text": "What an amazing film! Clearly an essay on the class divide. Writing lovable but nasty people is tough, but perfectly executed here.\n\nThey quite clearly cross the line, and when I mean \"they\" I mean bother the working class and the upper class. You could easily argue that \"parasite\" refers to one family trying to suck another family dry. Or that the upper class is draining the labour of the lower class, and expecting them to be grateful about it too! There is also something about the American Indian theme, a metaphor for dying cultural traditions which are being replaced by modernity? Nature is dog eat dog? Or is it a homage to an \"idyllic\" past where Native American culture was relatively classless?\n\nEither way a must watch if you can handle subtitles!",
        "title": "Whose the parasite and whose the cow?!",
        "date": "2019-08-17"
      },
      {
        "author": { "name": "arthouseaficionado", "id": "/user/ur4567890123/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "Unbearably pretentious. This arthouse film was more interested in being obscure than telling a coherent story.",
        "title": "Pseudo-intellectual garbage",
        "date": "2020-02-16"
      },
      {
        "author": { "name": "classicsfan", "id": "/user/ur3456789012/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "A timeless classic. The story still resonates today and the performances were outstanding.",
        "title": "All-time great",
        "date": "2020-02-15"
      }
    ]
  },
  {
    "id": "tt0110357",
    "reviews": [
      {
        "author": { "name": "miadarlingtxn", "id": "/user/ur79715629/" },
        "interestingVotes": { "down": 6, "up": 28 },
        "text": "this was, and still is,a great movie I love it, and hope that everyone gets to experience it for themselves, I've watched it many times and it is always good no matter how many times you have seen it,the songs are great and so are all the characters and the story is incredible, great for all ages and I really recommend it to anyone who hasn't already watched it.",
        "title": "great film",
        "date": "2017-08-23"
      },
      {
        "author": { "name": "comedylover123", "id": "/user/ur2345678901/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "Laugh-out-loud funny. The comedic timing was perfect and the jokes were clever.",
        "title": "Hilarious comedy",
        "date": "2020-02-14"
      },
      {
        "author": { "name": "chickflickqueen", "id": "/user/ur1234567890/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "A predictable, cheesy romance. The only redeeming factor was the beautiful scenery.",
        "title": "Cliched chick flick",
        "date": "2020-02-13"
      }
    ]
  },
  {
    "id": "tt0088763",
    "reviews": [
      {
        "author": { "name": "ivo-cobra8", "id": "/user/ur15140057/" },
        "interestingVotes": { "down": 25, "up": 224 },
        "text": "What can I say about this movie that was already said? It is my favorite time travel sci-fi, adventure epic comedy in the 80's and I love this movie to death! When I saw this movie I was thrown out by its theme. An excellent sci-fi, adventure epic, I LOVE the 80s. It's simple the greatest time travel movie ever happened in the history of world cinema. I love this movie to death, I love, LOVE, love it! \n\nI firstly saw this movie in the early 90's as a kid on VHS tape and I was blow away by the action and the score and the title back to the future. This movie is one of the best masterpiece time travel epic adventure film. Michael J. Fox and Christopher Lloyd are fantastic at acting. Music theme score by Alan Silvestri is excellent I could listen to it whole day.\n\nBack to the Future (1985) \n\nFrom the Academy Award \"- winning team of Steven Spielberg\" and Robert Zemeckis** comes the hilariously groundbreaking adventure that thrilled critics and audiences alike - and sparked one of the most successful movie trilogy ever! Directed by Robert Zemeckis the movie begins with Marty McFly (Michael J. Fox) a teenager who has a really messed up family. His ultimate goal was to become a rock star which was heartened by his girl friend Jennifer Parker (Claudia Wells). But things went wrong when scientist Dr. Emmett Brown/Doc (Christopher Lloyd) wanted Marty's assistance for his new invention.\n\nAt that night Marty went to assist Doc's invention the Time traveling Car \"DeLorean\". Marty was told to record Doc's first time travel to the future. At that instant they were attacked by some Libyan terrorists who were cheated by Doc for Plutonium.\n\nAfter killing Doc they turn towards to Marty and without any intention Marty enters the Time Traveling car. But it was previously set by Doc and when activated Marty gets transfer to 1955 from 1985.\n\nWhat will he do next, will he can come back to the future, or will he stuck back in the past for his rest of the life. More than that will his time travel make serious effects on the future? Dealing with time travel and time paradox Steven Spielberg presents this amazing journey of Marty set up in the time of 80's and 50's. Scripted by Robert Zemeckis and Bob Gale for the story of Bob Gale himself, tells a science fiction adventure in a family oriented tone.\n\nThey really work hard to sculpt that sci-fi thread into a thrilling, culture clashed family movie. A good story with a great script. Also the soul of the movie was given by the legend Alan Silvestri. His composition was all memorable especially in the chasing and emotional scenes. Over the top the theme music, it was the most dazzling and recognizable themes in the movie history.\n\nMore than that the casting was simply brilliant, each and every actor is born to play their respected roles in this movie. Michael J. Fox was the only actor who can play the role of energetic Marty McFly, which was considered for numerous actors. Also Thomas F. Wilson was brilliant in his performance as the Bad boy Biff Tannen. Lea Thompson did a great work in portraying Lorraine Baines's two different life times, as a teenage girl and a matured mother. Well the extra talented Christopher Lloyd had almost \"chewed every scenes\" in the movie. Mr. Lloyd's versatile performance as the madman and genius scientist Dr. Emmett Brown is one of the great memorable roles in his carrier.\n\nLast but not the least, it was Crispin Glover who steal the show as the nerdy teenager/father as George McFly. It was an interesting portrayal as a boy who was transformed to a man. Crispin Glover lived in that part. I don't know whether the movie would be a masterpiece without his unique performance. Above all I want to remember this as a romantic movie and it couldn't be made without the songs \"The Power of Love,\" and \"Earth Angel\".\n\nThe rating I am giving is 10/10 the original and the best one of all time. I love this film, it is my favorite time travel movie of all time and I love it to death! All in all it is the greatest sci-fi, romantic movie of all time. It is the part of the great Movie History, which consider itself as \" A Modern/Classic Masterpiece! \"",
        "title": "A classic masterpiece the original the only best my favorite time travel film of all time",
        "date": "2017-04-17"
      },
      {
        "author": { "name": "actionhero", "id": "/user/ur0123456789/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "An explosion-filled spectacle. The plot was thin but the action made up for it.",
        "title": "Mindless fun",
        "date": "2020-02-12"
      },
      {
        "author": { "name": "comicbooknerd", "id": "/user/ur901234567/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "A faithful adaptation of a beloved comic book. The action was great and the characters were lovable.",
        "title": "Comic book come to life",
        "date": "2020-02-11"
      }
    ]
  },
  {
    "id": "tt0172495",
    "reviews": [
      {
        "author": { "name": "ajkbiotech", "id": "/user/ur130506467/" },
        "interestingVotes": { "down": 6, "up": 71 },
        "text": "There are so many iconic lines and quips in this film, too many to count\n\nIt was easily the best film of the start of the millennium.\n\n\"on my mark, unleash hell!\"\n\n\"My name is Maximus Decimus Meridius, commander of the Armies of the North, General of the Felix Legions and loyal servant to the TRUE emperor, Marcus Aurelius. Father to a murdered son, husband to a murdered wife. And I will have my vengeance, in this life or the next.\"",
        "title": "One of the best films ever",
        "date": "2021-04-06"
      },
      {
        "author": { "name": "arthouseguru", "id": "/user/ur890123456/" },
        "interestingVotes": { "down": 3, "up": 7 },
        "text": "Slow-moving and pretentious. This arthouse film seemed more interested in being obscure than telling a story.",
        "title": "Pseudo-intellectual nonsense",
        "date": "2020-02-10"
      },
      {
        "author": { "name": "horrorbuff666", "id": "/user/ur789012345/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "Scary and atmospheric. This horror flick had me jumping out of my seat!",
        "title": "Spooky scare-fest",
        "date": "2020-02-09"
      }
    ]
  },
  {
    "id": "tt0253474",
    "reviews": [
      {
        "author": { "name": "jotix100", "id": "/user/ur1406078/" },
        "interestingVotes": { "down": 49, "up": 178 },
        "text": "The Pianist is an incredible film in many aspects. Roman Polanski's account of the survival of the pianist, Wladyslaw Szpilman, is a document about how one man can overcome the worst possible situations in a world gone completely mad around him.\n\nThe only fault one can find with the adaptation of Mr. Szpilman's story by playwright Ronald Harwood, is the fact that we never get to know the real Wladyslaw Szpilman, the man, as some of the comments made to this forum also have indicated.\n\nThere is a very interesting point raised by the the pianist's father who upon reading something in the paper, comments about how the Americans have forgotten them. Well, not only the Americans, but the rest of the world would not raise a finger to do anything for the people that were being imprisoned and made to live in the confined area of Warsaw. The exterminating camps will come later. \n\nWhat is amazing in the film, is the frankness in which director Polanski portrays the duplicity of some Jews in the ghetto. The fact that Jews were used to control other Jews is mind boggling, but it was a fact, and it's treated here matter of factly. Had this been made by an American director, this aspect would have never surfaced at all. Yet, Mr. Polanski and Mr. Harewood show us that all was not as noble and dignified as some other films have treated this ugly side of war.  \n\nWladyslaw Szpilman, as played by Adrien Brody, is puzzling sometimes, in that we never get to know what's in his mind. He's a man intent in not dying, but he's not a fighter. He accepts the kindness extended to him. He never offers to do anything other than keep on hiding, which is a human instinct. He will never fight side by side with the real heroes of the ghetto uprising. His role is simply to witness the battle from his vantage point in one of the safe houses across the street from where the action takes place.\n\nAdrien Brody is an interesting actor to watch. As the pianist of the story he exudes intelligence. There is a scene where Szpilman, in one of the safe houses he is taken, discovers an upright piano. One can see the music in his head and he can't contain himself in moving his fingers outside the closed instrument playing the glorious music from which he can only imagine what it will sound in his mind.\n\nThe supporting cast is excellent. Frank Findlay, a magnificent English actor is the father of the pianist and Maureen Lipman, another veteran of the stage, plays the mother with refined dignity.\n\nIn watching this film one can only shudder at the thought of another conflict that is currently brewing in front of our eyes. We wonder if the leaders of the different factions could be made to sit through a showing of The Pianist to make them realize that war is hell.",
        "title": "To hell and back.",
        "date": "2003-01-21"
      },
      {
        "author": { "name": "shakespearefan", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "A faithful adaptation of a classic play. The performances were top-notch.",
        "title": "Bard on the big screen",
        "date": "2020-02-08"
      },
      {
        "author": { "name": "thrillerjunkie7", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "Kept me guessing until the very end. Twists and turns abound in this gripping thriller.",
        "title": "A real nail-biter",
        "date": "2020-02-07"
      }
    ]
  },
  {
    "id": "tt0120586",
    "reviews": [
      {
        "author": { "name": "exa56", "id": "/user/ur2124305/" },
        "interestingVotes": { "down": 42, "up": 305 },
        "text": "I have been wanting to see this movie for a long time, since my English teacher mentioned it in our class in grade ten. Gosh I wished I wouldn't have waited all this time to finally watch it, although maybe it's a good thing cause I would have probably been a little bit more traumatized at 14... This movie is exceptional!!! Makes u think, makes you frustrated, makes you wanna scream and even makes you cry! Edward Norton is just phenomenal playing the role of a freak skin head and even more so playing this skin head who finally realizes how stupid he was and tries to protect his younger brother. Edward Furlong also does an amazing job!!! This film is moving in so many ways...I can't even describe how real and heartfelt it felt. I definitely think Edward Norton should have won the Oscar for his performance, cause he was absolutely terrific! I can't get why they didn't gave it to him... This movie will surely stay on my mind for a while now... just thinking that some place in the world things like that still happen...it crushes my heart. This is a wonderful movie that every single person should see at least once in his life... Watch American History X, it totally worth it!",
        "title": "A masterpiece! Truly one of the best film I have ever seen",
        "date": "2006-01-26"
      },
      {
        "author": { "name": "romcomqueen", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 2, "up": 4 },
        "text": "A bit cheesy at times, but still a fun rom-com. The chemistry between the leads was great.",
        "title": "Feel-good movie",
        "date": "2020-02-06"
      },
      {
        "author": { "name": "actionfanatic1", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "An adrenaline-fueled ride. The fight scenes were amazing and the pacing was perfect.",
        "title": "Non-stop action",
        "date": "2020-02-05"
      }
    ]
  },
  {
    "id": "tt0407887",
    "reviews": [
      {
        "author": { "name": "Alwood", "id": "/user/ur0163443/" },
        "interestingVotes": { "down": 467, "up": 882 },
        "text": "Please don't make negative comments like some of the aforementioned people have been doing if you haven't seen the film yet! I have seen it, at a press screening last week. Not only is it the best film of the year so far, it marks a return to form for Martin Scorsese, and ranks with the likes of GOODFELLAS as being one of the best in his canon of films.\n\nI'm a fan of the Hong Kong film, INFERNAL AFFAIRS, upon which this is based. While THE DEPARTED keeps the basic structure of the original, it is very much its own movie, so much so that the screenwriter, William Monahan, didn't even watch the original film while adapting its screenplay, thus enabling him to infuse the script with his, and Scorsese's, respective visions.\n\nAll the actors are first-rate (yes, even Leo, for all you DiCaprio bashers out there), and turn in some of their best performances to date. THE DEPARTED is sure to garner a host of Oscar nods, if not wins, including (hopefully) Scorsese's long-overdue statuette for Best Director. Plus, with actors like Martin Sheen and Alec Baldwin playing supporting roles, that says a lot about the quality of the film they signed up for! THE DEPARTED is tough stuff, not for the faint-of-heart. That said, it is a must-see for adult viewers who long for intelligent, gritty stories to grace our movie screens once again.",
        "title": "Martin Scorsese Hits the Streets Again!",
        "date": "2006-10-03"
      },
      {
        "author": { "name": "filmcritic33", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "A thought-provoking film with complex characters. It may not be for everyone, but I found it captivating.",
        "title": "Intense drama",
        "date": "2020-02-04"
      },
      {
        "author": { "name": "movielover22", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "Great acting and directing. The plot was a bit predictable but still an enjoyable watch.",
        "title": "Solid movie",
        "date": "2020-02-03"
      }
    ]
  },
  {
    "id": "tt0114814",
    "reviews": [
      {
        "author": { "name": "Agent10", "id": "/user/ur1696608/" },
        "interestingVotes": { "down": 123, "up": 327 },
        "text": "Such films like this should be enshrined in museums, simply due to the fact it destroyed the entire genre of mystery films. While this film was unique and captivating, no other mystery will ever accomplish this sort of cult status, single handedly shaping a genre. While most mysteries try to shock you too often with twists and even more twists, it turns out to be overkill. This film encompassed such ideas with flair and originality, which is probably the reason Brian Singer is sticking to sci-fi action films. Only Memento and The Game are the only recent mystery movies worthy enough to stand beside this film. Sadly, Singer has somewhat sold out by doing the X-Men movies, but I guess trying to make films like this would be too taxing. This film will always bring a smile to my face when I watch it with someone who hasn't seen this movie. A good viewing every time I watch it, the new special edition DVD is awesome.",
        "title": "Not enough good things to say",
        "date": "2002-06-01"
      },
      {
        "author": { "name": "cinemajunkie234", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie was a true masterpiece. The direction was excellent and the acting was superb. A must-see for any cinephile!",
        "title": "True masterpiece",
        "date": "2020-01-03"
      },
      {
        "author": { "name": "moviebuff456", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 9 },
        "text": "I was completely blown away by this movie. The story was so compelling and the acting was excellent. Highly recommend!",
        "title": "Blown away",
        "date": "2020-02-29"
      }
    ]
  },
  {
    "id": "tt0482571",
    "reviews": [
      {
        "author": { "name": "Faisala", "id": "/user/ur9881003/" },
        "interestingVotes": { "down": 174, "up": 545 },
        "text": "I have to say this is one of the best movies i have seen this year, i was not expecting it to be that good. There's twist after twist, and when you think there is no more, there will be. Great performances and ever better plot. I highly recommend this movie to all ages.\n\nNew idea for a movie, and they succeeded it at it greatly. It will have you thinking every time you see a magician on TV!\n\ni had to give this movie a 10/10, and i only have 4 movies that i would rate that way in my life time. If there is anything you do this year, make it a trip to watch this movie!\n\nI hope you enjoy it as much as i did.",
        "title": "Amazing! twist after twist!",
        "date": "2006-10-22"
      },
      {
        "author": { "name": "filmlover123", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a true work of art. The direction was flawless and the acting was superb. A must-see for any art lover!",
        "title": "Work of art",
        "date": "2020-02-13"
      },
      {
        "author": { "name": "moviemaniac789", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I was completely engrossed in this movie. The story was so compelling and the acting was superb. Highly recommend!",
        "title": "Engrossing",
        "date": "2020-01-26"
      }
    ]
  },
  {
    "id": "tt2582802",
    "reviews": [
      {
        "author": { "name": "Sergeant_Tibbs", "id": "/user/ur11148131/" },
        "interestingVotes": { "down": 161, "up": 516 },
        "text": "Taking the festival circuit by storm since its Sundance premiere in January, Whiplash is starting to feel like the underdog that could go far with its crowd-pleasing intensity. On the surface, it's a gritty story about a brutal student-mentor relationship that oversteps boundaries. Underneath, it's a piercing examination of the psyche of unbridled ambition. Whiplash is a film that stops at nothing. As a result, it's the best film I've seen in years, and I say that without hesitation. This is a film that resonates on every single level and every moment counts. If writer/director Damien Chazelle was striving for greatness as much as his protagonist, then he has achieved it. \n\nMiles Teller, who's been steadily growing on me since The Spectacular Now, stars as Andrew Neyman, a 19-year-old aspiring jazz drummer who's pushed and inspired by the abuse and aspirations of his school band leader Fletcher, played by the ferocious J.K. Simmons like we've never seen him before. Chazelle has described the film as an origin story to the jazz musicians of the golden age, and it thrives on the myths of jazz heroes such as Charlie Parker. They're urgently looking for the next Parker, in search of perfection. But with that comes a great irony. The music genre is known as one for freedom of expression but here the jazz is soulless and mechanical, and that clouds the ethical judgment of the characters. Even so, Fletcher is a man who can tell if you have the right tempo within a bar. Although most of the audience for the film may not know much about music including myself, you get a feel for what he's looking for and when someone's wrong even if you don't know why. Simmons is as good as they say he is. He's a force of nature, with a terrifying presence that incites the fear Bryan Cranston achieved with the peak of his Walter White. But it's not a one-note performance. Simmons is still subversive with moments of weakness, insecurity, approachability, and he also sometimes brings in the lightness he's known for in other roles with Jason Reitman, exec producer here. \n\nEven though he's an unlikeable character with nothing nice to say, he's still somewhat endearing and enigmatic, much like R. Lee Ermey's drill sergeant in Full Metal Jacket. This demasculinisation through a barrage of insults is a theme explored in Whiplash and it argues whether it's a crime or an 'ends justifying the means' factor of life. It's not just a music film, but also one that adapts to the elements of sports training, war at boot camp and biopic genres with the way it frames its elements. Fletcher is representative of the devil on our shoulders that yells at us that we're not good enough and that symbolic idea resonates deeply for me. His poisonous words are more a part of Andrew's psyche than legitimate coaching techniques. What grabs me about the film is its discussion on artistic perfection, and especially in these intimate and rough sequences of practicing. What is objectively great in art? When is it good enough, and why? It toes a fascinating line. That's why drumming is such an interesting choice for the film to explore because it's so instinctive. Drummers have to make decisions within a fraction of a second and talent can only take you so far. The roaring beat in Whiplash puts your heart in your throat. Teller's performance as Andrew is terrific, one to match Simmons. \n\nChazelle is committed on expressing the physicality of drumming and Teller captures it exhaustively without feeling contrived. It's the virtuosity of the writing that allows us into Andrew's head however. It's a long road to the top, but the script makes the right decision to allow him to revel in the little moments of success, but then to immediately test him in surprising and involving ways. Each turn of the story shapes his expectations and ambitions and then escalates it to the right point. While the film is a gripping experience nonetheless, in retrospect perhaps it is too bitingly cynical. It does suggest that you have to be deprived of a meaningful relationship to achieve your goals. It does appear to be very anti-positive reinforcement, but perhaps it's merely a statement on the abundant sheltering that the latest generation is enduring. Whiplash is refreshing to see, we all know we wouldn't be resilient enough to take that kind of punishment so it's cathartic to watch Andrew go through it all and see how far he'll go. His frustration, regrets, fear and rage with himself cuts to the core of the human condition as he's pushed further and further. \n\nThe technical aspects of the film help it become so stimulating with dizzying closeups tightly edited together and its the stark orange tinted cinematography. It's thoroughly impressive that the film was shot in only 19 days for them to get shots so immaculately timed and performed with all those complicated movements. There's a refreshing brevity to the film with its sharp atmosphere, but it's so rich in emotion, psychological tension and personal subtext. It neither rushes nor drags, on paper nor on screen. It really is a film that lingers in your mind for days, nagging you, like Fletcher over your shoulder. Maybe it'll continue to linger for weeks. I hope so too, especially for Oscar voters. It seems that J.K. Simmons is building momentum to be a lock for Best Supporting Actor at this point. However, Whiplash isn't just a best of year film, nor best of decade. It approaches best of all-time worthy with its identifiable themes of meticulous work ethics, fulfilling aspirations, resilience of the soul, and knowing when to no longer measure yourself to your mentor. I'll take this film with me for a while as a screaming motivator.\n\n10/10. Best film of the decade.\n\nRead more @ The Awards Circuit (http://www.awardscircuit.com/)",
        "title": "An important hardened lesson in resilience and when to stop measuring up to your mentor. Whiplash is a captivating study of ambition.",
        "date": "2014-10-23"
      },
      {
        "author": { "name": "cinemalover456", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie was a true masterpiece. The direction was flawless and the acting was superb. A must-see for any cinema lover!",
        "title": "True masterpiece",
        "date": "2020-01-05"
      },
      {
        "author": { "name": "filmfan987", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 9 },
        "text": "I was completely absorbed in this movie. The story was so well-crafted and the acting was excellent. Highly recommend!",
        "title": "Absorbing",
        "date": "2020-03-03"
      }
    ]
  },
  {
    "id": "tt0034583",
    "reviews": [
      {
        "author": { "name": "Jaymay", "id": "/user/ur0401212/" },
        "interestingVotes": { "down": 62, "up": 1007 },
        "text": "There are literally hundreds of comments about this movie on IMDB.  Many of them exhort its greatness.  I don't disagree with them.\n\nBut I'd like to add a suggestion to those of you out there who haven't seen this film.  I'd like to tell you HOW to watch it.\n\nThe people who made this movie didn't think they were producing a masterpiece. Bergman left the shoot disgusted.  The screenwriters were on salary for Warners, writing half a dozen movies a year, and this was just one more.  Bogie was punching the clock in the middle of a workhorse career.\n\nSo as an audience member, you can't sit down expecting gilded greatness.\n\nDon't have a Casablaca party.  Don't watch it on your first date, hoping it will lend that \"Romantic Touch.\"  Don't watch it as part of your \"I need to watch the Best 10 movies of all time\" Film School project.\n\nBuy this movie on DVD.  Have it at the ready.  And then, one Friday night, when your plans fall through and you find it's 10:30pm and there's nothing on TV that's any good, open a six pack of beer, or pour yourself some wine, and watch this movie in a darkened room.\n\nThe characters in Casablanca are absolutely devoid of sentimentalism.  Every one of them sees the world without a hint of rose color in their lenses.  As Rick says, \"Three little people don't amount to a hill of beans in this big old world.\"  If you're in a mood where you understand what he's saying, watch this movie and it will transport you.\n\nThere is no single movie that deserves to be called the best movie of all time.  Because movies, when all is said and done, don't amount to a hill of beans.  They are meant to entertain us, not for us to worship THEM.\n\nBut no movie has ever known this fact like Casablanca.\n\n If you watch Casablance this way, with no expectations, with no \"hype,\" you might catch 10 percent of its greatness on one viewing.  And that will be enough to start you on your way.\n\nHappy viewing, kid.",
        "title": "HOW TO WATCH THIS MOVIE",
        "date": "2003-08-23"
      },
      {
        "author": { "name": "moviegeek234", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was an absolute masterpiece. The cinematography was stunning and the story was so powerful. A must-see for any film lover!",
        "title": "Absolute masterpiece",
        "date": "2020-02-15"
      },
      {
        "author": { "name": "cinemajunkie789", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I loved everything about this movie. The story was so well-written and the acting was superb. Highly recommend!",
        "title": "Loved everything",
        "date": "2020-01-28"
      }
    ]
  },
  {
    "id": "tt0056058",
    "reviews": [
      {
        "author": { "name": "OttoVonB", "id": "/user/ur1559834/" },
        "interestingVotes": { "down": 9, "up": 51 },
        "text": "Having seen this film the mind becomes clouded with the innumerable things to say about it. Only praise comes to mind. Kobayashi has crafted The great samurai film for the rebel generation and he mixes a deftly handled criticism of authoritarian hypocrisy with a very touching piece of human drama.\n\nThe plot is deceptively simple: an old samurai (touchingly portrayed by Tatsuya Nakadai of \"Ran\", \"Kagemusha\" and \"Sword of Doom\") arrives at a clan castle to commit seppuku in their yard, and then tells his tale, seemingly trying to gain time at first. What seems to be the rambling of an old man soon turns out to be a grieving account of how this man (and, more significantly, his loved ones) was wronged by the clan. Then comes the violent revenge (this is where you think \"Wild Bunch with katanas\", though they do up the ante toward the end with guns...).\n\nKobayashi's direction is masterful, keeping an unbearable suspense during the mostly talky film, handling the touching scenes with care and maturity and giving us a sweeping fight to top all that. The 133 minutes running time never feels half that long! At the heart of it all though, is Nakadai, who, despite an excellent CV, delivers his greatest performance ever. His Tsugumo evokes a wounded panther, grieving an grieving until it gives in to fury. Nakadai's performance alone marks the film as essential viewing.\n\nIf you're open to samurai flicks, this will rank among the finest films you've ever seen.",
        "title": "Does to the Samurai genre what Wild Bunch did to the Western!",
        "date": "2005-10-07"
      },
      {
        "author": { "name": "moviebuff234", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie was a true cinematic achievement. The direction was flawless and the story was so compelling. A must-see for any movie lover!",
        "title": "Cinematic achievement",
        "date": "2020-01-07"
      },
      {
        "author": { "name": "filmlover789", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 9 },
        "text": "I was completely engrossed in this movie. The story was so compelling and the acting was excellent. Highly recommend!",
        "title": "Engrossing",
        "date": "2020-03-06"
      }
    ]
  },
  {
    "id": "tt1675434",
    "reviews": [
      {
        "author": { "name": "OttoVonB", "id": "/user/ur1559834/" },
        "interestingVotes": { "down": 58, "up": 955 },
        "text": "Do not look at this through the prism of \"Foreign Films\". You'd be wasting your time and miss something far too important.\n\nHollywood does scale like nobody else, leaving the competition gasping in its wake. France does intimacy, and brutality. Nothing is sacred. And rather than try to revive the New Wave or emulate Hollywood like most widely seen French films of late, \"Intouchables\" harnesses its core strengths - ease with intimacy, willingness to ridicule anything and brutal honesty - and delivers one of the funniest, most honest and touching films I have ever seen.\n\nSy is a failed robber, going through the motions and playing the stereotypical jobless émigré. Cluzet is a romantic and melancholy mind trapped in a useless body. The circumstances that bring them together are too funny to spoil here, but meet they do, and an awkward relationship quickly blossoms as they bring out the best in each other.\n\nThe film's simplicity is delightfully misleading: the script is a masterpiece of comedy writing, and however good the rest of the cast is, the central duo is magical. Sy's comic timing will have you in stitches, but it is his honesty and vulnerability that make you fall in love with the character. Cluzet isn't your typical sad-sack, instead, much of the finest pleasures in the film consist in watching him use his keen mind to mess with the world around him (a subplot about an abstract painting really takes the biscuit, you'll know it when you see it).\n\nThis is one of the most unique, beautiful and honest friendships ever committed to film. It will make you laugh, it will make you cry... a delightful celebration of everything in life that makes it worthwhile.",
        "title": "One of the Most Unique and Beautiful Friendships ever Committed to Film",
        "date": "2011-11-27"
      },
      {
        "author": { "name": "moviemaniac234", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a true masterpiece. The story was so well-crafted and the acting was superb. A must-see for any cinephile!",
        "title": "True masterpiece",
        "date": "2020-02-23"
      },
      {
        "author": { "name": "moviegeek789", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I was completely mesmerized by this movie. The story was so powerful and the acting was excellent. Highly recommend!",
        "title": "Mesmerizing",
        "date": "2020-01-30"
      }
    ]
  },
  {
    "id": "tt0095327",
    "reviews": [
      {
        "author": { "name": "Teebs2", "id": "/user/ur1285432/" },
        "interestingVotes": { "down": 9, "up": 147 },
        "text": "This film proves without any doubt that animation isn't just suited to tales of fantasy, sci-fi or cartoon comedy and violence. This absolutely heartbreaking Japanese anime tells the story of a young boy, Seito and his younger sister, Setsuko, as they attempt to survive the American bombings on Japan in the last year of World War II.\n\nThe story itself, based on a true story, is powerful enough but the decision to animate the film truly elevates this film to a higher level. This would have been a powerful enough live action drama, along the lines of Spielberg's Empire of the Sun or even Schindler's List. However, the Studio Ghibli team, have brought an extraordinary amount of life to all the characters, but especially the young siblings. Now we're not talking realism as such here - the characters are in no way photo-realistic, they do have the usual characteristics of Japanese anime humans, large eyes and exaggerated expressions. What this achieves however is a heightened level of subtle nuances in expression which are arguably more powerful and provocative than anything a real-life actor may achieve. Some may claim this is overly manipulative or sentimental, but coupled with the characters movements and actions, it gives the characters such a strong, and very human, presence. You truly care for these kids, which is an astonishing achievement. The voice cast (original Japanese) contributes significantly here also.\n\nIt is the tiny moments which give this film so much power and emotional depth - from subtle expressions to brief scenes showing Seito playing with his sister at bath time, attempting, unsuccessfully, to cheer her up when she misses her mother. The painted backgrounds are works of art in themselves, just beautiful. And of course the scenes with the fireflies bring a touch of pure magic - a heightened innocent reality to contrast the horrific realities of the war.\n\nThe greatest achievement of this film is that, apart from a couple of obviously sentimental scenes, such as Setsuko's sobbing or illness, it doesn't force any false emotion on the viewer. It really comes from your involvement with the characters. It's completely honest to it's own story and even cuts off scenes abruptly, which could potentially have been milked for cheap sentiment. It often seems to say - This is what happened, you don't need to see anymore. Another of it's strengths is that it really doesn't comment on the politics of the war in any way, just the effects on innocent people.\n\nThis is an intensely moving film and a masterpiece of animation. If you aren't moved by these characters, you really need to check your pulse. 10/10",
        "title": "Heartbreaking...",
        "date": "2006-01-03"
      },
      {
        "author": { "name": "cinemajunkie234", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie was a true tour de force. The direction was excellent and the acting was superb. A must-see for any cinephile!",
        "title": "Tour de force",
        "date": "2020-01-09"
      },
      {
        "author": { "name": "moviebuff456", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 9 },
        "text": "I was on the edge of my seat the whole time during this movie. The suspense was intense and the ending was so satisfying. Highly recommend!",
        "title": "Intense suspense",
        "date": "2020-03-10"
      }
    ]
  },
  {
    "id": "tt0027977",
    "reviews": [
      {
        "author": { "name": "razwee", "id": "/user/ur2244176/" },
        "interestingVotes": { "down": 67, "up": 185 },
        "text": "Charlie Chaplin's Modern Times (1936) is the final film to feature the great actor/director/writer's most easily recognizable incarnation: The Tramp. Here is a character that is so ingrained in the collective conscious of modern film audiences that many recognize him despite the fact that they have not seen a single Chaplin film. Indeed, several iconographic studies have labeled The Tramp (with his worn hat, distinctive mustache, dusty suit, cane, and trademark waddle) as the single most identifiable fictional image in history.\n\nStill, the film that perhaps most influenced the creation and thematic realization of Modern Times was not even a silent one. The Jazz Singer, which debuted in 1927, five years before Modern Times began production, is perhaps the most important watershed film in the industry's century-old history. In the film, comic great Al Jolson stands up in front of the audience and...sings. And as Millard Mitchell said in Singin' in the Rain, the public was suddenly in a frenzy for \"Talking pictures! Talking pictures!\" Sadly, with the advent of synchronized sound and dialogue, the world of silent filmmaking began to slip into obscurity with audiences and studios now viewing it as obsolete and undesirable. Nevertheless, Chaplin continued his passion for the subtle craft by creating City Lights (1931), which many critics and academics consider one of the greatest films ever made, but by the time Modern Times was released, Chaplin was one of the last directors left clinging to a dying art.\n\nModern Times is not an entirely silent film, (there are dialogue snippets and sound effects), but if you look closely, every character with dialogue (excluding Chaplin himself) is being mocked. Even when The Tramp opens his mouth (the only time he ever did so in a film), the words are nonsensical, defying the burgeoning convention that dialogue is mandatory for substance, entertainment, and quality.\n\nDespite the film's status as one of the greatest comedies of all-time, it is hard to ignore the political component. In his movies, Chaplin often exhibited a great mistrust for authority and progress, as often embodied through the social elite, the police, and wealthy entrepreneurs. The irony of the film's title, then, is two-fold. It connects with Chaplin's own bitter feelings regarding his moribund art form, but also refers to the plight of the working classes during the Great Depression (long working hours with little job security and meager salary, while the upper classes remain wealthy and bide their idle time) The world was changing fast, and Chaplin foresaw that many of these changes were far from beneficial.\n\nAs we watch The Tramp struggle through the modern, mechanized world, we laugh at his antics and the absurdity of their results, but we can also feel pain and pity. He is clearly a man who does not belong. Indeed, The Tramp can almost be thought of as a misfit who has passed through a membrane from some alternate reality and unwittingly fallen into our familiar world (notice that he does not have a name or identification of any kind, and as far as we know, he has no friends, family, funds, or history).\n\nHe takes on assembly lines, feeding machines, department stores, policemen and various other mass-oriented aspects of the industrialized world (all which demand and exhibit sameness and conformity), but The Tramp (and his symbolic extension, the individual) never seem to fit.\n\nThis is, consequently, why Modern Times is also one of the most poignant love stories ever put on film. The only character who is on the same level as The Tramp is a young, homeless woman who is referred to as \"The Gamin\" and is played by Chaplin's then-wife, Paulette Goddard. These two are brought together by the fact they have almost nothing except the will to live and continue forward, despite adversity. Both are nameless, neither has a home, and they each have no money or material possessions.\n\nIt is here that Chaplin makes his most poignant and saddening statement about modern living. The Tramp and The Gamin are the only characters who exhibit individuality and idealism, yet they are also the ones lowest on the social and economic food chain. The conclusion of the film, which most likely reflects upon Chaplin's own emotions, is tinged with sadness, but also a lingering hopefulness that resonates as loudly and clearly today as it did more than sixty years ago.\n\nThen there is, of course, the comedy, which is the stuff of legendary status. Some of the most memorable comic images in film history are found in Modern Times. These include The Tramp's bout with an assembly line (and his resulting twitches), his unfortunate encounter with \"nose-powder\", the moment when he quite literally becomes a cog in the wheels of industry, and his epic struggle to bring roast duck to an angry customer.\n\nIn my opinion, however, the two standout moments are the scene in a department store involving a blindfold and some rollerskates (the most exquisite moment of comedy in the film) and the sequence where The Tramp is submitted to the mad whim of an out-of-control feeding machine (the most uproarious moment in the film).\n\nThese are just a handful of moments that make Modern Times the enduring masterpiece that it is. On a personal level, the aspect of the film that resonates strongest with me is its appeal to the idealistic misfit in all of us. In our hearts, many of us long for the simplicity and exuberance with which The Tramp and The Gamin live life (with attention to the bare essentials and an absence of need for materialism and modern trappings).\n\nAs Chaplin so skillfully shows, however, our modern times make this lifestyle a faded dream, lost among the sheep-like herds of men and women scurrying through a modern metropolis that only Fritz Lang could make seem darker and more devoid of true humanity. Still, the final image of Modern Times refuses to let the film end on an exclusively tragic note and demonstrates that the individual is still alive and may yet find his way in an ever-changing world.",
        "title": "The Farewell Performance of The Tramp",
        "date": "2004-05-10"
      },
      {
        "author": { "name": "filmlover123", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a true masterpiece. The story was so powerful and the acting was excellent. A must-see for any cinema lover!",
        "title": "Masterpiece",
        "date": "2020-02-17"
      },
      {
        "author": { "name": "moviemaniac789", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I was completely blown away by this movie. The pacing was perfect and the acting was superb. Definitely one of the best movies of the year!",
        "title": "Blown away",
        "date": "2020-02-01"
      }
    ]
  },
  {
    "id": "tt0047396",
    "reviews": [
      {
        "author": { "name": "michaelRokeefe", "id": "/user/ur0449021/" },
        "interestingVotes": { "down": 28, "up": 67 },
        "text": "In '54, I was seven years old and this is one of the first 'grown up' movies I remember seeing. I have seen it at least ten times since and realize seeing something different each time.\n\nJames Stewart is a photographer in a wheelchair recovering from an accident. He passes the time by watching his neighbors out his apartment window. He thinks that he witnessed a murder and has trouble convincing his girlfriend, Grace Kelly, to help prove a crime was committed.\n\nThree scenes that always stuck with me:(1) Stewart fighting off his attacker with flashbulbs (2) the smoldering kiss (3) the glowing cigarette in the dark apartment.\n\nEvery bit a classic. I think this is THE BEST Hitchcock movie. No offense intended toward PSYCHO, but this movie has the more human aspects of fear and terror. This super cast includes Raymond Burr, Thelma Ritter and Wendell Corey.",
        "title": "Tremendous thriller. Classic Hitchcock.",
        "date": "2000-06-18"
      },
      {
        "author": { "name": "cinemalover456", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie was a true gem. The story was so well-crafted and the acting was excellent. A must-see for any film lover!",
        "title": "True gem",
        "date": "2020-01-11"
      },
      {
        "author": { "name": "filmfan987", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 9 },
        "text": "I was completely absorbed in this movie. The story was so well-written and the acting was superb. Highly recommend!",
        "title": "Absorbing",
        "date": "2020-03-05"
      }
    ]
  },
  {
    "id": "tt0064116",
    "reviews": [
      {
        "author": { "name": "Sadako-Toyboy", "id": "/user/ur0395650/" },
        "interestingVotes": { "down": 95, "up": 337 },
        "text": "Thank god that I'm a Bronson fan. This was my first Leone movie, and dumb kid that I was, I actually watched it thinking I was in for a  typical Bronson \"vehicle\"! Looking back I'm thankful, because if it wasn't for his involvement, I would never have discovered the beauty and majesty that is Once Upon a Time in the West.\n\nI absolutely love this movie. It's probably my all time favourite, certainly one of the few that I can watch OVER and OVER again without losing interest. I love the way Leone creates intrigue and mystery around what is a relatively thin plot. He can make even the smallest twist of fate seem like an epic turn of events, with that amazing sense of revelation that he generates out of old hackneyed situations (something Argento has since picked up). Leone proves in this film that he could seemingly take anyone, even peripheral characters, and give them screen charisma without using dialogue as a crutch.\n\nOUATITW features the most tense two man stand-offs ever, with some serious deja-vu in the direction of his \"Dollars\" trilogy. In fact, it does feel like those three movies were warm ups,  practice sessions in the build up to OUATITW. Here though, he perfected everything; despite the long running time, it's all focused, and without a single irrelevant scene. For me, the two hours plus just fly by, I wish it would never end. Leone was without question at his artistic peak when he made this, that's not to say that he went downhill from then on, but I honestly don't think he ever did another film where everything came together so perfectly.\n\nThe cast is flawless. Fonda eclipsed every good guy he ever did in one fell swoop, truly chilling. Robards is a great comic character, the lovable rogue with an edge. And Cardinale is more than just (incredible) window dressing; she switches between passionate, angry, delicate and sentimental at all the right moments.\n\nWhich leaves the hero; I'm a huge Eastwood fan, but I honestly don't believe he could have done the role justice. His \"man with no name\" was a cool, sly character with hidden complexities. Eastwood always does these layered personalities, with some kind of mental baggage. Bronson, on the other hand, mostly does himself; simple, uncomplicated figures with only one state of mind, that's why he's put in so many revenge flicks. Plus, he looks like he's been seriously wronged at some point in his life, Eastwood doesn't have that quality. Bronson is the genuine hard-as-nails article. You can readily imagine that, had he been born decades earlier and been put in the same situation, he would resolve the problem in much the same way as his character in the movie (sometimes I affectionately refer to this movie as Deathwish part 0- could Harmonica be the great granddaddy of Paul Kersey?).\n\nOf course the other great contribution is the music. I still think that the main theme is one of the most breathtaking pieces of music I have ever heard. It affects me deeply whenever I hear it, regardless of the mood I'm in. Maybe I should listen to more opera or something, I don't know, but that's the way I feel. And the individual character themes are just so well integrated into the film, it's unbelievable. Leone replaces words with music, and it conveys so much more in return. Bronson just plays that melancholy tune on the harmonica instead of answering people back, it consistently cracks me up.\n\nHigh Noon, Naked Spur, Shane, The Searchers, etc. are all classics of the genre, but I really  don't think it's possible to compare those \"traditional\" westerns with OUATITW. For me, it exists on a plane of it's own, it's the kind of film experience that you let wash over you, a waking dream. I recommend this movie to anyone, if you're on the right wavelength you'll be greatly rewarded.",
        "title": "pure cinematic paradise",
        "date": "1999-07-26"
      },
      {
        "author": { "name": "moviegeek234", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a true cinematic experience. The direction was excellent and the story was so well-crafted. A must-see for any moviegoer!",
        "title": "Cinematic experience",
        "date": "2020-02-19"
      },
      {
        "author": { "name": "cinemajunkie789", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I was blown away by this movie. The cinematography was stunning and the acting was superb. Highly recommend!",
        "title": "Stunning cinematography",
        "date": "2020-02-03"
      }
    ]
  },
  {
    "id": "tt0078748",
    "reviews": [
      {
        "author": { "name": "chrishn", "id": "/user/ur4172848/" },
        "interestingVotes": { "down": 97, "up": 375 },
        "text": "In \"Alien\" we follow a seven man crew en-route to earth on board the huge space freighter \"Nostromo\". The crew is in cryosleep, but the on board computer interrupts the journey when a foreign radio signal is picked up. It originates from an uninhabited planet and the crew lands to investigate. There they make contact with an alien life-form...\n\nWhat makes Alien so great is the constant feel of uneasiness. Right from the beginning you have a feeling that something is wrong. The crew is not particularly friendly towards each other, and you truly feel all the in-group tension. The ship itself is a huge worn out industrial-style maze of halls and corridors, and it feels more like a prison than a place to live. It is as if not only the alien but also the ship itself is against the humans. The Alien itself is the scariest monster in history because it is a ruthless, soul-less parasite completely devoid of any human or civilized traits. The design of the monster is a stroke of genius. Sure it has a humanoid form, but it has no facial traits or anything else which could give away emotions or intentions. Its actions reveals no weaknesses nor civilized intelligence. The Alien is more or less the opposite of everything human and civilized, plus the creature is more well-adapted to the inhumane interior of the ship than the humans who build it. To sum up, you then have a setting where the humans are caught in a web of in-group tensions, an inhospitable ship and the perfect killer which thrives in the ships intestines. You almost get the feel that the humans are the ones who are alienated to each other and to their own ship.\n\nRidley Scott tells the story with a perfectly synchronized blend of visuals and sounds. \n\nThe actors do a superb job, portraying their characters in a subtle but very realistic way. The seven man crew is not a bunch of Hollywood heroes. They are ordinary people with strengths and weaknesses, likes and dislikes. In this way they all seem so fragile when confronted with the enemy. \n\nAs mentioned the ship is very claustrophobic and Ridley Scott adds to the eeriness by using camera movement, lights and shadows in an effective way. The living quarters are bright and should be comfortable to the crew, but there is something sterile about it all. The rest of the ship is basically a huge basement. \n\nThe music by Jerry Goldsmith underlines the eeriness so well, and the movie wouldn't have worked without his score. Combined with the sounds of the ship it all adds to the uneasiness. \n\nThis is not a story about heroic people who boldly teams up against evil. It's a story about ordinary people facing true fear, which is the fear without a face. The fear we can't understand and can't negotiate with, because its only goal is to survive on the expense of us. It's a story where some people bravely fight back whilst others are destroyed by the terror. It's a story where people a killed in a completely random way. There is no higher-order justice behind who gets to live and who dies. All seven characters are just part of a race where the fittest - not necessarily the most righteous - will prevail, and all seven characters start the race on an equal footing. None of them are true heroes, and none of them are true villains. \n\nAll the above makes Alien so great as a horror movie. The terror isn't just the Alien itself, it's the entire atmosphere which gets so effectively under your skin, that you just can't shrug it off after the end credits like you can with so many other Hollywood horror movies. The title \"Alien\" doesn't just refer to the monster, it is the theme of the movie and it is the feeling you have during and after the movie. 9/10",
        "title": "\"Alien\" is not just the monster, it's the atmosphere and the way you feel!",
        "date": "2005-02-06"
      },
      {
        "author": { "name": "moviebuff234", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie was a true masterpiece. The direction was flawless and the story was so compelling. A must-see for any cinema lover!",
        "title": "True masterpiece",
        "date": "2020-01-13"
      },
      {
        "author": { "name": "filmlover789", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 9 },
        "text": "I was completely captivated by this movie. The story was so well-crafted and the acting was superb. Highly recommend!",
        "title": "Captivating",
        "date": "2020-03-08"
      }
    ]
  },
  {
    "id": "tt0021749",
    "reviews": [
      {
        "author": { "name": "Nazi_Fighter_David", "id": "/user/ur0176092/" },
        "interestingVotes": { "down": 15, "up": 77 },
        "text": "Once again Chaplin plays his famous creation, the beloved Tramp The noble Little Fellow meets and falls in love with a blind flower girl She assumes he is wealthy man and offers him a flower, which he attentively accepts with his last penny \n\nOne night by chance he rescues a drunken millionaire from drowning The rich gentleman becomes a generous friend when drunk but doesn't recognize the tramp when sober Chaplin takes the blind girl under his wing, and takes flight with the millionaire's money to cure her blindness \n\n\"City Lights\" engaged a true genius in a graceful and touching performance which arouses profound feelings and joy with great simplicity of style and tragic tale Each scene was the result of hard-working detail and planning",
        "title": "A one-man virtuoso performance",
        "date": "2008-04-19"
      },
      {
        "author": { "name": "moviemaniac234", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a true work of art. The cinematography was stunning and the story was so powerful. A must-see for any art lover!",
        "title": "Work of art",
        "date": "2020-02-25"
      },
      {
        "author": { "name": "cinemalover789", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I was completely enthralled by this movie. The story was so captivating and the acting was superb. Highly recommend!",
        "title": "Enthralling",
        "date": "2020-02-08"
      }
    ]
  },
  {
    "id": "tt0095765",
    "reviews": [
      {
        "author": { "name": "caspian1978", "id": "/user/ur0826090/" },
        "interestingVotes": { "down": 41, "up": 173 },
        "text": "Giuseppe Tornatore's Nuovo cinema Paradiso (Cinema Paradiso) is everything good about the movies. It is a story about love. The love between a Father and Son, an Individual and his home, and the love for the movies. Even if this is not your favorite film, if you are a filmmaker, you have no choice but to say this is your all time favorite film (if not one of the greatest films ever made). If only for the movie's ending, this is a great film. The ending answers all of your questions and completes the story. The missing love from a Man's life. The missing pieces to all the stories (movies) found and made into a whole. The final message from beyond the grave, the ending is perfect. If the musical score doesn't put you in tears, the amazing visuals will push you over the edge. This is what all movies should be about. Terrific.",
        "title": "Every Filmmaker's Favorite Film",
        "date": "2005-02-12"
      },
      {
        "author": { "name": "filmfan456", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie was a tour de force. The direction was excellent and the acting was top-notch. A must-see for any cinephile!",
        "title": "Tour de force",
        "date": "2020-01-17"
      },
      {
        "author": { "name": "moviegeek789", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 9 },
        "text": "I was on the edge of my seat the whole time during this movie. The suspense was intense and the acting was superb. Highly recommend!",
        "title": "Intense suspense",
        "date": "2020-03-12"
      }
    ]
  },
  {
    "id": "tt0078788",
    "reviews": [
      {
        "author": { "name": "jande9", "id": "/user/ur4571312/" },
        "interestingVotes": { "down": 75, "up": 177 },
        "text": "This movie changed the art of film making, telling a complex story in a powerful new way. The film mixes brutal realism with fantasy, intercutting a modern war with strange scenes full of technicolour smoke. The film uses music not as a score laid in later, but as a practical part of the scene playing from speakers, radios etc. Coppola uses a classic piece of literature as inspiration, taking scenes and characters, and putting them into entirely different surroundings. That is a tricky and brave thing to do. Then he takes a superstar, Brando, pays him a fortune, and films him so that you can barely see his face. The pure guts that such a move requires is astounding, and it works beautifully. This movie belongs in the top ten.",
        "title": "One of the best and most important movies ever",
        "date": "2005-01-12"
      },
      {
        "author": { "name": "cinemajunkie234", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a thrill ride from start to finish. The pacing was perfect and the story was so compelling. Definitely one of my favorites!",
        "title": "Thrill ride",
        "date": "2020-02-21"
      },
      {
        "author": { "name": "moviebuff456", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I was completely engrossed in this movie. The story was so well-written and the acting was superb. Highly recommend!",
        "title": "Engrossing",
        "date": "2020-02-05"
      }
    ]
  },
  {
    "id": "tt0209144",
    "reviews": [
      {
        "author": { "name": "Old Joe", "id": "/user/ur0849886/" },
        "interestingVotes": { "down": 29, "up": 182 },
        "text": "Losing your memory would have to go close to one of the worst experience anyone could ever suffer from. In the movie Memento', we get to see how bad it is to suffer from short term memory loss. It also gives us the chance to see how far a patient of such a disease will go to remember what is most important to him. In the vain of Pulp Fiction', Memento is a movie that has to be seen to be believed. It is no wonder that this movie is so popular with the movie going public around the world. \n\nLeonard Shelby wears expensive, tailored suits, drives a late model Jaguar sedan, but lives in cheap, anonymous motels, paying his way with thick wads of cash. Although he looks like a successful businessman, his only work is the pursuit of vengeance: tracking and punishing the man who raped and murdered his wife. The difficulty of locating his wife's killer is compounded by the fact that Leonard suffers from a rare, untreatable form of amnesia'. Although he can recall details of life before his accident' Leonard cannot remember what happened fifteen minutes ago, where he is, where he is going, or why.\n\nChristopher Nolan has made one great (but confusing) movie. His style in directing and editing Memento' is quite unique, as no movie has ever been made quite like it before. The story being told in a backward kind of motion makes the audience have to think hard about what they are watching. It also makes the audience feel for a guy like Leonard, whose condition only gets worse and worse as the movie goes on. I am almost 100% sure that Nolan and his brother Jonathan, made up this story in the realisation that it was meant to be confusing. What is also cleverly done by Nolan is the use of black and white and then colour shots. In my opinion, the variations in these shots are used so it confuses the audience even more. \n\n Guy Pearce's role in Memento' shows me why he is so successful in Hollywood today. Pearce plays Leonard Shelby, a man on the hunt for his wife's killer. The only problem is that Shelby is suffering from anterior-grade amnesia', a disease that cannot be treated. With Lenny', I feel the audience suffers partly the same condition as he does, and partly does not, as we can remember what has happened in the present. \n\nMemento's other main stars include corrupt cop Teddy' (Joe Pantoliano). A friend said of Pantoliano's performance in Memento, he was perfect for the role of Teddy', as he comes across as the mysterious bad guy'. I could not agree more. There is also the character of Natalie (Carrie-Anne Moss) who is a lot like Teddy in her own way. What is similar about these characters is the way they use Leonard's condition to advantage their own situations.\n\n Other characters include Sammy Jenkis (Stephen Tobolowsky), who is a victim we learn about from an old case when Leonard Shelby was an insurance investigator. There is Leonard's wife, Catherine (C.S.I.'s Jorja Fox) who is another fascinating character. Although we do not hear her say much, she is a vital part of this most confusing story. Add in the funny role of Burt (Mark Boone Jnr.), the motel clerk, who openly admits to Lenny that he is ripping him off, by giving him two rooms, but that he will not remember it happening anyway.\n\nYet in no way do any of the characters in Memento' realise they are in a time reversed movie. I am sure that many of the performers would have had to read their scripts many times to understand what was happening from a cinematic point of view. But from an acting prospective, this would have been an easy experience to be part of. Memento also has some interesting devices to tell the story. The way Leonard tries to remember things in the present and the future, via notes tattoos and photographs, making them an important element within the movie. Without them, our hero would not be able to remember anything. \n\nNonetheless, memory is the most vital element in this movie, because without it, people are confused, isolated and abused, which is what happens to our hero', Leonard.  As Lenny mentions early on in the film, \"Memory's unreliable ... Memory's not perfect. It's not even that good. Ask the police; eyewitness testimony is unreliable ... Memory can change the shape of a room or the colour of a car. It's an interpretation, not a record. Memories can be changed or distorted, and they're irrelevant if you have the facts.\"  But it has to be ironic that Leonard is the one who narrates Memento', when his recollections and memories of events are inaccurate and jaded. There are also some powerful scenes in Memento'. The one which sticks in my mind the most' has to be where Natalie abuses Leonard, calling his dead wife a whore', snorting smartly that you won't be even able to remember what I have said'.  \n\nSo, if you watch this movie and it confuses you the first or even the second time, I can assure you that is how you are meant to feel, confused. If you hated watching Memento' the way Christopher Nolan intended, then I can only recommend that you get a hold of the DVD and watch it in chronological order, as it will really help you. Memento also shows how bad mental disease' patients can be abused by healthy people and what lengths sick patients will go to try and keep sane'. Also, if a movie makes you think, then in some way it has been successful in doing something that many movies do not do  making you think. Those sorts of cinematic experiences are the ones that we need to cherish for life, as they are few and far between. Memento is one such experience. \n\nCMRS gives Memento': 5 (Brilliant Movie)",
        "title": "Some memories are best forgotten. You have to appreciate how original a movie Memento' really is!",
        "date": "2003-02-06"
      },
      {
        "author": { "name": "filmlover123", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie was a masterpiece. The direction was flawless and the acting was top-notch. A must-see for any moviegoer!",
        "title": "Masterpiece",
        "date": "2020-01-15"
      },
      {
        "author": { "name": "moviemaniac789", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 9 },
        "text": "I was completely blown away by this movie. The acting was superb and the story was so compelling. Definitely one of the best movies of the year!",
        "title": "Blown away",
        "date": "2020-02-28"
      }
    ]
  },
  {
    "id": "tt0082971",
    "reviews": [
      {
        "author": { "name": "CuriosityKilledShawn", "id": "/user/ur0102816/" },
        "interestingVotes": { "down": 65, "up": 135 },
        "text": "I've seen Raiders of the Lost Ark numerous times on TV, DVD and big screen. My local theatre had a special showing last night and the 400-seat screen completely sold out (as Indy films always do). Luckily for me and my pal, we got the last 2 tickets available! I can't think of many films that still sell-out 25 years after their original release. There's just something about Indy movies(iconic hero, affection, epic spectacle) that brings you back again and again.\n\nThe only trouble with that is there are zillions of reviews, critiques and dissections of this movie already out there, so what I have to offer will probably not be anything new. I will however not go the way of the cliché and mention 1930's serials, Tom Selleck or the sword/gun fight.\n\nI will, however, ask you one question. Did you know that some of the more iconic, memorable sequences from Raiders owe quite a lot to Duck Tales? What? Surely it's the other way around? Well, no. The globe-trotting adventures of Scrooge McDuck, Huey, Duey, Luey and Donald in Carl Bank's Disney comic-books from the 50s came first. If you can find some of these then you'll surely notice the similarities.\n\nThe hunt for the Ark of the Covenant is more than just an excuse for action. So many movies these days seem to come up with action first and string them together with some lame plot. Movies like this are quickly forgotten and one of the reasons Raiders holds up so well is because it works the Covenant story so well into the plot.\n\nThe action comes in a succession of set-pieces. I do enjoy films that have to increasingly better themselves in every scene. Raiders introduced this as a standard that the sequels had to live up to. My fave scene has to be the massive truck chase through Egypt, which is made up of many of its own smaller sequences. One little idiosyncrasy I like about Indy is that even though he's a College Professor and Doctor, he has no beef killing people. So very far from the ubiquitous PC heroes of todays movies.\n\nYou might think that it's rather geeky to hype up the editing and sound design, but they do stand out from recent action movies. The gunfire and punching seem to have a sort of 'Indy' signature sound to them, that I've not heard in any other films. And obviously, John William's classic score is one of those themes that just everybody in the world knows (though I prefer his score to Temple of Doom), truly one of the best movie themes ever. Better than Star Wars! \n\nI'm not sure if Spielberg planned on Raiders starting the Indy franchise but there's already enough in here to establish a whole universe of potential stories and character arcs. There's talk of a fourth movie at the moment, but I personally don't think it will happen and I don't want it to. It's perfect existing as a trilogy and a sequel that comes traipsing in 18 years after the last is just not going to feel right. Even if you are hungry for more Indy then there are loads of books and video games out there and then there's the Young Indiana Jones TV show (where are the DVDs?), which are official Indy canon and even starred Ford once (they bounced around in time).\n\nI am giving Raiders 9/10 because I just have a soft spot for Temple of Doom (which is obviously a 10/10 movie). Even 25 years after it first came out it still has the power to captivate the audience and provoke sheer excitement every time. And in 25 years it will still be far superior to almost everything.\n\nNow there's something you cannot say about The Fast and the Furious! Sigh, where did all the special movies go?",
        "title": "Will stand the test of time forever.",
        "date": "2006-09-26"
      },
      {
        "author": { "name": "cinemalover456", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie kept me on the edge of my seat the whole time. The suspense was palpable and the ending was so satisfying. Highly recommend!",
        "title": "On the edge of my seat",
        "date": "2020-01-31"
      },
      {
        "author": { "name": "filmfan987", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I was completely mesmerized by this movie. The story was captivating and the characters felt so real. Highly recommend!",
        "title": "Mesmerizing",
        "date": "2020-02-10"
      }
    ]
  },
  {
    "id": "tt1853728",
    "reviews": [
      {
        "author": { "name": "postolachivalentin", "id": "/user/ur131678901/" },
        "interestingVotes": { "down": 15, "up": 80 },
        "text": "Jango (D is silence) is just one of those movie you can watch every year and it never gets old.\n\nIt's also the origin of those Di Caprio memes you saw online, so you know is good.\n\nAlso Christoph Waltz stole the show here and made me discover all other his movies.",
        "title": "Best Tarantino movie and you can't change my mind",
        "date": "2021-04-25"
      },
      {
        "author": { "name": "moviegeek234", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie exceeded my expectations. The pacing was perfect and the acting was excellent. A must-see for any movie lover!",
        "title": "Exceeded expectations",
        "date": "2020-01-21"
      },
      {
        "author": { "name": "cinemajunkie789", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 9 },
        "text": "I was blown away by this movie. The cinematography was stunning and the story was so powerful. Definitely one of the best movies I've seen in a long time.",
        "title": "Blown away",
        "date": "2020-03-03"
      }
    ]
  },
  {
    "id": "tt0910970",
    "reviews": [
      {
        "author": { "name": "ametaphysicalshark", "id": "/user/ur11842025/" },
        "interestingVotes": { "down": 148, "up": 1018 },
        "text": "Who says popular films are not and cannot be art? If anything is proof that popular films can be of a stunningly high quality, the beauty of the animation, writing, music, and sound design in \"WALL·E\" is it. \"WALL·E\" eclipses even Andrew Stanton's \"Toy Story\" and \"Toy Story 2\" in the Pixar pantheon, is perhaps Pixar's best film to date and, call me crazy as I've just seen it, a contender for the title of best animated film, period.\n\n\"WALL·E\" is everything we've come to expect from Pixar and more- colorful, vibrant, imaginative, exciting, involving, beautiful, and most importantly a film with interesting, involving characters. Sure, WALL·E is adorable, and as much credit as the animators get for that, this film would be nothing without Stanton's screenplay, which features very little dialogue but is still notably intelligent and surprisingly subtle, making a refreshing change from the 'go green' campaigns we're all so used to. Does \"WALL·E\" have a message? Sure, but it's an important message and it is delivered subtly and beautifully.\n\n\"WALL·E\" operates on two levels (and works spectacularly well on both). It is a majestic science fiction epic like we haven't seen in a couple of decades and it is a genuinely touching and never cheap romance. \"WALL·E\" will never get points for originality but it doesn't exactly need them because the homages to great films and figures of the past- Chaplin, Keaton, Tati, the Marx Brothers, \"2001: A Space Odyssey\" (this one is particularly spectacular), \"Close Encounters of the Third Kind\" are actually homages and not ripoffs. \"WALL·E\" is a wonderful tribute to a bygone cinematic tradition (well, two or three of them actually). \n\nThe social commentary in \"WALL·E\" is sobering because it's never overbearing and most importantly because we see the world through machines, machines who feel more about Earth and life than the humans do. The depiction of humans on the ship could have been incredibly offensive, cheap, and tasteless in concept but the execution here is absolutely perfect.\n\nWhat is most surprising about \"WALL·E\" is how sad it is. Not even in the 'how will they get out of this, oh I feel so sorry for them' way \"Finding Nemo\", a previous Stanton effort, is, but in a truly melancholy sense. The early portion of the film maintains all the playfulness of a Jacques Tati film but also evokes a striking and powerful feeling of loneliness. It's a brilliant introduction to WALL·E, given that the rest of the film is too wacky to bother with long scenes focused entirely on character, and works beautifully with the ugly yet beautifully-rendered future Earth, a barren wasteland filled with nothing but garbage, a seriously resilient cockroach being WALL·E's only companion before EVE shows up, but I won't go into the story- it's best you see it unfold for yourself.\n\nFrom the entertaining shorts shown before the film to the memorable characters, locations, and animation we have come to expect, Pixar films are now event cinema, and they have outdone themselves with \"WALL·E\". This film is spectacular, majestic, touching, involving, and achingly beautiful. Most importantly, however, it is perfect entertainment. I may be saying this too soon, but I don't think I have ever seen an animated film that has satisfied me more than \"WALL·E\", and 2008 is going to have to work hard to keep this from being the top film of the year, which it most certainly is at the moment.\n\n9.5/10",
        "title": "Who says popular films can't be art? \"WALL·E\" is magical",
        "date": "2008-06-27"
      },
      {
        "author": { "name": "filmlover456", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a rollercoaster ride from start to finish. The acting was superb and the story was gripping. Definitely a must-see!",
        "title": "Rollercoaster ride",
        "date": "2020-02-15"
      },
      {
        "author": { "name": "moviebuff123", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I loved the plot of this movie. It was full of twists and turns that kept me guessing until the very end. Highly recommend!",
        "title": "Twists and turns",
        "date": "2019-12-11"
      }
    ]
  },
  {
    "id": "tt0405094",
    "reviews": [
      {
        "author": { "name": "Cloudmeister", "id": "/user/ur2756117/" },
        "interestingVotes": { "down": 8, "up": 70 },
        "text": "I am still quite speechless. Overwhelmed by how utterly compelling the story was and by how emotive the acting story was. Floored by the unbelievably great character development. This film is close to perfect. It is a spiritual cousin to 2004's magnificent Downfall and shares a lot of similarities with Paul Verhoeven's stunning Black Book from last year, not just because these films share two actors. This multi-faceted character driven masterpiece really is as good as it's hype says.\n\nSebastian Koch in particular absolutely shines. He is one of the best international actors working today and he follows the brilliance of his role in Black Book with the lead here. With his bohemian, dishevelled good looks and brilliant charisma, he's the best German-speaking actor since Bruno Ganz. But he is far from the only good actor in this movie, Ulrich Mühe as the State Security (Stasi) agent whose task it is to monitor Koch's suspiciously free thinking playwright, brings another near perfect performance to the movie. Agent Wiesler initially appears to the audience as the polar opposite of Koch's character. With his grey button down clothing, closely cropped hair and consistently emotionless face he symbolises everything about the overbearing untrusting Socialist government of East Germany that is wrong. He could easily have remained that character throughout the whole film but he becomes the surprising emotional centre of the story and the line between heroes and villains is significantly shifted (something which extends to the supporting cast as well. Truth be told there are probably only two characters in this film whom I didn't have to rethink my opinion of). Weisler reveals himself as a lonely, isolated man who risks his entire career as his attitude to his subject changes from one of mistrust to one of near-adoration. There is an undeniable link between the two characters even though they never share a single scene and Georg Dreyman (Koch) doesn't even find about Wiesler until the last 10 minutes of the movie, which leads us up to what should go down as one of the greatest endings in cinema history. Just thinking about the final spoken lines brings the tears to my eyes.\n\nAs I said, without a doubt one of the greatest movies I have ever seen. And as much as I adore Pan's Labyrinth, this one really did deserve it's Academy Award for Best Foreign Language Film of the Year. An absolute masterpiece.",
        "title": "Every positive word written about this movie is absolutely true",
        "date": "2007-04-17"
      },
      {
        "author": { "name": "romanticat", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "This movie had the perfect blend of romance and drama. It made me laugh, cry, and feel all the feels.",
        "title": "Perfect Blend",
        "date": "2020-01-25"
      },
      {
        "author": { "name": "comedyclub", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "I laughed so hard during this movie. The comedy was spot-on and had me in stitches the entire time.",
        "title": "Hilarious Comedy",
        "date": "2020-01-22"
      }
    ]
  },
  {
    "id": "tt0043014",
    "reviews": [
      {
        "author": { "name": "tostinati", "id": "/user/ur1243480/" },
        "interestingVotes": { "down": 26, "up": 85 },
        "text": "Every time I go to L.A., which isn't too often, I look at these palm-bemused, once smart stucco facades, and wonder if a Norma Desmond from a later era might be hiding from the world inside them, buttressed by cable TV (AMC or TCM, no doubt), a poodle named FiFi or Sir Francis, walk-in closets full of leopard-print Capri pants that haven't fit in decades, and a world class liquor cabinet that has seen heads of state under the table on a good night. It is because of Sunset Blvd., for certain, that my mind could ever go there. It is one of the most indelible films you will ever see.\n\nThis film is great for many reasons, not the least of which is because it is Hollywood's first look back at itself. In the milieu of this film, the silent era is only 22 years behind us. The people left behind by the rush to sound can still palpably TASTE the fame, the accolade, that particular past being not so very dim and distant. The sadness of their lives was real, and at that point in history, all around, if hidden. Way more has been made of the supposed \"savagery\" of this film vis a vis the faded star than I think exists now, or ever did. The often cynical Wilder is deeply in touch with the tragic here, as much as the grotesque.",
        "title": "Reel Life Gothic",
        "date": "2001-09-16"
      },
      {
        "author": { "name": "dramaqueen", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "The story in this movie was so captivating. I was hooked from the first scene and couldn't wait to see how it ended.",
        "title": "Captivating Story",
        "date": "2020-01-20"
      },
      {
        "author": { "name": "actionjunkie", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "This movie had some of the best action scenes I've ever seen. It was non-stop action from beginning to end.",
        "title": "Non-Stop Action",
        "date": "2020-01-18"
      }
    ]
  },
  {
    "id": "tt0050825",
    "reviews": [
      {
        "author": { "name": "danm99", "id": "/user/ur2229253/" },
        "interestingVotes": { "down": 49, "up": 168 },
        "text": "What to say that hasn't already been said. This astonishing cinematic work of art (no kidding) unquestionably is the GREATEST FILM EVER - bar none.  I deeply and passionately LOVE this brilliant early Kubrick production. Congratulations to expert screenwriters (and unique pulp writers of the 5O's) Calder Willingham (who also penned his own excellent adaptation of \"The Strange One\"; highly recommended) and Jim Thompson (\"The Grifters\" \"The Killer Inside Me\"; which strongly influenced Tarantino), who both present a superbly incisive script with powerfully effective dialogue that really rings more than true.  If only we had more real writers and scripts like this remarkable achievement, we'd be writing far more favorable reviews. \"Paths of Glory\", alone, would serve as anyone's lifetime achievement award.\n\n I don't care how much you HATE B&W films - put this one on your MUST-SEE. Compelling cinema-verite photography creates astounding visuals from a varity of incisive angles; like the famous mobile wide-angle tracking shot of Dax (probably Kirk Douglas's most stirring and important performance) moving through the squalid and horrifying trenches as the battle begins with explosions breaking out all over.  The suspense and tension is frightening, but almost beautifully eerie in the most compelling ways as Kubrick takes us through the deadly limbo of no-man's land - the 'paths of glory' which finally leads to the grave.  The action, skillfully combined with powerful moral and existential themes are amazingly conveyed through the bleak yet articulately stunning visuals.  THIS IS A FILMMAKER'S FILM!\n\n The moral outrage of the sadistic injustice of the military courtmartial never fails to make my blood fully boil.  The hypocrisy and corruption is degradingly infuriating.  If anything will make a cynic out of you, it's this appropriately pessimistic and depressing cinema chronical based on a true stupid incident in WWI.  What's even worse is how POG, in many perceptive ways, serves as an allegory for all the B.S. in real life: Pig-headed leadership in the parasitic hands of the superior greed freaks, two-faced deceptive manipulations, double-standards, backstabbings, social bigotry, arm-chair warriors, egotism, corrupt politics, the militaries's abuse of too much power - and it's destructive desire at satisfying it's lust for vainglory (sounds a little like Hollywood) - Did I leave anything out?  You name it, POG has it - and I'm not being sarcastic.\n\n The entire ensemble cast is superb with special mention to George Macready as the utterly pompous power-mad glory-seeking \"soldier\", General Mireuo (who thinks nothing about ordering his troops to open fire on his own men for not charging out of the trenches and dying for his \"country\"; which smells a bit like ME ME ME).  Don't worry, you'll throughly hate his guts. It truly is true method acting.  Again, kudos to Macready,  a fine actor who was always too good at playing highly unethical villians. (Incidently, this was a favorite film of a young 195O's Marlon Brando and old salty Winston Churchill, who praised Kubrick's incisive authenticity in the exciting battle scene, which does resemble news footage).\n\n Timothy Carey (also ultra-offbeat-cool in Kubrick's other exceptional early flick, \"The Killing\") is morbidly humorous and gut-wrenching as one of the poor fools coldly picked to be executed; all in the ruthless 'patriotic' name (and amoral game) of 'glory'. ARE ANY OF OUR LEADERS LISTENING?  Too bad that Carey's memorable talents were so underused by Hollywood, but that always seems to be the unfortunate norm.  A little like what ironically happens to him in this intriguing but downbeat story.\n\n Ralph Meeker (who was also memorable as the brutal and ruthless Mike Hammer in the 5O's cult gem \"Kiss Me Deadly\" - a complete opposite role that shows a true range of his acting abilities) delivers another wretching performance as the true brave soldier unjustly sentenced for \"Cowardice in the Face of the Enemy\".  (Maybe he should have turned 'about face', but it would have still been 'damned if he did and damned if he didn't' - another grim moral theme here).  His breakdown scene right before he is to be taken out and shot is terribly heartbreaking, for I felt so wanting, but helplessly unable, to come to his help.\n\n Take my word for it, everyone else is awesome; a true actor's dramatic show with dark satirical overtones.  POG goes beyond the mere preaching anti-war diatribe (though it does convey that almost naturally, like going without having to say).  It's a great classic morality play that will really make you stop (many, many times) and truly make you think (many many times). Airheads not allowed.  Moreover, this haunting and disturbing masterpiece is top entertainment, something too many art films aren't.     >\n\n It will really make you question things about our troubled, convoluted world and how things are to often immorally and inhumanly run all in the sick name of greed and destructive power. Not too lovely, for the director pulls no punches.  This film really has grown more profound (and currently pertinent) since its initial release.  Also the editing is taut and concise; there isn't a single wasted moment.  Count the number of films on one hand that has accomplished that miraculous feat; that most critics and user commentators are always rightfully harking on.  I'll shut up now.  Go see this one-of-a-kind film, then see it again - and again, etc.  >",
        "title": "KUBRICK'S GENUINE CLASSIC MASTERPIECE",
        "date": "2003-02-26"
      },
      {
        "author": { "name": "horrorlover77", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 1, "up": 13 },
        "text": "If you're a fan of horror movies, then this one is a must-see. It's terrifying and kept me on edge the entire time.",
        "title": "Terrifying",
        "date": "2020-01-17"
      },
      {
        "author": { "name": "blinkfan1", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 2, "up": 9 },
        "text": "The acting in this movie was phenomenal. I was blown away by the performances of the cast.",
        "title": "Phenomenal Acting",
        "date": "2020-01-15"
      }
    ]
  },
  {
    "id": "tt0081505",
    "reviews": [
      {
        "author": { "name": "us012862", "id": "/user/ur0846694/" },
        "interestingVotes": { "down": 213, "up": 782 },
        "text": "When this film first came out in 1980, I remember going to see it on opening night. The sheer terror that I experienced in viewing \"The Shining\" was enough to make me go to bed with the lights turned ON every night for an entire summer. This movie just scared the life out of me, which is what still happens every time I rent the video for a re-watch. I have seen The Shining at least six or seven times, and I still believe it to be simultaneously and paradoxically one of the most frightening and yet funniest films I've ever seen. Frightening because of the extraordinarily effective use of long shots to create feelings of isolation, convex lens shots to enhance surrealism, and meticulously scored music to bring tension levels to virtually unbearable levels. And \"funny\" because of Jack Nicholson's outrageous and in many cases ad-libbed onscreen antics. It never ceases to amaze me how The Shining is actually two films in one, both a comedy AND a horror flick. Ghostly apparitions of a strikingly menacing nature haunt much of the first half of the film, which gradually evolve into ever more serious physical threats as time progresses. Be that as it may, there is surprisingly little violence given the apparent intensity, but that is little comfort for the feint of heart as much of the terror is more implied than manifest. The Shining is a truly frightening movie that works symbolically on many levels, but is basically about human shortcomings and the way they can be exploited by unconscious forces combined with weakness of will. This film scares the most just by using suggestion to turn your own imagination against you. The Shining is a brilliant cinematic masterpiece, the likes of which have never been seen before or since. Highly, highly recommended. - Paul",
        "title": "Best Horror Film I've Ever Seen",
        "date": "2000-08-27"
      },
      {
        "author": { "name": "filmlover-456", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "I was disappointed by this movie. The pacing was way too slow and the story was not engaging.",
        "title": "Disappointing",
        "date": "2023-01-10"
      },
      {
        "author": { "name": "movieaddict-123", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "This movie was so moving. I was in tears by the end.",
        "title": "Moving",
        "date": "2023-02-19"
      }
    ]
  },
  {
    "id": "tt0032553",
    "reviews": [
      {
        "author": { "name": "Steffi_P", "id": "/user/ur3063013/" },
        "interestingVotes": { "down": 1, "up": 15 },
        "text": "Back at the dawn of the talkie era, Charlie Chaplin defended his decision not to start making sound films by saying \"The moment the little tramp talks, he's dead\". He was right of course. His comic persona was the creation of an era in cinema when words and voices were irrelevant. The little tramp's appeal lay entirely in how he did things, not in what he was supposed to be saying. And yet it was inevitable that if Chaplin wanted to continue in the business he would have to cave in eventually. Besides Chaplin's agenda was itself changing, and he had now reached a point in his life where he really wanted to speak to the world.\n\nMany of the early scenes in The Great Dictator seem to prove Chaplin's fears about sound film. The slapstick has lost its flow, looking forced and awkward. And it appears Chaplin has no real idea how to write or direct dialogue. Sometimes characters make some banal little comment on the action as if simply to fill up the silence. Even worse things happen when Chaplin attempts verbal humour, resorting to feeble puns like the one about the gas keeping him awake all night (not that puns are necessarily bad, just that Chaplin isn't very good at them). Above all, the visual and verbal business is poorly integrated, with a badly-timed stop-start feel. It makes it particularly jarring after a dialogue scene to see this ageing version of the little tramp doing some of his old moves, such as teetering on one foot as he runs into a squad of stormtroopers. These scenes are unlikely to raise more than a titter, and are a sad testament to the fact that this familiar character was past his prime and out of time.\n\nBut this is a tale of two Charlies. For the first time in decades Chaplin creates a new character for himself in dictator Adenoid Hynkel. And the great thing about Hynkel is that he sidesteps Chaplin's inability with comedy in words but still makes use of comedy in sound. The dictator's cod-Germanic speech is part silly-voice, part linguistic nonsense and it is very, very funny. It actually adds to the humour that no-one else in the picture speaks it, and that Hynkel mostly lapses into it in moments of anger, as if it was some involuntary anxiety-driven affectation. The other great thing about Hynkel is that he is one of Chaplin's great works of satire. The nonsense language is of course a lampooning of Hitler's forceful speechmaking, but the parody continues through everything Hynkel does. Take for example when he has finished posing with the baby, and rather disgustedly wipes his hand clean. He does it with the same stiff-faced disdain that Hitler always displayed in public, but the character's puffed-up austerity is also being punctured by the fact that he's just got his hand covered in wee wee. The little tramp, a creation of and for the silent era, could not make the transition to sound. But Hynkel is a creation of and for the sound era, and he works fantastically.\n\nAs the picture unfolds, it begins to gain maturity and clarity, not to mention comic brilliance. Jack Oakie's Napoloni makes a perfect partner for Hynkel, and their antics together are like the Marx Brothers at their most riotous. Napoloni is also a work of satire equal to Hynkel, with Oakie working in many of Mussolini's less dignified mannerisms, such as curling his lip and bulging his eyes like he's trying to squeeze out a fart. While Chaplin's direction is at its most overt and showy, he also cleverly and subtly gears his compositions towards ridicule, making the most of those tall set designs to show off the dictator as some little twerp. And finally, the picture acquires the poignancy that made Chaplin's silent features stand out, this time with an extra bite in the seriousness of its message. It is then that you realise Chaplin knew his little tramp was finished, and yet that he needed him here to deliver his point. By subjecting him to sound, Chaplin sacrifices his alter-ego, making a means to speak his mind to the public who had loved him.",
        "title": "\"Can you hear that?\"",
        "date": "2010-10-18"
      },
      {
        "author": { "name": "cinemalover-890", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "I loved everything about this movie. The story was compelling and the acting was superb.",
        "title": "Compelling story",
        "date": "2023-01-22"
      },
      {
        "author": { "name": "filmgeek-567", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a triumph. The direction and acting were both incredible. Go see it.",
        "title": "Triumph",
        "date": "2022-12-11"
      }
    ]
  },
  {
    "id": "tt4154756",
    "reviews": [
      {
        "author": { "name": "grztxks", "id": "/user/ur128816687/" },
        "interestingVotes": { "down": 17, "up": 129 },
        "text": "Infinity war is one of the best MCU protects. It has a great story, great acting, and awesome looking. If you aren't a Marvel fan or haven't watched most of the previous MCU movies this however, won't be something for you. Let's start with Thanos, definitely one of the best villains, he has a motive, is well played, you can even say that Infinity war tells his story and not the story of a hero. But also most of the other cast members were great in their role and again, if you love Marvel, watch this movie.",
        "title": "Better than Endgame",
        "date": "2021-03-14"
      },
      {
        "author": { "name": "moviejunkie-234", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 3, "up": 7 },
        "text": "This movie was a mess. The plot was convoluted and the characters were poorly written.",
        "title": "A mess",
        "date": "2022-11-19"
      },
      {
        "author": { "name": "cinemaphile-789", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "I thought this movie was just okay. It had some good moments, but overall it didn't really leave much of an impression.",
        "title": "Just okay",
        "date": "2022-10-15"
      }
    ]
  },
  {
    "id": "tt0051201",
    "reviews": [
      {
        "author": { "name": "The_Void", "id": "/user/ur2248099/" },
        "interestingVotes": { "down": 12, "up": 101 },
        "text": "Billy Wilder is a director with an understanding of cinema that is almost unmatched throughout the medium's entire history - that's why his films are always so good. Witness for the Prosecution is yet another highlight in the great director's history, and it proves that courtroom dramas can be both riveting and a great opportunity for some first rate comedy. Wilder's film features one of the most well paced plots I've ever seen in a film, and it's a plot that includes some very finely tuned twists. Towards the end, Wilder bombards us with twist after twist, each one both making sense and topping the one before it. In a time when people are impressed by films such as 'The Sixth Sense', Billy Wilder still shows us how to skilfully attribute a twist into a film's plot. The plot itself follows the story of Sir Wilfrid Robarts; an ace defence lawyer that has been told that his health won't allow him to tackle anything more than mundane cases, but is brought back into the fray when a case involving the murder of an elderly woman comes into his hands. Wilfrid must now juggle the case and his health as he attempts to keep the young man from being sent down.\n\nLike all Wilder films, this one is a very pleasurable viewing. Wilder manages to find a middle ground between substance and entertainment, and so this is a film that will please fans of both aspects. The film is deliriously entertaining throughout, with some truly great lines of dialogue (most of which is very quotable) and every twist adds a new level to the story. The substance comes from a multitude of angles, and themes of love, health, sacrifice and most notably, justice, are all more than prevalent. The acting is certainly of note in Witness for the Prosecution. Charles Laughton is absolutely sublime as the undermining and stubborn Wilfrid Robarts; his performance is very strong, and makes up the backbone of the film. The main supporting performance comes from Marlene Dietrich. I'm not a big fan of hers; despite having a great pair of legs, she just doesn't do anything for me, but in this film she brings sufficient coldness to her character and really makes it her own. The final main performance comes from Tyrone Power; he isn't as great as the other two, but does enough with his character to ensure he's believable. Highly recommended viewing!",
        "title": "Another triumph for cinematic genius Billy Wilder!",
        "date": "2005-02-03"
      },
      {
        "author": { "name": "filmfan-456", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "This movie was a real tear-jerker. It had me reaching for the tissues more than once.",
        "title": "Tear-jerker",
        "date": "2022-09-09"
      },
      {
        "author": { "name": "moviebuff-123", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie was a lot of fun! The energy was infectious and the performances were great.",
        "title": "Infectious energy",
        "date": "2022-08-28"
      }
    ]
  },
  {
    "id": "tt0090605",
    "reviews": [
      {
        "author": { "name": "Pluto-3", "id": "/user/ur0077956/" },
        "interestingVotes": { "down": 129, "up": 632 },
        "text": "THE sci-fi movie. It's nearly perfect in every way: storyline, characters, menacing threat, suspense, action, direction, music, emotion, etc... It's always been a favorite of mine and still is. To me this is not just a film, it is an experience. The adrenaline pumps like in no other film and rarely have we had the chance to see a heroine as compelling as Sigourney Weaver. She can kick anyone's ass and still keep a heart and soul. (Why she didn't win the Oscar back in 1986 is beyond me.) When the action starts, you're in for the ride of your life. Truly a milestone in movie making. Now if they could only release it on DVD...",
        "title": "This ain't a film.",
        "date": "1998-08-14"
      },
      {
        "author": { "name": "cinemamaven-789", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "I was disappointed by this movie. The trailer made it look so good, but the actual film didn't live up to the hype.",
        "title": "Disappointing",
        "date": "2022-07-12"
      },
      {
        "author": { "name": "filmexpert-456", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a masterpiece. The writing, direction, and acting were all incredible.",
        "title": "Masterpiece",
        "date": "2022-06-25"
      }
    ]
  },
  {
    "id": "tt0169547",
    "reviews": [
      {
        "author": { "name": "The Woof", "id": "/user/ur0477423/" },
        "interestingVotes": { "down": 75, "up": 247 },
        "text": "This movie was a joy to watch.  I didn't know what to expect when I came into it.  I had heard the buzz of the acting and the story, etc...but we've all heard that before and had been disappointed, but not so with this one.\n\nKevin Spacey plays this part to a \"T\".  He is strong when it requires and meek when it is needed.  His emotional rollercoaster ride is a trip to partake in. Annette Bening is marvelous as well.  I think they both should be nominated.\n\nThe support cast is also spectacular.  Thora Birch, Wes Bentley, and Mena Suvari all give great performances as the troubled \"Teenagers\" in the film. Of particular mention is Wes Bentley's performance, worthy of a supporting nomination as well.\n\nThis is a dramatic and funny tale of a man and his life in a state of turmoil and transition.  When he happens to see a beautiful friend of his daughter's at a cheerleading exhibition, he is completely infatuated with her beauty.  Using this as his inspiration, he attempts to change all aspects of his life.  He confronts his marriage, his job, his ego, and his libido.\n\nThe music in this film is also very well chosen.  There are moments when the music fits so perfectly with the scene that they meld together as one to present a perfect emotion.\n\nThe plot can get rather involved, but you will follow it endlessly to see where you go.  I was simply involved, hook, line and sinker.\n\nSee this movie more than once, and skip some of the other movies out now that are dare I say, trash.\n\nThis should be on the top of many critic's lists this year and it is certainly on top of mine.\n\nMy Rating (1 - 10):  10",
        "title": "One of my faves of the year...simply great.",
        "date": "1999-11-05"
      },
      {
        "author": { "name": "movieconnoisseur-123", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "I really enjoyed this movie. The humor was great and the story had a lot of heart.",
        "title": "Heartfelt humor",
        "date": "2022-05-29"
      },
      {
        "author": { "name": "cinemaexpert-789", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "This movie was so suspenseful. I was on the edge of my seat the entire time.",
        "title": "Suspenseful",
        "date": "2022-04-23"
      }
    ]
  },
  {
    "id": "tt4633694",
    "reviews": [
      {
        "author": { "name": "matthewssilverhammer", "id": "/user/ur19752191/" },
        "interestingVotes": { "down": 79, "up": 208 },
        "text": "The worlds of superhero movies and superhero comics are not as similar as they seem on the surface. Currently, film studios are all about the \"extended universe\", seeing how many different titles and characters they can shove into one franchise (Avengers, X-Men, Justice League), making for an easy way to squeeze a few extra bucks out of their lesser known properties. Comics have this as well, of course. However, they also have something modern movies haven't really tapped into yet: story one-offs, a chance for a storyteller to create a unique tale and not be constrained by the implications on or from the larger universe. Spider-Verse gets to do just that, while playfully taking on the fun (if convoluted) absurdity of extended superhero universes. Listen, I hear you. \"How could we possibly need another Spider-Man movie?\" Spider-Verse understands that question and has a take on it. Yes, Peter Parker is here. In fact, there are two Peter Parkers. There's also a Spider-Woman, a Noir Spider-Man, an anime Spider-Girl/Robot, and a Spider-Pig. At the center though is Miles Morales, an Afro-Hispanic Brooklyn teen who must help these other Spider-People get back to their own planes of existence. He fights with his cop dad, he adores his shady uncle, hates being simply the smartest kid in the room, and just wants to do something that matters. Being Spider-Man wasn't his idea, but hey, when a radioactive spider gives you powers, what choice do you have? Look, I don't have any sort of hot take on this movie. It looks great, the humor pops with surprises, the voice casting is beyond perfect. It's simply a stylishly exciting and refreshingly unique take on the superhero genre, and sometimes that's more than enough.",
        "title": "How on God's green Earth did this work so well???",
        "date": "2018-12-21"
      },
      {
        "author": { "name": "filmcritic-456", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 3, "up": 7 },
        "text": "I was bored out of my mind watching this movie. The pacing was so slow and nothing really happened.",
        "title": "Boring",
        "date": "2022-03-13"
      },
      {
        "author": { "name": "cinemaguru-123", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a work of art. The direction and cinematography were so beautiful.",
        "title": "A work of art",
        "date": "2022-02-21"
      }
    ]
  },
  {
    "id": "tt0057012",
    "reviews": [
      {
        "author": { "name": "justusmcqueen", "id": "/user/ur1061483/" },
        "interestingVotes": { "down": 131, "up": 260 },
        "text": "Few films are able to take a deadly serious issue and place it within the context of a broad comedy successfully.  Dr. Strangelove does exactly that. Kubrick's masterpiece illustrates in brilliant fashion the idiocy of nuclear war and the idiots who are orchestrating it. What strikes one most however in this cinematic gem are the individual characterisations of Sellers, Scott, Hayden and Pickens. To refer to them as memorable roles is a gross understatement. With names such as President Merkin Muffley, General \"Buck\" Turgidson, General Jack D. Ripper and Major T.J. \"King\" Kong, you know that these characters will not be soon forgotten. Other features of the film such as the remarkably designed \"war room\" set, the hand-held camera techniques employed by Kubrick and the black and white cinematography of Gilbert Taylor only add to the power and impact of \"Strangelove.\"  Quite simply, the greatest American film by the greatest American director.",
        "title": "The Ultimate Black Comedy",
        "date": "2001-02-16"
      },
      {
        "author": { "name": "movieenthusiast-789", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "I was blown away by this movie. The acting was incredible and the story was so emotionally powerful.",
        "title": "Emotionally powerful",
        "date": "2022-01-15"
      },
      {
        "author": { "name": "filmlover-456", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "This movie was so beautiful. The cinematography and production design were top-notch.",
        "title": "Beautiful",
        "date": "2021-12-02"
      }
    ]
  },
  {
    "id": "tt1345836",
    "reviews": [
      {
        "author": { "name": "Joaquin_Collete", "id": "/user/ur34960632/" },
        "interestingVotes": { "down": 820, "up": 1974 },
        "text": "Not being a huge fan of superhero movies, I didn't have much expectations for Batman Begins. However viewing the 2005 Christopher Nolan production, I was pleasantly shocked. Then after my huge expectations for, \"The Dark Knight\", Christopher Nolan blew my expectations to the dust. Will the same happen with the 3rd and last film, \"The Dark Knight Rises\"? Quite simply, Yes! My big expectations were once again, blown away. What a production! This is a true cinematic experience, to behold. The movie exceeded my expectations in terms of action, and entertainment. The editing, sound, score, visuals, direction and action are all top notch. \n\nThe film contains a fine cast of talented actors. Christian Bale, of course still makes is a great Batman. Michael Cain is fantastic, as he always is. He gives such a powerful performance, he really ought to be considered for an Oscar nomination. Tom Hardy as Bane is utterly terrifying, at times, and completely ominous. Anne Hathaway as Catwoman/Selina Kyle is a scene stealer. She is completely engrossing. Everyone is so great, the dynamic scenes between the actors are so well done, so well written, and so well directed. The Dark Knight Rises is is emotionally riveting and amazing to view.\n\nAt a running time of almost 3 hours, the film never becomes dull, which is pretty impressive. The movie's action sequences are spectacularly well created and very intense. The dialogue between the character's are intelligent and highly believable. The movie's soundtrack is terrific and really exemplify's many of the movie's scenes. Extremely well editing and sound use really develop many of the movie's action scenes, so it's not just explosions and visuals like in many other movies. Nolan creates a grand, dirty, engrossing world, and his action sequences just hum. \n\nIn conclusion, this film is a gorgeous reminder that great writing and direction can enhance any movie-going experience, even superhero movies, which are usually thought of as mindless entertainment. I am wholly satisfied with Christopher Nolan's vision and thank all who worked on this film for bringing such an intricate interpretation of its very famous literary source. I cannot recommend this film anymore than I have, I just have to say everyone and anyone should see it. 10/10\"",
        "title": "Stunning Conclusion to an Epic Trilogy",
        "date": "2012-07-16"
      },
      {
        "author": { "name": "movieaddict-123", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "I was disappointed by this movie. The plot was confusing and the acting was mediocre at best.",
        "title": "Disappointing",
        "date": "2021-11-07"
      },
      {
        "author": { "name": "cinemalover-890", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie was so much fun! The action scenes were thrilling and the humor had me laughing out loud.",
        "title": "Fun action",
        "date": "2021-10-12"
      }
    ]
  },
  {
    "id": "tt0364569",
    "reviews": [
      {
        "author": { "name": "LeroyBrown-2", "id": "/user/ur0939196/" },
        "interestingVotes": { "down": 10, "up": 26 },
        "text": "I read the review for \"Oldboy\" a few years ago and have since read praise about the movie from IMDb posters. Often times movies with that kind of hype tend to fall short and is a major disappointment. I don't know anything about Korean cinema so I had fairly low expectations. I had expected it to be a simplistic revenge film, shot in bad film stock. Well I have to say that I'm glad I was wrong, and even gladder still that I actually watched this film.\n\nThe basic story is that a man named Oh Dae-Su is kidnapped and held captive for 18 years and then released. He has no idea who or why this is being done to him. While in captivity he readies himself for the day when he gets out and take revenge on those who imprisoned him, and to find out why he was imprisoned. So far it sounds just like any old revenge martial art flick and up to this point it pretty much is, but it's incredibly well crafted. I have to admit I have not paid much attention to Asian martial arts films since Bruce Lee died and maybe I should now. Mainly because this movie doesn't have the jumpy camera work, or bad editing of those old flicks. This movie is a crisply shot as any Scorcese film. That alone elevates this movie to a higher plateau.\n\nOnce he is released, Oh Dae-Su goes on a quest to find what happened to his family and to find the identity of those who had him captured. During the quest for the bad guys, the movie played out like an old fashioned detective movie. The search wasn't rushed and neither was it boring. I suppose the set up made us want to go on this quest with Oh Dae-Su which sounds like Odysseus, and just as Odysseus went on one incredible quest so did Oh Dae-Su.\n\nIt's when he finds the man who had him held captive that the movie truly departs from being an average revenge film to something that is extra ordinary and extraordinarily disturbing. It's at this point that I have to say that the less said the better. It's something totally out of the ordinary and something that I think will repulse some viewers, but at the same time one can't help have sympathy for all the characters even the man who ordered Oh's incarceration. \n\nThe acting in the movie is excellent. I had no idea that Korean cinema has such skillful actors. They all really played their part incredibly well. Min-sik Choi, who played Oh Dae-Su was incredible. He goes through the rigors of being a desperate captive, to being a determined man on a mission. Along the way he runs through the gamut of so much emotion and not once did he hit a false note. \n\nOverall I have to say that this movie is incredibly well crafted and as good as everybody say, however I find it a little disturbing so I can't give this movie a ten. But don't let my not giving the film a ten scare you away it's a good, enjoyable film.",
        "title": "As good and disturbing as expected.",
        "date": "2009-02-03"
      },
      {
        "author": { "name": "filmgeek-567", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "I wasn't sure what to expect from this movie, but I ended up really enjoying it. The humor was great and the performances were fantastic.",
        "title": "Great humor",
        "date": "2021-09-03"
      },
      {
        "author": { "name": "moviejunkie-234", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "I loved this movie! The characters were so well-written and the story was incredibly moving.",
        "title": "Moving story",
        "date": "2021-08-08"
      }
    ]
  },
  {
    "id": "tt7286456",
    "reviews": [
      {
        "author": { "name": "mariamelkott", "id": "/user/ur68236610/" },
        "interestingVotes": { "down": 676, "up": 1846 },
        "text": "I get why some people hate this . It's because of the political message and how some people think that you need get empathy for Arthur's madness. But come on that is not the point and it will never be. Enjoy this masterpiece because Joaquin Phoenix and Todd Phillips overdid themselves with this movie . The acting,music and cinematography are just amazing ! Please enjoy the movie without overthinking it.",
        "title": "Went for a second time to watch",
        "date": "2019-10-03"
      },
      {
        "author": { "name": "cinemaphile-789", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 3, "up": 7 },
        "text": "This movie was awful. The acting was terrible and the plot was nonsensical. Avoid at all costs.",
        "title": "Awful",
        "date": "2021-07-12"
      },
      {
        "author": { "name": "filmfan-456", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "This movie had me on the edge of my seat. The suspense never let up and the ending was so satisfying.",
        "title": "Edge of my seat",
        "date": "2021-06-25"
      }
    ]
  },
  {
    "id": "tt0086879",
    "reviews": [
      {
        "author": { "name": "AngieMargie", "id": "/user/ur2309740/" },
        "interestingVotes": { "down": 33, "up": 77 },
        "text": "When the two worlds of Antonio Salieri and Wolfgang Amadeus Mozart collide in Milos Forman's Amadeus, it is anything but a symphony. As the court composer of the Emperor of Austria, all Salieri desires are fame and recognition as a composer; it is all he had wanted his whole life. When he learns that Mozart, whose name he had known as long as he can remember, is going to come to the court to play, Salieri cannot wait to meet the outstanding and righteous man that he knows he must be. However, when Salieri learns that Mozart is a young, crude, and unrefined young man, endowed with all the talent and ability that he ever wanted and strived for, it plants a seed of jealousy that soon grows into bitter resentment and hatred, not only for Mozart, but also towards God. Salieri's desire to get rid of him is seemingly boundless as he plots and schemes for Mozart's demise. It is no wonder why Amadeus won eight Academy Awards, including Best Picture, with 5-Star performances by F. Murry Abraham as Antonio Salieri and Tom Hulce as Mozart. Amadeus is an emotionally charged and tragic piece, a story of the life of one of the world's most famous composers, as seen through the eyes of his worst enemy.",
        "title": "Amadeus",
        "date": "2003-04-15"
      },
      {
        "author": { "name": "moviebuff-123", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "I was pleasantly surprised by this movie. I didn't expect to like it as much as I did. Highly recommend.",
        "title": "Pleasantly surprised",
        "date": "2021-05-30"
      },
      {
        "author": { "name": "cinemamaven-789", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was incredibly powerful. It tackled some tough subject matter, but did so with grace and compassion.",
        "title": "Powerful",
        "date": "2021-04-24"
      }
    ]
  },
  {
    "id": "tt0361748",
    "reviews": [
      {
        "author": { "name": "paulmuehlendahl", "id": "/user/ur13351149/" },
        "interestingVotes": { "down": 314, "up": 767 },
        "text": "That's what I thought, when I heard about the cast of Inglorious Basterds. And I'm both from Germany and into movies.\n\nThat guy is older than 50 and so far he almost only played in mediocre TV series - and even there he didn't play the main parts. Obviously nobody ever noticed, what he's capable of. Now, thanks to QT, he got one shot to change that - and - let's put it this way - that was a bingo! He is the living proof of what a great caster Tarrantino is.\n\nBy the way: I think it's a great privilege to watch the movie as a German - being able to understand everything. And the German dialog is written almost as good as the English.\n\nNow I could repeat, what many others have written here before. I'll put it short: Finally, QT is back.",
        "title": "Who the hell is Christoph Waltz?",
        "date": "2009-08-25"
      },
      {
        "author": { "name": "filmexpert-456", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "I didn't like this movie at all. The humor fell flat and the story was predictable.",
        "title": "Predictable",
        "date": "2021-03-18"
      },
      {
        "author": { "name": "movieconnoisseur-123", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "I was blown away by the visuals in this movie. It was like nothing I'd ever seen before.",
        "title": "Stunning visuals",
        "date": "2021-02-07"
      }
    ]
  },
  {
    "id": "tt0114709",
    "reviews": [
      {
        "author": { "name": "Instant_Palmer", "id": "/user/ur39322316/" },
        "interestingVotes": { "down": 2, "up": 34 },
        "text": "This is as close to perfection as any animated film has come, entertained parents on a equal plane with their children, and set the bar to the top of the animation film industry. No film has yet come close to Toy Story in legitimizing animation as a film art on the level of movies with live actors. Great comedies are hard to come by - Toy Story strikes gold on that basis alone, but is so much more. One of the Top 100 Greatest Films of All Time, and currently resides on my \"Top 10 Greatest Comedy Films (1960-Present)\" list.",
        "title": "Witty Sweet Fun For All Ages. Forever Changed Animated Film 💯",
        "date": "2021-03-04"
      },
      {
        "author": { "name": "cinemaexpert-789", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "I thought this movie was just okay. It had some good moments, but overall it didn't really leave much of an impression.",
        "title": "Just okay",
        "date": "2021-01-02"
      },
      {
        "author": { "name": "filmcritic-456", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "This movie was a masterpiece. The direction was brilliant and the performances were incredible. One of the best films of the year.",
        "title": "Masterpiece",
        "date": "2020-12-05"
      }
    ]
  },
  {
    "id": "tt2380307",
    "reviews": [
      {
        "author": { "name": "mryohual", "id": "/user/ur81759648/" },
        "interestingVotes": { "down": 134, "up": 1028 },
        "text": "Im Mexican and all i can say is Thanks you Pizax,I just saw this movie and i just remembered all my childhood with my grandparents, Mexico was represented beautifully,the music, the colors. This movie touched me in my soul and i cried a lot, i created an account just to say how good pixar made everything, again gracias pixar por tan hermosa pelicula.",
        "title": "Gracias Pixar",
        "date": "2017-10-27"
      },
      {
        "author": { "name": "cinemaguru-123", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "I was disappointed by this movie. The trailer made it look so good, but the actual film fell flat. Save your money.",
        "title": "Disappointed",
        "date": "2020-11-14"
      },
      {
        "author": { "name": "movieenthusiast-789", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "This movie was so intense! I was on the edge of my seat the entire time. If you like thrillers, you have to see this.",
        "title": "Intense thriller",
        "date": "2020-10-20"
      }
    ]
  },
  {
    "id": "tt0112573",
    "reviews": [
      {
        "author": { "name": "EVON1TY", "id": "/user/ur47939660/" },
        "interestingVotes": { "up": 13 },
        "text": "Most of the times Hollywood movies is sided. I don't know what you believe but sadly this movie based on the truth. Only some of the minor subjects are added to make the movie more interesting. The additions were pretty minor most of the times, the main subjects is based on the truth.\n\nDoesn't matter which nation you are, I think you could love this movie so much. It's actually not only about wars and battles. It has so effective Romance subject. For me the actual subject. Also the movie shows how Freedom is important.\n\nMel Gibson did something special. I don't know is there another movie like this? I'll explain the success I like in this movie. I don't have another example that any movie with great lead actor with achieving so many things. It has James Horner's brilliant scores, (that I don't know how didn't get the Academy Award) has amazing Cinematography, has amazing Costumes and Makeup, also has magnificent Set Decoration.\n\nI don't know how Mel Gibson managed to do all these when he's acting superbly. I know making a movie is not a personal job, It's more of a team job but I'm saying Gibson directed the movie so good while acting superbly. I think that's a real special achievement.",
        "title": "You should have courage to make this movie. ⭐",
        "date": "2023-03-02"
      },
      {
        "author": { "name": "filmlover-456", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "I found this movie to be slow and boring. The only redeeming quality was the beautiful cinematography.",
        "title": "Slow and boring",
        "date": "2020-09-01"
      },
      {
        "author": { "name": "movieaddict-123", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 9 },
        "text": "I didn't expect to like this movie as much as I did. The story was so engaging and the lead actor was fantastic.",
        "title": "Engaging story",
        "date": "2020-08-18"
      }
    ]
  },
  {
    "id": "tt0082096",
    "reviews": [
      {
        "author": { "name": "shmuey barak", "id": "/user/ur0790750/" },
        "interestingVotes": { "down": 43, "up": 1235 },
        "text": "on modern \"boats\" life isn't easy- but compared to the living hell that the German U-Boats were, modern submariners have nothing to complain about. People in certain professions don't like to watch movies about those professions (Doctors and Nurses shy away from hospital dramas, for example). Submarine sailors are different. We love to watch every submarine movie ever made, from \"Run Silent, Run Deep\" and \"Destination: Tokyo\" to \"The Hunt For Red October\", \"Crimson Tide\" and \"U-571\". Why? Because we can always use a good laugh. For those in the know, submarine movies are usually absolutely hilarious. Except this one. After being in the Navy for four years, serving with around 350 different men, and being acquainted with a further 200-300, all of them submarine sailors, I think that I can state with absolute certainty that this film is the ONLY submarine movie that ALL submariners take seriously. And that is the highest praise a movie like this can possibly get.",
        "title": "Take it from a real submariner-",
        "date": "2000-07-07"
      },
      {
        "author": { "name": "cinemalover-890", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 1, "up": 11 },
        "text": "This movie was a lot of fun! The action scenes were so thrilling and the humor was on point.",
        "title": "Thrilling action",
        "date": "2020-07-29"
      },
      {
        "author": { "name": "filmgeek-567", "id": "/user/ur901234567/" },
        "interestingVotes": { "down": 0, "up": 12 },
        "text": "I was blown away by this movie. The cinematography was stunning and the story was so moving. Bring tissues.",
        "title": "Stunning cinematography",
        "date": "2020-06-08"
      }
    ]
  },
  {
    "id": "tt0119698",
    "reviews": [
      {
        "author": { "name": "misty6767", "id": "/user/ur2072125/" },
        "interestingVotes": { "down": 32, "up": 251 },
        "text": "The first time I saw Princess Mononoke I was completely moved and surprised. Since it was a Studio Ghibli film dubbed by Disney I liked the fact that it wasn't a \"they all lived naively ever after\" film. There were no complete \"good\" or \"bad\" guys. Even Lady Eboshi the most antagonist character in the movie had a reasonable motive for trying to get rid of the animal gods and cutting down the forest. Although it her actions were environmentally damaging and wrong in general, she did it to help her people survive which is what all the species on Earth strive for. Another wonderful aspect of the plot is that it sends a message - Protect the Earth and all will survive in peace - a message either discreetly or strongly portrayed in many of Miyazaki's films. Perhaps the portrayal of this message (and the tiny hint of San and Ashitaka's romance and Moro's views on nature) was what made the film so touching to me.\n\nLike many Miyazaki movies, the animation (as always) is wonderful and nicely detailed which is also another quality that genuine Disney films lack (thank goodness for Studio Ghibli). The music was beautiful and well suited to the movie.\n\nThe only predicament to the movie is that it is a bit downbeat and does not contain much happy laughter (oh well, I can watch My Neighbor Totoro - also a good movie - for happy laughter.).\n\n10/10 - And my favourite movie of all time.",
        "title": "Very touching movie!",
        "date": "2004-08-14"
      },
      {
        "author": { "name": "moviejunkie-234", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 3, "up": 7 },
        "text": "This movie was terrible. The acting was bad and the plot made no sense. Don't waste your time.",
        "title": "Terrible",
        "date": "2020-05-11"
      },
      {
        "author": { "name": "cinemaphile-789", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 10 },
        "text": "If you're looking for a thought-provoking film, this is it. The themes explored in this movie will stay with you long after it's over.",
        "title": "Thought-provoking",
        "date": "2020-04-03"
      }
    ]
  },
  {
    "id": "tt1745960",
    "reviews": [
      {
        "author": { "name": "Stoshie", "id": "/user/ur4933808/" },
        "interestingVotes": { "down": 125, "up": 389 },
        "text": "I don't share everyone's unbridled enthusiasm for this film. It is indeed a great popcorn flick, with outstanding aerial photography and maneuvers. But 10 stars? There are few, if any, movies that are perfect, and deserve that kind of rating.\n\nThe problem with the film is the plot. It is so filled with age-worn cliches that one could easily tell what was coming from beginning to end. I mean, you had to know who was going to save the day at the end, and you had to know what was going to happen when Maverick jumped out of Penny's window. Those are just two examples of the many obvious plot points that you could see coming a mile away. I could list them all, but it would take up too much space here. Basically the entire plot was entirely predictable.\n\nThe opening scene, especially, was straight out of Hollywood Screenplay Writing 101. I mean, seriously, how many times have we seen that subplot? Countless.\n\nThere were no characters in the movie, either. They were all caricatures, stereotypes. No depth to any of them. They had their standard roles to play, and that was it.\n\nDid I enjoy the film? Sure, it was fun. Especially on a big theater screen with a loud sound system. Did I take anything away from the film? Did it make me think about anything after it was over? Nah. Will I see it again? Nah.\n\nI will give Tom Cruise credit for including Val Kilmer in the cast. Considering his health problems, that was a nice touch.\n\nSo, yeah, enjoy the film. Sit back with your bag of popcorn and enjoy the g-forces. But don't pretend it is anything other than just another summer blockbuster.",
        "title": "Great Flight Sequences, Cliche-Ridden Plot",
        "date": "2022-06-18"
      },
      {
        "author": { "name": "filmfan-456", "id": "/user/ur789012345/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "I loved this movie! The characters were developed so well and the performances were top-notch. Highly recommend.",
        "title": "Top-notch performances",
        "date": "2020-03-22"
      },
      {
        "author": { "name": "moviebuff-123", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 2, "up": 8 },
        "text": "I wasn't sure what to expect when I started watching this movie, but it ended up being a wild ride. The plot twists kept me guessing until the very end.",
        "title": "Wild ride",
        "date": "2020-02-14"
      }
    ]
  },
  {
    "id": "tt0087843",
    "reviews": [
      {
        "author": { "name": "PCT1970", "id": "/user/ur99519886/" },
        "interestingVotes": { "up": 6 },
        "text": "Leone helms a virtuous epic film in the crime / drama genre. This film has excellent direction, screenplay, editing, cinematography, score and acting. There are many famous artists involved in this film and they deliver superlative and realistic performances. De Niro and Woods in particular are superb. The plot revolves around a former gangster, Noodles, who returns to New York after disappearing four decades earlier to start a new life and for other reasons. The plot initially hints as to why Noodles left New York, but after his return we learn the entire story as seen through his own flashbacks. We see Noodles and his friends growing up in a Jewish slum in New York's Lower East Side. Noodles, a natural leader, rises to bootlegger and ultimately a Mafia boss. This does not come without violence, betrayal and remorse. The film does a magnificent job examining all of the characters and what makes them tick. The plot is gripping, intense, violent, gritty, bloody, duplicitous and has a cathartic ending. This is a sprawling story and thus turns into a lengthy and entertaining film which Leone is known for to begin with. It is a masterful work of art, memorable, timeless and a classic. This film takes a different path, as far as the storyline, than most traditional gangster films which is refreshing. This viewer has revisited this film many times and in my opinion it is bravura in it's genre and holds it's own with the other celebrated gangster / mob films.",
        "title": "Leone Doing What He Does Best",
        "date": "2019-05-08"
      },
      {
        "author": { "name": "filmaddict-789", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 3, "up": 8 },
        "text": "I can't believe how much this movie affected me. The story is so powerful and the acting is exceptional.",
        "title": "Exceptional acting",
        "date": "2019-11-06"
      },
      {
        "author": { "name": "movielover-456", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "This movie blew me away. The direction is masterful and the performances are unforgettable.",
        "title": "Unforgettable performances",
        "date": "2019-11-18"
      }
    ]
  },
  {
    "id": "tt0119217",
    "reviews": [
      {
        "author": { "name": "TheLittleSongbird", "id": "/user/ur20552756/" },
        "interestingVotes": { "down": 9, "up": 51 },
        "text": "I don't think I have been this moved by a movie in a while. Good Will Hunting is an incredible movie and if I had to say what I think is Gus Van Sant's best film, this would be it. It is a slow-burner, but I think this was purposefully done and it added to the film's poignancy and psychological aspect.\n\nGood Will Hunting is a beautifully filmed movie with striking scenery, and it is directed wonderfully by Van Sant. The music is never obtrusive but never too low-key either, while the story is interesting and compelling and the script intelligently written.\n\nThe acting is one of the film's best assets, as well as its compellingly real characters. Robin Williams is superb in one of his best \"drama\" roles, while Ben Affleck has never been better and Matt Damon gives another fine performance to match his performance in The Talented Mr Ripley. Minnie Driver is also quite touching and believable.\n\nAll in all, an incredible movie. 10/10 Bethany Cox",
        "title": "Incredible",
        "date": "2011-10-13"
      },
      {
        "author": { "name": "filmcritic-123", "id": "/user/ur901234567/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "This movie is a true masterpiece. The writing, directing, and acting are all incredible.",
        "title": "True masterpiece",
        "date": "2019-11-30"
      },
      {
        "author": { "name": "cinemalover-789", "id": "/user/ur789012345/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie is a triumph of storytelling. The direction is masterful and the acting is superb.",
        "title": "Triumph of storytelling",
        "date": "2019-12-12"
      }
    ]
  },
  {
    "id": "tt5311514",
    "reviews": [
      {
        "author": { "name": "A_Different_Drummer", "id": "/user/ur44112735/" },
        "interestingVotes": { "down": 32, "up": 351 },
        "text": "In truth, the most competitive area of fiction is not invasions from outer space or talking dogs or impossible missions but rather the most basic narrative of all, the love story.\n\nAnd this is also the most overcrowded field, and the most difficult to do right.\n\nThis film, this story, is extraordinary. It reminds me of MY SASSY GIRL, a love story from Asia that captured the imagination of the world and has almost become a franchise, it's been copied so many times.\n\nIt also brings to mind Richard Matheson's classic BID TIME RETURN, another love story for the ages that uses time juxtaposition. (Done as the movie SOMEWHERE IN TIME, 1980).\n\nI already gave this the highest rating on the IMDb.\n\nThe animation is stunning and complimentary to this one-of-a-kind tale.\n\nAll things considered, I would like to avoid the ongoing arguments about which Japanese animation studio is better, or worse, than the other.\n\nI prefer to simply be grateful that Japanese anime exists at all, because I cannot imagine any other country producing something this moving, this powerful, in graphic form.\n\n((Designated \"IMDb Top Reviewer.\" Please check out my list \"167+ Nearly-Perfect Movies (with the occasional Anime or TV miniseries) you can/should see again and again (1932 to the present))",
        "title": "could be the greatest love story of all time",
        "date": "2017-02-02"
      },
      {
        "author": { "name": "filmfan-456", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "This movie had me in tears by the end. The performances are so genuine and the story is so moving.",
        "title": "Genuine performances",
        "date": "2019-12-25"
      },
      {
        "author": { "name": "moviebuff-123", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "This movie is a work of art. The music and visuals are breathtaking and the acting is phenomenal.",
        "title": "Breathtaking music and visuals",
        "date": "2020-01-07"
      }
    ]
  },
  {
    "id": "tt4154796",
    "reviews": [
      {
        "author": { "name": "larshoeijmans", "id": "/user/ur60559458/" },
        "interestingVotes": { "down": 1536, "up": 1901 },
        "text": "If you're going to watch this movie, avoid any spoilers, even spoiler free reviews. Which is why I'm not going to say anything about the movie. Not even my opinion. All I'm going to say is:\n\nThe crowd applauded 3 times during the movie, and stood up to clap their hands after. This I have never witnessed in a Dutch cinema. Dutch crowds aren't usually passionate about this. I checked the row where I was sitting, and people were crying. After the movie, I was seeing people with smudged mascara. That's all I have to say about the movie.",
        "title": "The ending made all 22 movies worth it",
        "date": "2019-04-24"
      },
      {
        "author": { "name": "cinephile-789", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie had me on the edge of my seat. The suspense never let up and the ending was so satisfying.",
        "title": "Edge of my seat",
        "date": "2020-01-19"
      },
      {
        "author": { "name": "filmaddict-456", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I was completely engrossed in this movie from beginning to end. The story is so thought-provoking and the performances are amazing.",
        "title": "Completely engrossed",
        "date": "2020-01-31"
      }
    ]
  },
  {
    "id": "tt0180093",
    "reviews": [
      {
        "author": { "name": "eric226", "id": "/user/ur2059624/" },
        "interestingVotes": { "down": 203, "up": 1817 },
        "text": "I'm not going to waste space with a synopsis, as every second or third review provides one. A good indication of a challenging and original film is the number of 1/10 and 10/10 reviews, where the 1/10 reviews consist of just a few lines.  A pretty sure sign that those folks weren't able or willing to watch with an open mind.  Which is a good sign for casual viewers to give this film a wide berth.\n\nI wish everyone I care about would see Requiem for a Dream.  Not because they will like it, or that it will teach them something they did not already know, but that it's a rare piece of work that will challenge and probably change them.  It's a film that has never been made before, with nothing to compare to it - a rarity these days.  I often find myself recommending films to people that I am unable to briefly describe.  These are usually the most involving and affecting ones. I'd like my family to see this, but can't *recommend* it to them.  I've recommended it to two friends, and they both had the same reaction:  I am glad I watched it, but I doubt I'll be in the frame of mind to watch it again, knowing what you feel.\n\nAs I sat watching the credits roll, I began crying, but I'm still not sure why.  Partly in reaction to the devastatingly tragic ending, partly the beauty (yes) of the film, partly my gratitude for good things in my life. I watched it again the same night with my girlfriend, not because I wanted to upset her, but I felt that I had to share it. After the credits rolled, we both were silent for a good ten minutes.  I found that I had thoughts I wanted to express, but could find no words.  This is one of the few films that are painful to experience, but I feel compelled to share with people I care about.  Some others in that short list include The Thin Red Line, Happiness, River's Edge,and The Deer Hunter.\n\nThese films all share a quality that's difficult to name.  No one likes feeling disturbed or shattered by a film, a work of art, a piece of music, but I feel experiencing these emotions and being asked to think, not just be entertained, is important now and then.\n\n\"Favorite\" does not apply to this for me - this isn't about entertainment. One of the most devastating and beautiful experiences I've had watching a film.  One of the top five films I've ever seen.",
        "title": "Awful and Essential",
        "date": "2002-11-25"
      },
      {
        "author": { "name": "movielover-123", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "This movie is a must-see. The story is so compelling and the acting is top-notch.",
        "title": "Must-see",
        "date": "2020-02-13"
      },
      {
        "author": { "name": "filmcritic-789", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 3, "up": 8 },
        "text": "This movie is a tour-de-force. The writing, directing, and acting are all incredible.",
        "title": "Incredible writing, directing, and acting",
        "date": "2020-02-25"
      }
    ]
  },
  {
    "id": "tt0435761",
    "reviews": [
      {
        "author": { "name": "dee.reid", "id": "/user/ur0892646/" },
        "interestingVotes": { "down": 3, "up": 71 },
        "text": "Lee Unkrinch directed \"Toy Story 3,\" the third and presumably final installment in the \"Toy Story\" movie franchise. One could argue that this is probably the best one yet (1999's \"Toy Story 2\" remains my personal favorite of the three), and I won't argue with those who think otherwise. I still hold onto \"Toy Story 2\" for deep personal reasons, but \"Toy Story 3\" does build upon events foreshadowed in the previous installment, which does gives this film a weighty emotional punch - a rarity in animated films these days.\n\nAs foreshadowed in \"Toy Story 2,\" Andy (John Morris) has finally grown up; he's 17 now, and is on his way to college in just a few days. His mom is putting pressure on him to get rid of his old toys, either by throwing them out with the garbage, donating them to other needy children, or simply putting them in the attic (a sort of gone-but-not-forgotten-and-within-reach-type of deal).\n\nWoody (Tom Hanks), brave leader of the toys and Andy's favorite, manages to dodge a bullet somewhat, but puts himself in the line of fire when Buzz Lightyear (Tim Allen) and the other toys are accidentally thrown out but somehow or another wind up at Sunnyside Daycare, where they are welcomed with open arms by the resident toys there. This introduces us to Lotso (Ned Beatty), the strawberry-scented teddy bear who runs the place, along with the metro-sexual Ken doll (Michael Keaton) and others. As it turns out, this daycare center is actually a prison, and Lotso runs this place with an iron fist; of course, Lotso has a very tragic back-story that explains his evil ways, much like with Jessie (Joan Cusack), who first appeared in \"Toy Story 2.\" So Woody and the other toys must mount a valiant escape if they are to be reunited with their beloved owner before he leaves for college.\n\n\"Toy Story 3\" is an amazing film, and a fitting end to a wonderful film series that started in 1995 with the first \"Toy Story,\" which also signaled the arrival of the very illustrious and extremely talented Disney-owned animation studio Pixar. They have yet another significant hit on their hands with this picture. The animation here is at its most life-like and real and it's damn-near flawless and strikingly beautiful, which signals just how far Pixar has come in the 15 years since their first hit with \"Toy Story.\" And every film since then has added significant amounts of realism, weight, and dimension to their animated stories.\n\nWhile \"Toy Story 2\" had a high nostalgia factor for days long gone by, \"Toy Story 3\" is a film about the inevitability of children growing up and putting away their toys. There are also themes about the effect of loss, love, and friendship going in the proceedings here. In addition, \"Toy Story 3\" can also be an incredibly dark film at times - a bold move considering that this is a family film - but there's no need to worry because the fact is that it's all perfectly balanced out amazingly well with some very light-hearted humor, fast and furious action scenes, and stirring emotional moments that just might bring a few tears to your eyes.\n\n\"Toy Story 3\" is a triumph of animation and imagination, and I say that as a die-hard \"Toy Story 2\" fan. What we get here, is a fitting closer (?) to an amazing film series that just continues to surprise again and again with each new entry. It's just a great reminder for all of us heartless adults of better days in our youth that have long gone bye-bye.\n\n10/10",
        "title": "An amazing third \"Story\"",
        "date": "2010-11-04"
      },
      {
        "author": { "name": "cinemalover-456", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I can't believe how much I loved this movie. The story is so powerful and the acting is superb.",
        "title": "Powerful story",
        "date": "2020-03-09"
      },
      {
        "author": { "name": "filmfan-123", "id": "/user/ur901234567/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "This movie blew me away. The direction is masterful and the performances are unforgettable.",
        "title": "Unforgettable performances",
        "date": "2020-03-21"
      }
    ]
  },
  {
    "id": "tt0045152",
    "reviews": [
      {
        "author": { "name": "TwoCentsFromTexas", "id": "/user/ur0691463/" },
        "interestingVotes": { "down": 29, "up": 99 },
        "text": "Many good things can be and have been said about this one and they're all true.  It's a great movie.  The title number gives us Don Lockwood (Kelly)...In love as no other person has ever been in love, no doubt.  He steps out the door and it's raining but he's oblivious to the rain.  Who needs an umbrella when you've got wings on your heart and on your feet? Not the incomparable Gene Kelly as he treats us to THE single finest moment in the history of cinema.  Do not miss this one.",
        "title": "Delightful!",
        "date": "2000-04-18"
      },
      {
        "author": { "name": "moviebuff-789", "id": "/user/ur789012345/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie is a triumph. The themes are so important and the acting is phenomenal.",
        "title": "A triumph",
        "date": "2020-04-03"
      },
      {
        "author": { "name": "cinephile-456", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I was engrossed in this movie from beginning to end. The writing is so clever and the acting is superb.",
        "title": "Engrossing from beginning to end",
        "date": "2020-04-15"
      }
    ]
  },
  {
    "id": "tt1187043",
    "reviews": [
      {
        "author": { "name": "deloudelouvain", "id": "/user/ur58525162/" },
        "interestingVotes": { "down": 8, "up": 29 },
        "text": "Because the movie had such a high rating on IMDb I was intrigued. Bollywood movies are not particularly on the top of my list I must admit. But I gave it a shot and I'm glad I did. It only has two scenes where they start singing and dancing so that was not too much. Why they start singing and dancing that I will never get. The story does not need that at all. The story itself was very pleasant to follow. Full of mixed emotions, happy ones and sad ones. The cast and the filming was great. All actors gave a good performance throughout the whole movie. Like in most American television series they want to give you a lesson in life and most of the time it makes me want to barf but in this Bollywood movie it works perfectly well. I had fun watching this and I get why I am not the only one. Certainly worth a watch.",
        "title": "One of the better Bollywood movies I saw",
        "date": "2016-02-06"
      },
      {
        "author": { "name": "filmaddict-123", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "This movie is a masterpiece. The direction is flawless and the performances are outstanding.",
        "title": "Flawless direction",
        "date": "2020-04-27"
      },
      {
        "author": { "name": "movielover-789", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "I can't stop thinking about this movie. The cinematography is stunning and the story is so moving.",
        "title": "Stunning cinematography",
        "date": "2020-05-10"
      }
    ]
  },
  {
    "id": "tt0057565",
    "reviews": [
      {
        "author": { "name": "jemmytee", "id": "/user/ur2466469/" },
        "interestingVotes": { "down": 12, "up": 108 },
        "text": "This is one of those rare movies I had to watch twice to catch all the meaning and beauty of its construction, that is how sleek and polished this film is. The storyline is deceptively simple -- a businessman named Gondo is about to take control of the company he's worked in for years when he's told his son's been kidnapped.  It turns out the kidnappers got his chauffeur's son by mistake, but they still want him to pay the ransom.  If he does, he will be financially ruined.  If he doesn't, he will be reviled.  Which will he choose?  This makes up the first half of the movie, culminating in a breathtaking scene on one of Japan's bullet trains.  The second half is the police search for the kidnapper/murderer and how a case is built that will take him to the gallows.\n\nNow this sounds like your typical cop thriller, the type Hollywood churns out with one hand tied behind its back, but Kurosawa makes it into a meditation on honor and decency, and on how one's choices can lead one to Heaven or to Hell in little steps that seem to be taking you nowhere.  Gondo is an honorable man who worked hard to built himself a life of wealth and power.  This is no small feat, considering Japan is not known as a society where one can easily change one's station in life, so this adds to his dilemma; he will not only lose his fortune, he will also lose his hard-gained power and respect in the business community, all for a child that is not even his.  And not only will he lose but his own wife and son will, as well.  But to NOT pay the ransom means he will lose everything in him that is human and decent, and his wife and son will suffer from that, too.\n\nThis is a big deal -- not just in Japanese society but in the world as a whole.  It doesn't matter if you live in Nepal or Kenya or Argentina or New York City, when faced with the choice of losing your position in your society or losing your soul, which would you choose?  And would you still make that choice knowing that even if the cops catch the bad guy, it will make no difference in your own circumstances?  Just a glance at some of the recent stock scandals gives you a good idea of where most people fall in their choices.  And even Ed McBain, upon whose novel this movie is based, knew how hard it would be to give up your world for your spirit; his businessman refuses to pay the ransom.\n\nTo me, this movie is Kurosawa at his best and most subtle.  Every shot is composed and measured and done just right.  Not all films have to have bombs exploding and chase scenes and people going \"Boo!\" to affect you; sometimes just a man riding on a train en route to what he knows will be a catastrophe to him and his world is enough to make you thank the heavens for a story well told.",
        "title": "Kurosawa at his best and most subtle",
        "date": "2004-08-01"
      },
      {
        "author": { "name": "filmcritic-456", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "This movie had me in tears by the end. The emotional journey that the characters go on is so powerful.",
        "title": "Emotional journey",
        "date": "2020-05-22"
      },
      {
        "author": { "name": "cinemalover-123", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "I wasn't sure what to expect from this movie, but I was pleasantly surprised. The story is so compelling and the acting is top-notch.",
        "title": "Pleasantly surprised",
        "date": "2020-06-03"
      }
    ]
  },
  {
    "id": "tt0086190",
    "reviews": [
      {
        "author": { "name": "UniqueParticle", "id": "/user/ur34836174/" },
        "interestingVotes": { "down": 13, "up": 76 },
        "text": "Totally should've won at least some of the awards it was nominated for! A very different adventure story with lots of adorable characters, more truths and the epic Emperor Palpatine! I love all the majestic forest aspects. Still crazy to me that they filmed so many parts especially the chases. The bulk of this art in cinema is done so well and always entertaining. Quite lovable many years later and not many movies have that kind of force!",
        "title": "The most peculiar Star Wars and under appreciated",
        "date": "2020-01-16"
      },
      {
        "author": { "name": "filmfan-789", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 3, "up": 8 },
        "text": "This movie is a tour-de-force. The writing is so clever and the acting is sublime.",
        "title": "Tour-de-force",
        "date": "2020-06-15"
      },
      {
        "author": { "name": "moviebuff-456", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I was blown away by this movie. The direction is masterful and the performances are unforgettable.",
        "title": "Unforgettable performances",
        "date": "2020-06-27"
      }
    ]
  },
  {
    "id": "tt0062622",
    "reviews": [
      {
        "author": { "name": "Manthorpe", "id": "/user/ur2809796/" },
        "interestingVotes": { "down": 340, "up": 674 },
        "text": "A review I have put off for far too long....\n\nBluntly, 2001 is one of the best science-fiction films made to date, if not the very best. Stanley Kubrick was a genius of a film maker and this is one of his very best works. And although it is misunderstood by many, and respectively underrated, it is considered one of the best films of all time and I'll have to agree. Back in 1968, no one had done anything like this before, and no one has since. It was a marvel of a special effects breakthrough back then, and seeing how the effects hold up today, it is no wonder as to why. The film still looks marvelous after almost forty years! Take note CGI people. Through the use of large miniatures and realistic lighting, Kubrick created some of the best special effects ever put on celluloid. This aspect alone almost single-handedly created the chilling void of the space atmosphere which is also attributed to the music and realistic sound effects. I can't think of another film where you can't here anything in space, like it is in reality. Not only is the absence of sound effects in space realistic, it is used cleverly as a tool to establish mood, and it works flawlessly.\n\nAside from the magnificent display of ingenious special effects, there are other factors that play a part in establishing the feel of the film. The music played, all classical, compliment what the eyes are seeing and make you feel the significance of man's journey through his evolution from ape to space traveler.\n\nThe story, while seemingly simple, is profound. Sequentially, several mysterious black monoliths are discovered and basically trigger certain events integral to the film. What are they? Where did they come from? What do they do? These are all questions one asks oneself while watching the story develop and is asked to find his own way. While most come away with a general idea of what took place in the story, each individual will have to decide what it means to them. Any way one decides to answer these question results in profound solutions. It's not left entirely up to interpretation, but in some aspects it is. Experience it for more clarification. The end result is quite chilling, no matter your personal solution.\n\nWhile it is a long film, and sometimes slows down, it has to be in order to accurately portray the journey of man. It's not a subject that would have faired well in a shorter film, faster paced feature. Those with short attention spans need not apply.\n\nLast but not least, is the epitome of a remorseless antagonist, HAL 9000, the computer. Never has a machine held such a chilling screen presence. Which reminds me, for a film with such profound ambition and execution, there is surprisingly little dialogue. Another sign of Kubrick's genius.\n\nAll in all, one of the best films made to date and one of the very best science fiction films made. A personal favorite. Everyone must see this film at least once.\n\nVery highly recommended.",
        "title": "A film of monolithic proportions.",
        "date": "2005-01-05"
      },
      {
        "author": { "name": "cinephile-123", "id": "/user/ur901234567/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "This movie is a gem. The pacing is perfect and the performances are sublime.",
        "title": "A gem",
        "date": "2020-07-09"
      },
      {
        "author": { "name": "filmaddict-789", "id": "/user/ur789012345/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "I can't believe I waited so long to watch this movie. It's an instant classic that everyone should see.",
        "title": "Instant classic",
        "date": "2020-07-21"
      }
    ]
  },
  {
    "id": "tt0338013",
    "reviews": [
      {
        "author": { "name": "Quinoa1984", "id": "/user/ur0453068/" },
        "interestingVotes": { "down": 82, "up": 400 },
        "text": "Michel Gondry, credited as the director and co-writer of Eternal Sunshine of the Spotless Mind, is only partly responsible for the success that the film achieves. He implements a awe-inspiring blend of style to a story that is perfectly non-linear. But then there is also the madman genius of the current screen writing plane- Charlie Kaufman- who has written three of the most ingenious, funny, and human of \"little\" Hollywood movies (Being John Malkovich, Adaptation, Confessions of a Dangerous Mind). \n\nHe understands, and perhaps likely experienced to a degree, what a relationship holds to- the truth, to understanding, and then when it ends, how out memory changes the relationship. Enter in the concept that makes 'Eternal Sunshine' something of a un-official science fiction film - the Lacuna corporation, led by Tom Wilkinson's character, can erase just one person out of your memory, all of the experiences that you and the significant other had. So, when Joel (Jim Carrey) goes in to erase his memory of Clementine (Kate Winslet) after finding out she did just the same, he enters into a mind-warp. He goes through memories they had, happy ones, sad ones, some that are just what makes up what you have emotionally with the one you've loved. And sometimes, and to the behest of the assistants of Lacuna (Kirsten Dunst, Elijah Wood, Mark Ruffalo), Joel doesn't want them all to be erased.\n\nAs I mentioned, the plot is non-linear, which could've gone the wrong way if not done with skill. With a film like 21 Grams, which has a talented director and cast, the non-linear structure isn't necessary. But it's an asset that the story doesn't start from A to Z. To assist Gondry with this, he has the extraordinary Ellen Kuras as DP and Valdís Óskarsdóttir, an editor from Iceland. Their collaboration is crucial with Gondry and Kaufman (and co-writer Pierre Bismuth), as they bring all of these un-real images a real quality. Quite simply, there isn't a finer example of surrealism crossbred with realism in any other American film so far this year. The usage of lights, cuts, and with the kinds of special effects not expected (i.e. no CGI), add to the effect it has on a viewer. That the characters of Joel and Clementine are as enveloping as they are is also a credit to Kaufman.\n\nBut then there's one more part that completes the success of the film - the acting. Jim Carrey, very simply, is at his very best. He finds a balance from certain scenes in being like people we see everyday, feeling low, not much of interest, inward. And then when the memory erases begin, we get to see him act funny, but not like the kind of humor he brought with Ace Ventura or Dumb and Dumber. This is Carrey knowing this character just well enough to play off his counterpart, played by Winslet. She, meanwhile, is perhaps at her best. Her character is eccentric, funny, insightful, and wanting. She pulls it off. As do the supporting actors.\n\nThere's not much more I can say about this film, except to say that even after seeing it three times, I feel like I could watch it over and over and see a new shot, a new sequence, and new set of emotions tied to things. It's one of the great romantic dramedies of the decade.",
        "title": "an modern artistic triumph for all involved",
        "date": "2004-10-27"
      },
      {
        "author": { "name": "movielover-456", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "This movie had me laughing and crying throughout. The performances were so genuine and the story was so relatable.",
        "title": "Genuine performances",
        "date": "2020-08-03"
      },
      {
        "author": { "name": "filmcritic-123", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "This movie is a masterpiece. The writing is so clever and the acting is outstanding.",
        "title": "Clever writing",
        "date": "2020-08-15"
      }
    ]
  },
  {
    "id": "tt0105236",
    "reviews": [
      {
        "author": { "name": "ronnay_barkay", "id": "/user/ur4188845/" },
        "interestingVotes": { "down": 127, "up": 377 },
        "text": "The first time I saw Reservoir Dogs, I was about 15, it had been banned in my country, and I heard it was extremely voilent. Naturally I did everything in my power to get my paws on a copy, and when I finally did see it, I was disappointed. I was just sitting there saying \"Wheres all the violence\", Anyway, I watched it till the end, and then I watched it again, and since then it has just grew on me.\n\nThis is one of the movies I don't get bored watching time and time again. I still watch it at least once a year, because its not the kind of movie you watch to unwind or to pass the time. You simply watch it for the sheer quality and originality of the movie. The one liners are classic: \"Are you gonna bark all day...\", \"I'll make you my dog's bitch\". Mr.Blonde is totally believable as a psycho. I mean who stops to get fries and soda just after committing a robbery? The fact that everything is ludicrous, but you don't know this because these guys, and the way they talk is so impossibly cool that you just accept it. This movie is all about the dialog. The violence is used sparingly, and to better effect. The way the film is edited is genius. Its almost like you forget the whole movie after you watch it, and the next time you watch it, there's a whole scene that you forgot was there. The storyline is unpredictable and thrilling. This is better that Pulp Fiction and in my opinion definitely Tarintino's best movie. I didn't care much for the \"Kill Bill\" movies, but who cares, I'm not reviewing them.\n\nIf you haven't seen Reservoir Dogs, just rent it, buy it or steal it right now.",
        "title": "A timeless classic...seriously",
        "date": "2005-07-15"
      },
      {
        "author": { "name": "cinemalover-789", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "I can't recommend this movie enough. The story is so powerful and the performances are amazing.",
        "title": "Powerful story",
        "date": "2020-08-27"
      },
      {
        "author": { "name": "filmfan-456", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I loved everything about this movie. The writing, directing, and acting were all top-notch.",
        "title": "Top-notch in every way",
        "date": "2020-09-08"
      }
    ]
  },
  {
    "id": "tt8267604",
    "reviews": [
      {
        "author": { "name": "salahdeanmoussalli", "id": "/user/ur93570256/" },
        "interestingVotes": { "down": 31, "up": 136 },
        "text": "It's almost like documentary, real honest raw emotions of unfortunate forgotten children in the world in any country with homeless or refugee kids",
        "title": "Moving touching human film",
        "date": "2018-10-07"
      },
      {
        "author": { "name": "moviebuff-123", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "This movie is a work of art. The visuals are breathtaking and the acting is phenomenal.",
        "title": "A work of art",
        "date": "2020-09-20"
      },
      {
        "author": { "name": "cinephile-789", "id": "/user/ur123456789/" },
        "interestingVotes": { "down": 3, "up": 8 },
        "text": "I couldn't believe how much this movie affected me. The message is so important and the acting is stunning.",
        "title": "Important message",
        "date": "2020-10-03"
      }
    ]
  },
  {
    "id": "tt2106476",
    "reviews": [
      {
        "author": { "name": "kinoreview", "id": "/user/ur6696929/" },
        "interestingVotes": { "down": 36, "up": 214 },
        "text": "'The Hunt' is a truly accomplished film, its simple premise and themes are executed perfectly. The film is hugely engrossing and completely and utterly infuriating, which is a testament to the merits of its acting, direction, script and hyper-realism.\n\nThe film follows Lucas (Mads Mikkelsen), a lonely primary school teacher who relishes his job and is popular with both the children and the local community. Just as he meets Nadja (Alexandra Rapaport) and begins a relationship with her, his relationship with another woman, 5-year-old Klara (Annika Wedderkopp), lands him in immeasurable trouble. What happens is a completely innocuous misunderstanding, but the community, the 'adults' who are supposed to be rational and fair, turn into a lynch mob.\n\nThe film is about the danger of mass hysteria, ignorance and subsequently the frightening power of numbers. It teaches the importance of measure and consideration; it's a much-needed anecdote to the sensational vilification, general ignorance, and trashy media that permeates our lives.\n\nThe film is intelligently and thoughtfully written. The girl is by no means vindictive; as much as you want to vent your anger, she's clearly far too young to understand what is happening. It's the 'adults' who display their stupidity, their total lack of reasoning and fairness left me indignant for the entirety of the running time and subsequently the whole evening - the film really works.\n\nThere is a palpable sense of danger throughout the film, and you genuinely fear for Lucas' life; seldom have I empathised with a character so dearly. Who would've thought a Danish Art House film could be so thoroughly gripping?\n\n'The Hunt' is a thought-provoking, tactful and important film that should be seen by as many people as possible. It's one of the best films of 2012.",
        "title": "A thoroughly gripping drama from Thomas Vinterberg",
        "date": "2013-03-06"
      },
      {
        "author": { "name": "filmaddict-456", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "This movie had me hooked from the opening scene. The tension never let up and the ending was so satisfying.",
        "title": "Hooked from the opening scene",
        "date": "2020-10-15"
      },
      {
        "author": { "name": "movielover-123", "id": "/user/ur901234567/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "I was skeptical about this movie going in, but it completely won me over. The visuals were stunning and the story was so compelling.",
        "title": "Completely won me over",
        "date": "2020-10-27"
      }
    ]
  },
  {
    "id": "tt0033467",
    "reviews": [
      {
        "author": { "name": "Cineanalyst", "id": "/user/ur1888886/" },
        "interestingVotes": { "down": 2, "up": 13 },
        "text": "The most frequently acclaimed \"greatest film ever,\" idiosyncratic in its day yet massively influential, a cultural staple, a narrative and technical tour de force, and there's the whole thing of the wunderkind granted carte blanche for his debut to the machinery of classical Hollywood at its peak--the expectations for \"Citizen Kane,\" to say the least, are high. Indeed, it's a marvel of cinematography and plot. In both senses, there's a deep focus from various angles. The plot is a jigsaw puzzle of flashbacks from multiple sources--the \"News on the March\" film-within-the-film, the dead man's memoir, a reporter interviewing characters for the meaning of \"Rosebud\"--linked by an also-layered sound design and framed by a curious camera violating the \"No Trespassing\" sign in entering and exiting the Xanadu estate. Moreover, the story is about a powerful storyteller notoriously based on William Randolph Hearst (and other famous rich guys, if not also a bit of Orson Welles)--a newspaper man, populist politician, overseer of his lover's career, and who even dictates the story beyond his grave with his final word. The picture constantly exploits a deep depth of field, with figures in the foreground and background in focus, to show it off. Much of this was accomplished by composite photographic effects. While \"Kane\" is famous as an arty old black-and-white film, which it is, it belies that it was genre-mixing popular entertainment and a special-effects extravaganza of its day: the virtuosity of the editing and sound design in addition to the matte paintings, miniatures, multiple-exposure photography, rear projection, and the most significant use of the optical printer in between \"King Kong\" (1933) and \"Star Wars\" (1977). The difference is that the effects here are realistic as opposed to fantastic.\n\nOutside of co-writer Herman Mankiewicz, cinematographer Gregg Toland and Welles, arguably the most important contributions to the production came from Linwood Dunn and his optical printer, and that's not even to mention a score by Bernard Herrmann, editing from Robert Wise, and contributions from a host of less well-known technicians doing career-best work, including lead matte painter Mario Larrinaga, the special-effects team's boss Vernon Walker, and art director Perry Ferguson. More than half the picture has been guessed to be effects shots. According to Dunn, \"Once Orson Welles learned about the optical printer he just went hog-wild with it.\"\n\nFrom the start, there's a miniature for the gate with the matte paintings of Xanadu in the background, and dissolves--lots of long dissolves in this one (and wipes and a few more dazzling effects)--transition between ever-closer views of the lit window, always matching the same frame position, until a reverse angle shot inside followed by an extreme close-up of Kane's lips, with the added snow effects, as he mutters the dying word. The reflection of the nurse in the broken snow globe was created with Dunn's printer. There are many such marvelous compositions throughout. In the \"News on the March\" reel, a terrific film-within-film newsreel parody overall (including intentional scratches and, reportedly, edited by RKO's newsreel department, to make it look authentic), a shot of construction of Xanadu is cobbled together from an actor in the foreground, stop-motion trucks in the middle plane, and the matte painting of the mansion atop the hill. There's also the pre-\"Forrest Gump\" (1994), pre-\"Zelig\" (1983) insertion of Kane into archival footage. Other treated shots include the camera moving through the window of the El Rancho nightclub for Susan Alexander Kane's scenes, the downward tilting shot from the miniature statue of the Thatcher library, the tilt upwards to the rafters of the workers reacting to Susan's singing, and rear projection and multiple-exposure compositions being employed where the deep, or pan, focus was otherwise impractical, such as when there were figures extremely close to the camera and in the extreme background with another plane for the middle action--the shot of young Kane through the window playing in the snow, the three-tier composite of Boss Getty observing Kane's campaign rally, Leland's firing, Susan's suicide attempt, the shot with the parrot, e.g. Of course, these effects were in service to what was already a uniquely-photographed picture.\n\nWith good reason, Welles shared the final screen credit with his cinematographer. According to Toland, the demands of deep focus and stagings and camera angles that included ceilings necessitated some unusual lighting setups, and the film has also been credited for the first extensive use of coated lenses and a new film stock. Kane walking back to the windows before sitting down in one scene is a standout that plays with perspective while also underscoring Kane's metaphorical position in the world (i.e. he feels small or distant and is literally so in the image). Similar setups are repeated for when Charles walks up to Susan practicing or in their distant exchanges of reverberating dialogue in the large mansion as she puts puzzles together. Shadows act the same way, such as when she's figuratively and literally in his shadow when he insists she continue her career. The effect is a staggeringly unique picture--not only in a showy manner, although there's an undeniable bravado to it all, but also in a way to explore figures in space in the same way as the narrative investigates characters and their perspectives.\n\nThe long takes in deep focus to keep all the figures staged in depth in sharp relief--pan focus--as assisted by the optical printer when wide-angle lenses weren't enough, in addition to the unusual angles--especially the low ones featuring ceilings--function to visually depict a plot that is also all about focusing on every character and from every angle, while much still remains in the dark. The visuals are as ambiguous and complex as the narrative: multiple perspectives, with some scenes repeated but appearing differently depending on the narrator, pan focus with figures often obscured, or just turned into silhouettes, by the harsh shadows of the chiaroscuro lighting. We never quite get a good view of the reporter Thompson, e.g., his back usually to the camera and his face in shadows when not, such as in the screening-room scene, which is apt given that he's our surrogate, the unseen spectator within the film. He even wears glasses; he sees through lenses, as we do through the camera. And, in this case, that camera is even more curious than and as much a character as Thompson and isn't slowed down by closed doors or windows and goes through a desk during one point at Kane's childhood home.\n\nBesides Toland, Welles shared credit with co-writer Mankiewicz. The non-linear, kaleidoscopic, sometimes restricted narration and sometimes not, flashback-structured plot, with events repeated from different points of view, including a newsreel overview that mirrors the film proper, remains one of the most wonderfully convoluted film narratives. One may get overly caught up in the story and characters, but as with the imagery, it's the structure of the thing that's brilliant. The Rosebud mystery is merely a device to drive the plot. Kane isn't a character trapped in a snow globe by a single word. Everything here is multifaceted. \"You're talking to two people,\" as he says at one point. He has two wives, two friends, two sleds, scenes are doubled and framed and reflected in visual motifs--glass, windows, doorways and mirrors. Near the end, we get the iconic hall-of-mirrors shot: the film in a nutshell.\n\nRosebud is also part of but one or two genres in \"Kane.\" It's a detective mystery, but as investigated by wisecracking newsreel reporters, like those who work at Kane's newspaper, it's an entry in the journalism films of the era--\"His Girl Friday\" (1940) meets noir. It's a fictional biopic, as well as part musical (Susan's opera, the dance number at the newspaper's party), political thriller, Shakespearean tragedy and lighthearted comedy. Welles and the rest of the Mercury Players' background in radio was surely instructive, as it's the sound design that underscores these tonal shifts, equal measure playful and ominous and continually serving as transitions between scenes. The score fits seamlessly, and the editing is often inspired (e.g. the table sequence for the first marriage, or some nice match cuts throughout, as well as managing the mixture of long takes and quick montages), but there's also techniques such as overlapping dialogue and sound bridges used extensively and informed by radio practices. The shocks cuts where shot transitions are accompanied by sudden changes in sound and score may be the best, and there's a visual equivalent with the reveal of background by the sudden removal of foreground objects, such as with the newspaper in Welles' first scene.\n\nWelles and company were already famous for the \"The War of the Worlds\" radio drama, as well as theatrical productions, so it's no wonder the makeup-enhanced acting from actors new to film was already better than the acting in most films. Like \"The War of the Worlds,\" made infamous as a catalyst of mass hysteria, its reputation only enhanced by fabricated newspaper reporting and inflated mythology, \"Kane\" demonstrates the power of storytelling, effects, genre and plot--the radio adaptation was so effective, after all, because the fictional news interrupted additional staged programming, not unlike the \"News on the March\" and other narrative tricks in the film. With the control and freedom granted from the radio-based RKO, Welles and company were able to do something even greater with the recruitment of some of the best talents in Hollywood for the primarily visual art form of cinema. There are reasons it's remained in the conversation as such, whether or not one considers it the greatest film of all time.",
        "title": "The Citizen Kane of Movies",
        "date": "2020-12-06"
      },
      {
        "author": { "name": "filmcritic-789", "id": "/user/ur789012345/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "I think this might be one of the best movies ever made. The writing, directing, and acting all come together perfectly.",
        "title": "One of the best movies ever made",
        "date": "2020-11-09"
      },
      {
        "author": { "name": "cinemalover-456", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "This movie had me in tears by the end. The emotional journey that the characters go on is so powerful.",
        "title": "Powerful emotional journey",
        "date": "2020-11-21"
      }
    ]
  },
  {
    "id": "tt0056172",
    "reviews": [
      {
        "author": { "name": "iain_connell", "id": "/user/ur4665941/" },
        "interestingVotes": { "down": 80, "up": 428 },
        "text": "I first saw this film on its release, aged 13, and it forms an important part of my transition towards adulthood. I am pleased to see that it consistently rates 20something in the IMDb listings, even from others (whom I envy, for I can't see it with fresh eyes) who are seeing it for the first time. Pleasing too is that some of those are also teenagers, for whom a forty-three year old film must itself seem part of the past. As for the minority who are bored by intentionally slow pacing (and for whom punctuation, paragraphing and grammar are a lost art), I suggest they learn a little about the history of film-making (from which it may become apparent that much of today's fast editing techniques were invented in the 1920s: try Eisenstein's October, for example).\n\nFrom the universally admired cinematography of Freddie Young, the long shot of Omar Sharif's floating mirage entry, the pre-CGI battles and pan-up scene changes, to O'Toole's florid but career-defining performance and the (then) novel time-shift narrative, this film set standards not matched even by Lean himself, and, as many reviewers have commented, financially and practically unlikely to be attempted today. I too have rarely seen such clarity of image outside of Imax, and in my view the script by Robert Bolt (and I now have learnt, an uncredited Michael Wilson) is the finest in cinema. Maurice Jarre's music and some of the acting style now seem a little excessive, but repeated viewing (around 35 times in my case) does not diminish the impact and quality, and the restoration and now DVD release still, after all these years, approaches the effect of that first 1962 viewing.\n\nIt is rare that repeated watching of a film (as opposed to a live performance) does this, and the reasons go beyond the photography, performances and editing. In my opinion, it is because the characterisation and storytelling encourage an appreciation of the ambiguity and inconsistency behind our motives and behaviour, and, in a wartime scenario, in the contrast between political expedience and personal morality. For a 13-year old, this opened a window into the adult world, and it explains why the story has resonance far beyond its setting. The film doesn't require an understanding of middle-east politics (though it does have some very current relevance), but it does require an ability to look, listen and understand. The fact that so many people rate it so highly says everything about its wider impact. When The Matrix and even Lord of the Rings have slipped out of the ratings (and the adolescents who inhabit these pages have grown up), I believe this film will still be in the 20s or 30s, perhaps enabling young people to once again see the world through adult eyes.\n\nLike Ali, I fear Lawrence. I fear the power of art to change us, to challenge our preconceptions. Every time I see this film I learn a little more, discover something new. When I was 13 I didn't understand much, but this film helped me to see that I wanted more, knew more, than my peers. I can't rate it more highly than that.",
        "title": "Still my personal favourite",
        "date": "2005-01-26"
      },
      {
        "author": { "name": "filmfan-123", "id": "/user/ur567890123/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "I can't believe it took me so long to watch this movie. It's a modern classic that everyone should see.",
        "title": "Modern classic",
        "date": "2020-12-03"
      },
      {
        "author": { "name": "moviebuff-789", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 3, "up": 8 },
        "text": "This movie was a masterpiece. The visuals were stunning and the story was so moving.",
        "title": "Stunning visuals",
        "date": "2020-12-16"
      }
    ]
  },
  {
    "id": "tt0022100",
    "reviews": [
      {
        "author": { "name": "EThompsonUMD", "id": "/user/ur0182733/" },
        "interestingVotes": { "down": 13, "up": 172 },
        "text": "Fritz Lang's highly influential career as a film director began in post World War I Germany, where he was a leading figure in the German Expressionist film movement, and ended in the United States in 1953 with the production of The Big Heat, a film noir classic. Perhaps his greatest film, M (Germany, 1931) forms an historical bridge between expressionism and film noir. Like the former it uses strange and disturbing compositions of light and dark in order to symbolize the inner workings of the human mind; like the latter it more realistically sets its story in a modern urban setting and blends in sociological issues along with the psychological and moral ones. \n\nEven though M was Lang's (and Germany's) first sound film, many historians cite it as the initial masterpiece of cinema to appear following the introduction of sound into films in the late 1920's. While most early \"talkies\" return films to their static, visually monotonous, stage- imitative beginnings and thus limit rather than expand the artistic possibilities of the medium, M avoids the failing by skillfully balancing asynchronous, off-screen sounds with the more limiting use of synchronous dialogue. The film's editing, particularly its elaborate use of parallel cutting, also contributes kinetic energy and fluidity to the storytelling. Of course, many of the film's sound effects are also imaginative and memorable, none more so than the compulsive whistling of the film's central character, the stalker and serial killer of little girls Hans Beckert (magnificently played by Peter Lorre). \n\nSound is also an important contributor to M's rich and influential use of off screen space. One famous example is the scene that introduces Beckert as a shadow against his own Wanted poster, creepily intoning to his next victim, Elsie Beckmann, \"You have a very pretty ball.\" Not only is Beckert's shadow a bow toward Lang's expressionist artistic roots, but it ironically places the murderer in the implied space in front of the image - that is, among us, the human community of viewers of which he is an innocuous-appearing, albeit monstrous, member. Another example of Lang's use of off-screen space is the montage of shots whose common denominator is Elsie's absence from them: an empty chair at the Beckmann dinner table, the vertiginous stairwell down which Elsie's mother searches compulsively and futilely for signs of her daughter's arrival, the attic play area that awaits Elsie's return from school. Most memorable of all - and most often alluded to visually in other films - is the series of shots that indirectly record Beckert's assault and murder of the innocent child, representing these off screen events metonymically via the entry of Elsie's ball from bushes along on the right edge of the frame and the release of her balloon from telephone wires and off the left edge of the frame. Never in the history of cinema has something so terrible been communicated through such powerfully understated images.\n\nBeyond its technical brilliance, the keys to M's lasting impact are its psychologically convincing portrait of Hans Beckert's twisted compulsion and the still relevant ambivalence of his capture and \"trial.\" Unlike contemporary cinematic examples of the serial killer, Beckert is not presented simply as a grotesque psychopath. Nor is the issue of how society should deal with him at all clear-cut. To be sure, the gut-reaction of most film audiences is to root on the underworld mobsters and petty thieves who, beating the established authorities to their mutual quarry, capture Beckert and bring him to a mock- formal trial whose conclusion is foregone. Like many in America today, Beckert's accusers are disinclined to listen to insanity pleas and would just as soon be rid of the \"monster\" in the surest way possible: a summary death penalty with as little fretting about legal rights as possible. \n\nConsidering the heinousness of Beckert's crimes and the imperfections of a legal/medical system that could well turn him loose to kill again, this emotional response is hard to resist. Yet M is by no means an endorsement of vigilantism - quite the contrary. Through the unlikely rhetorical persuasions of Beckert's unkempt \"court appointed\" defense attorney and Beckert's own impassioned monologue, Lang strongly implies that impatience with democratic judicial procedure and a paranoid eagerness to scapegoat others (guilty or not) in the name of order are symptomatic of the social hysteria breeding Nazism in 1930s Germany. That the ruthless killer who heads the underworld looks, dresses, and gestures like a Gestapo officer is no accident. Moreover, the letter \"M\" chalked on Beckert's back by one of his pursuers not only stands for \"murderer\" but also alludes to God's marking of Cain. While the popular misconception holds that the mark of Cain symbolizes his evil, it in fact represents God's warning to Cain's flawed fellow creatures not to mete out wrathful vengeance, but to leave justice in God's hands. Translated into secular terms (and literally entering the shot from the top of the frame), God's hands in M belong to the legitimate authorities that intervene at the last moment to arrest and try Hans Beckert \"in the name of the Law.\"",
        "title": "Influential and unforgettable masterpiece.",
        "date": "2006-03-31"
      },
      {
        "author": { "name": "cinephile-456", "id": "/user/ur345678901/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I was completely engrossed in this movie from beginning to end. The direction was flawless and the lead actor gave an amazing performance.",
        "title": "Completely engrossed",
        "date": "2020-12-28"
      },
      {
        "author": { "name": "filmaddict-123", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This movie deserves all the praise it's been getting. The writing was brilliant and the performances were top-notch.",
        "title": "Deserves all the praise",
        "date": "2021-01-10"
      }
    ]
  },
  {
    "id": "tt0091251",
    "reviews": [
      {
        "author": { "name": "maurernh1", "id": "/user/ur2013283/" },
        "interestingVotes": { "down": 18, "up": 70 },
        "text": "Come and See is one of the rare films that I can remember being emotionally drained upon its conclusion. The expression on my face as I sat there watching the credits scroll by seemed as worn and broken as that of the protagonist, Florya.\n\nThe film follows Florya as he \"joins\" (i.e. obtains a gun) a partisan group resisting the German advancements in the forests of his native Byelorussia during World War II. What he witnesses at the ripe age of 12 changes a once open-eyed, smiling face into a weathered, traumatized one that has experienced the unimaginable.\n\nAnd of course the unimaginable were the Nazi atrocities committed during the war. Come and See does not focus on what the German Army did to the Jewish population but rather what they did to the native Soviet population. The Nazis were not only concerned with the utter destruction of the Jews but of the Bolshevik Party as well. And to Hitler that meant any man, woman, or child living under communist rule. And this \"cleansing\" fell into the hands of the SS who, as depicted in the movie, literally destroyed every sign of life.\n\nFlorya is able to escape death, unlike the rest of his family, but serves as a witness to the destruction and in this sense \"dies\" as his innocence and youth is lost. Klimov does a masterful job and depicting this slow death by concentrating on the facial expressions of Florya versus that of the Germans and both of their transformations over time. Klimov's Hitler montage at the end is especially moving and puts an interesting spin on the whole \"what if\" question.\n\nThis is the most historically accurate war movie I have ever seen and would highly recommend it to any war/history enthusiast. But I would also recommend it to any film watcher that realizes the goal of the medium which is to evoke emotion in the audience, and Come and See does just that.",
        "title": "Quite possibly the most powerful film I have ever seen.",
        "date": "2006-04-29"
      },
      {
        "author": { "name": "movielover-789", "id": "/user/ur012345678/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "I was on the edge of my seat throughout this entire movie. The pacing was perfect and the twists kept me guessing until the very end.",
        "title": "Kept me on the edge of my seat",
        "date": "2021-01-22"
      },
      {
        "author": { "name": "filmcritic-456", "id": "/user/ur890123456/" },
        "interestingVotes": { "down": 1, "up": 10 },
        "text": "I can't stop thinking about this movie. The performances were outstanding and the ending was so satisfying.",
        "title": "Outstanding performances",
        "date": "2021-02-03"
      }
    ]
  },
  {
    "id": "tt0053125",
    "reviews": [
      {
        "author": { "name": "DrLenera", "id": "/user/ur2666204/" },
        "interestingVotes": { "down": 47, "up": 147 },
        "text": "North By Northwest is not an artistic masterpiece like Rear Window and Vertigo, but it is probably the most purely entertaining picture Hitchcock ever made. It's essentially a rehash of many of his earlier films, with a plot partially derived from The Thirty Nine Steps and the very similar Saboteur, while there are borrowings from Foreign Correspondent and Notorious, among others. However, it is all done with such style and confidence that it doesn't matter if it's essentially just a greatest hits package.\n\nVery few other films of this kind attain the near perfect tone of this one, precariously balanced between seriousness and silliness. Sometimes this film manages the very difficult trick of being both suspenseful and comical at the same time, as in the auction house scene, or the wonderful scene in the lift when the hero's mother turns to two heavies in a lift looking menacingly at the hero and says \"you gentlemen are not REALLY trying to kill my son, are you?\".\n\nOf course the famous crop dusting plane scene and the Mount Rushmore chase are terrific. The former is really more notable for the amount of time taken to build up to the action than the action itself, while the technical work on the latter still looks pretty good. In a totally different vein is the astonishingly frank seduction sequence on the train. Hitchcock takes his time here as with many of the other scenes, but the film is so crammed with memorable passages that one hardly notices it's 136 mins long.\n\nErnest Lehman's script is full of wonderful lines, many of them delivered so well by chief villain James Mason that at times we almost want to root for him. \"Has any one ever told you tend to overplay your various roles Mr Kaplan....it seems to me you fellows could stand a little less training from the FBI and a little more from the Actor's Studio\". Cary Grant is so smooth one almost forgets he's over 50, and of course there's also Bernard Herrmann's vibrant score.\n\nEndlessly enjoyable even with repeated viewings. How many of today's thrillers will be such fun in 25 years time?",
        "title": "Wonderful comedy thriller, not Hitchcock's best but his most sheerly enjoyable",
        "date": "2004-09-30"
      },
      {
        "author": { "name": "moviemaniac-789", "id": "/user/ur678901234/" },
        "interestingVotes": { "down": 3, "up": 8 },
        "text": "I didn't think I would like this movie, but I ended up loving it. The themes were thought-provoking and the direction was masterful.",
        "title": "Themes were thought-provoking",
        "date": "2021-02-15"
      },
      {
        "author": { "name": "filmfan101", "id": "/user/ur456789012/" },
        "interestingVotes": { "down": 0, "up": 11 },
        "text": "This is one of the best movies I've seen in a long time. The character development was superb and the plot was engaging from start to finish.",
        "title": "Superb character development",
        "date": "2021-02-27"
      }
    ]
  },
  {
    "id": "tt0052357",
    "reviews": [
      {
        "author": { "name": "planktonrules", "id": "/user/ur2467618/" },
        "interestingVotes": { "down": 8, "up": 29 },
        "text": "It's rather strange that this film was a box office flop, as it's one of Alfred Hitchcock's better movies. The only problem with \"Vertigo\" is that in order to really enjoy it, you need to turn off your brain and just accept the movie. If you think the plot out TOO MUCH, you'll find yourself asking too many questions and not just enjoying the film...like my oldest daughter did.\n\nThe film is the story of a somewhat creepy ex-cop (James Stewart). When the film begins, he's emotionally scarred in an accident-an accident that leaves him with a HUGE case of psychologically-based vertigo. He decides to quit the job and is soon approached by an old friend--who wants to hire him to follow his emotionally disturbed wife. What happens next is very weird--and later becomes really creepy. I could say A LOT more but think it's best you just see the film--it has quite a few twists and turns that are bound to catch you by surprise.\n\nOverall, a wonderfully original film. The only deficit, for some, is that although Stewart was a wonderful actor, he was too old for this role. Still, I could look past this and enjoyed it immensely.",
        "title": "Creepy and engaging.",
        "date": "2012-08-31"
      },
      {
        "author": { "name": "cinemalover-456", "id": "/user/ur234567890/" },
        "interestingVotes": { "down": 1, "up": 9 },
        "text": "I wasn't sure what to expect going into this movie, but it exceeded all my expectations. The cinematography and soundtrack were amazing!",
        "title": "Exceeded my expectations",
        "date": "2021-03-12"
      },
      {
        "author": { "name": "moviebuff-123", "id": "/user/ur125678903/" },
        "interestingVotes": { "down": 2, "up": 7 },
        "text": "This movie blew me away! The acting was incredible and the story was so well-written. I highly recommend it!",
        "title": "Incredible acting and story",
        "date": "2021-03-25"
      }
    ]
  }
]
